{"author": "WaywardMarcher", "body": "The only thing I see wrong is absolute Holocaust denial (though he has every right to be ignorant if he so wishes). The weird thing is... his other arguments make sense for reasons he doesn’t realize.\n\nYes, certain races tend to have a higher IQ (it’s called the Bell Curve, and it is well worth looking into the book of the same name). That’s why his (((Jew))) theory is partially true, in my opinion. Jewish people are often very intelligent in areas that will get them a lot of money, into powerful positions, and into more colleges. That’s why he’s right: there are a ton of Jewish people in these positions, but it doesn’t have anything to do with any malicious conspiracy theory. It’s strange how he doesn’t connect the dots with his own beliefs; he already believes in the race-IQ differences, but doesn’t associate that with the reason behind Jewish people in power. It isn’t racist to say Jews are smart, successful people, because that’s all it actually is!\n\nExample: It’s like how Asians are often denied scholarships because there are so many other Asians already there. It’s not because Asians have a conspiracy to control college campuses or careers: they’re often just intelligent.\n\nIn any case, I see why people may feel uncomfortable with him. But I see it as an edgy guy throwing lesser known taboo facts around.", "score": 1, "send_replies": true, "subreddit": "LouderWithCrowder", "date_year_month": "2019-03", "created_utc_converted": "2019-03-02 16:37:19", "score_overall": 7, "words": "holocaust jew jewish jewish conspiracy jewish conspiracy", "shared_words": "holocaust jew jewish conspiracy", "socre_distint": 4}
{"archived": false, "author": "PutMeInAJailCel", "body": "I suggest you watch this documentary because it's quite interesting. Here are some highlights:\n\n6:30 Israeli grandma says jews are crooks and stay abroad\n\n19:47 Old poles say hi to jewish girls on a field trip. The girls are primed so hard to believe that anti-Semitism is everywhere to the point where they believe that the Poles are saying antisemitic things (with no evidence). They act offended and walk away.\n\n27:30 Group of blacks in the US are surprisingly Jwoke.\n\n38:30 Jewish lady says she uses white guilt to her advantage to get what she wants from goyim\n\n42:09 Orthodox Jewish community members from Kiev, Ukraine says antisemitism doesn't exist there and that secular jews in the US use fighting antisemitism as a way to connect to their heritage since they don't practice. Next scene shows secular jews saying the same exact thing.\n\n54:10 Jewish professor Norman Finkelstein and son of Holocaust survivors says Jews are trying too hard to play victim and are intentionally conflating Anti-Israel sentiments with antisemitism\n\n1:04:00 ADL and Israel govt. are butthurt because two American Jew professors wrote about how Jews and AIPAC are trying to support Israel even if it goes against the US interests. Book link:\n\nhttps://en.wikipedia.org/wiki/The_Israel_Lobby_and_U.S._Foreign_Policy\n\n1:05:00 Baste jew calls out Israel for human rights violations straight to their faces. Israelis are *massively* butthurt and do *not* like anybody criticizing them. Two jews basically say that any Jew that doesn't support Zionism is a cuck.\n\n1:21:44 Jew says other jews are trying too hard to remember holocaust. Immediately after, another jew tells him he shouldn't sit where he's sitting because some jews died there. topkek", "score": 2, "send_replies": true, "subreddit": "Clownworldwar", "date_year_month": "2019-03", "created_utc_converted": "2019-03-02 21:57:31", "score_overall": 12, "words": "jewish jewish goyim jewish jewish holocaust jew jew jew jew holocaust jew", "shared_words": "jewish goyim holocaust jew", "socre_distint": 4}
{"author": "AnotherAlire", "body": "[evaluating other cultures according to preconceptions originating in the standards and customs of one's own culture.](https://www.google.com/search?client=firefox-b-d&amp;q=ethnocentric)\n\nWhat exactly do you mean?\n\nJews weren't inconvenient to the Germans or their national aspirations.\n\nChristian Empires throughout history have hated the Jews, their religion and have hated other cultures, particularly in the Middle East. That's where 20th and 21st century anti-Semitism/Islamophobia in Europe comes from and that's why the Jews were hated not just in Germany but throughout Europe. It just so happened that the Jews were an effective scapegoat for Germany's troubles at the time which mostly stemmed from the abysmal state of Germany after WW1 and the unreasonable amount of reparations they were forced to pay after the Versailles Peace Conference.\n\n&gt; perhaps also the Arabs  \n\nNetanyahu level of conspiracy theory right here. Are you sure you're not engaging in Nazi apologetics or Holocaust denial?\n\n\n[Benjamin Netanyahu Is Fine With Anti-Semites — as Long as They Support Israel’s Occupation](https://youtu.be/3yr0G50rL28?t=226)\n\nAlso: [Historians, politicians slam PM's 'distortion of history'](https://www.ynetnews.com/articles/0,7340,L-4714313,00.html)\n\n&gt;Speaking of the blessing thing, there is a stream of Zionism that called Religious Zionism that stats show about 10% of Jews profess and it believes in a special holiness to the Jewish state. They even have a political party in Israel called Jewish Home (Bayit Hayehdui). In Religious Zionism, providence explains how Israel won against the Arab world in the 48, 67, and 73 wars, and surviving still while outnumbered 200:1.\n\nIsrael won because of tactical and military advantages. In particular stupid military decisions by the Arabs and incompetence in war. If their victories were divinely inspired, their military wouldn't have suffered such a humiliating defeat against Hezbollah, who don't have even 1/10th of the military power of Israel. And they're also consistently repelled by Hamas when fighting on the ground, Israel is effective at raining terrorism from the sky against a starved concentration camp. There is also the other thing of genocide, as I said. If it is the belief of Zionists or some Zionists that Israel can be divinely inspired in spite of their genocide and ethnic cleansing, I think that says more about their faith than the state of Israel and/or Zionism.\n&gt; Ultimately the secular Israeli state, blessed by G-d, will lead to a Messianic Age, the olam habaah where Israel becomes something like a superpower, and Jerusalem, the holiest city to Jews, the capital of the world. 10% is not a huge number, but not small either. \n\nDare I point out the elephant in the room, that kind of close minded apocalyptic mindset was the same thing that brought the downfall of the Crusaders and ISIS. People who start thinking it is their actions directly that will bring about the end of times and not the will of Allah. That same backwardness leads to their arrogance, which leads to their inevitable downfall and humiliation.\n\nThis is one of the indicators of extremism in Islam. People, like extremist Christians in the US, who believe their actions will cause the end of times, as if Allah has no will or is powerless against the desires of man. It is again, also an even more extremist belief when people believe they can spread cause the end of times by spreading corruption and oppression. The only thing they will cause is their own punishment by God.\n", "score": 1, "send_replies": true, "subreddit": "islam", "date_year_month": "2019-03", "created_utc_converted": "2019-03-04 05:19:29", "score_overall": 5, "words": "scapegoat conspiracy holocaust jewish jewish", "shared_words": "scapegoat conspiracy holocaust jewish", "socre_distint": 4}
{"author": "Coluphid", "body": "Absolutely. \n\nFor instance Judaism has some rather interesting core tenants that most people have no idea exist. \n\nIt's not helped by the fact that complete and unabridged English translations of the Talmud are not permitted to be printed. \n\nMeanwhile go to your fridge or pantry and 90% of the products there will have a kosher mark (which the companies pay a hefty fee for). All for less than 2% of the US population. Isn't that odd?\n\nAnyway here's the tenants from the Talmud. And key thing to remember, this isn't a holy text. It's a socio-religious manual. Literally a defining text on how to be Jewish. 99% of Jews today were raised on this book:\n\nhttps://rense.com/general86/talmd.htm\n\n&gt;To communicate anything to a Goy about our religious relations would be equal to the killing of all Jews, for if the Goyim knew what we teach about them, they would kill us openly.\n \n&gt;Libbre David 37\n \n&gt;A Jew should and must make a false oath when the Goyim asks if our books contain anything against them.\n \n&gt;Szaaloth-Utszabot, The Book of Jore Dia 17\n\n&gt;That the Jewish nation is the only nation selected by God, while all the remaining ones are contemptible and hateful.\n  \n&gt;On the house of the Goy [Goy means unclean, and is the disparaging term for a non-Jew] one looks as on the fold of cattle.\n  \n&gt;Jehovah created the non-Jew in human form so that the Jew would not have to be served by beasts. The non-Jew is consequently an animal in human form, and condemned to serve the Jew day and night.\n \n&gt;Midrasch Talpioth, p. 225-L\n\n&gt;A boy-goy after nine years and one day old, and a girl after three years and one day old, are considered filthy.\n  \n&gt;Pederasty with a child below nine years of age is not deemed as pederasty with a child above that. Samuel said: Pederasty with a child below three years is not treated as with a child above that.24 (24) I.e., Rab makes nine years the minimum; but if one committed sodomy with a child of lesser age, no guilt is incurred. Samuel makes three the minimum.\n\nNow, OP and friends. Watch what happens to this comment, and you'll see both how little free speech exists, even here in this sub, and indeed what you are not permitted to criticize. ", "score": 3, "send_replies": true, "subreddit": "unpopularopinion", "date_year_month": "2019-03", "created_utc_converted": "2019-03-04 18:14:31", "score_overall": 11, "words": "kosher jewish goyim jew goyim jewish jew jew jew jew jew", "shared_words": "kosher jewish goyim jew", "socre_distint": 4}
{"author": "VirtueOrderDignity", "body": "&gt; It's not semantics. By the supreme courts' own ruling, there is no Israeli nationality; the only recognized national is \"Jew\". Druze, Bedouin, and other arab groups living in Israel are not recognized as Israel nationals.\n\nUnlike your racist conception of who is or isn't Jewish, the Israeli definition does not include genetics or pseudo-science, so it's unfair to say any of those groups are categorically excluded.\n\n&gt;History has shown that several countries have been hospitable to jews, including the largest military superpower in the world.\n\nWhen it benefited them. They were just as fine turning away Holocaust refugees years earlier, and had several explicitly anti-semitic presidents after. Our people has always been the go-to target of populists looking for an easy scapegoat, no momentary good will can undo that history or convince us to again put our faith in other peoples' states.\n\n&gt;We also have Netanyahu actively collaborating with antisemitic dictators. Because he does not care about the diaspora, only Israel.\n\nHe's the prime minister of the State Israel, not King of the Jewish people. Of course that's his priority, that's what state governments are for. in terms of security here and now, the diaspora is doing just fine compared to Israel - and any that feel otherwise are free to come, anyway.\n\n&gt;A. The adoption of the two state solution; recognition of Palestine as a state, shared ownership of Jerusalem with Palestine, removal of settlers, an end to the blockade around Gaza &amp; structures built to bissect Palestine from Jerusalem.\n\nThat's not a solution since it eliminates defensible frontiers and constitutes a narrative surrender to the forces calling our attainment of those frontiers illegal, an occupation, etc. You're deluding yourself if you seriously believe such a display of weakness would to anything except invite more aggression from the people who want my people wiped out.\n\n&gt;B. The adoption of the one state solution; a new country (be it Israel-Palestine or Palestine-Israel) where equal rights and treatment of races is enshrined within a constitution, its borders covering both Israeli and Palestinian land, integration of palestinian political parties into Israel's system (as well as the right to vote for all palestinians, same as israelis).\n\nThis would only practically work if you could \"enshrine\" equal population along with equal rights. Otherwise, there will eventually be sufficient popular support to tear down whatever protection the less populous people enjoys. Of course, that would never happen, so this \"solution\" is equally useless.\n\n&gt;If neither choice is taken the situation will continue to destabilize.\n\nIt's been destabilizing in our favour since 1948. I don't want the enemies of my people to have peace and stability as long as they continue to deny its right to exist as a people.\n\n&gt;This is without also pointing out the fact that Palestinians and Mizrahim jews share significant genetic markers with each other\n\nNo, it isn't, because unlike you, I'm not a racist, so I don't care.", "score": -1, "send_replies": true, "subreddit": "ukpolitics", "date_year_month": "2019-03", "created_utc_converted": "2019-03-04 22:40:59", "score_overall": 5, "words": "jew jewish holocaust scapegoat jewish", "shared_words": "jew jewish holocaust scapegoat", "socre_distint": 4}
{"author": "SJ_Slam_Jam", "body": "&gt;one random guy posted incorrect information.\n\nit was an entire thread of them, who all used the same insults as you and brought up the same topics\n\nyou say they've been doing this since the 60s? then they've had 60 years to fuck us up with all these illuminati-level resources you say they have. even if there is a globalist jewish conspiracy, they're clearly not doing their jobs right\n", "score": 1, "send_replies": true, "subreddit": "Kappa", "date_year_month": "2019-03", "created_utc_converted": "2019-03-05 04:02:45", "score_overall": 4, "words": "illuminati globalist jewish conspiracy", "shared_words": "illuminati globalist jewish conspiracy", "socre_distint": 4}
{"author": "mad_science_yo", "body": "I agree with a lot of what you said, but a clarifying point is that AIPAC is an American Jewish organization and not the Israeli government. It’s American citizens lobbying American politicians. \n\nI feel that this distinction is important because as a Jew, I have seen that “the Israeli government controls the US” talking devolve very quickly into “the Jews have dual loyalties and are trying to destroy us from the inside” conspiracy theories. \n\nI think it’s also important to remember that American Jews are liberal by a very vast majority. If they were the only demographic that voted, the US would elect a democrat every time. This fact is conveniently forgotten when AIPAC comes up and suddenly I hear people saying “the only thing The Jews care about is Israel and their hOLy lANd” which is just a version of the antisemetic “dual loyalties” trope I just discussed. \n\nThe rhetoric about diaspora Jews not being loyal to the country they’re in is much older than the I/P conflict and was used to justify historical antisemitism in the holocaust, the Spanish Inquisition,etc.  I hope that gives some context as to why hearing a member of Congress imply that American Jews are some malicious foreign actor is something we take seriously. \n\nI think listening to the mainstream Jewish community about what is and isn’t antisemitic is a good way to go. ", "score": 14, "send_replies": true, "subreddit": "politics", "date_year_month": "2019-03", "created_utc_converted": "2019-03-05 06:31:00", "score_overall": 5, "words": "jewish jew conspiracy holocaust jewish", "shared_words": "jewish jew conspiracy holocaust", "socre_distint": 4}
{"author": "[deleted]", "body": "There are many examples but the Jews have been the scapegoat of the day since Assyria, and are indeed a special case, as it's the longest going bit of racism we have at hand. \n\nBlood libel, globalist finance conspiracy stuff started in classical antiquity. \n\nThen there's the small fact that 80 years ago 6 million of them were murdered. \n\nOther forms of weird historical racism include the Yazidis, Kurds, Irish, slavery related racisms, it's not uncommon at all for you to need context to understand how and why a group is persecuted. ", "score": 2, "send_replies": true, "subreddit": "LabourUK", "date_year_month": "2019-03", "created_utc_converted": "2019-03-06 12:50:16", "score_overall": 4, "words": "scapegoat libel globalist conspiracy", "shared_words": "scapegoat libel globalist conspiracy", "socre_distint": 4}
{"author": "Whatifimjesus", "body": "Similar to my dinner with dad too. Last time he told me the jew globalist conspiracy. Kind of funny considering both sides of my family were Jewish immigrants at some point. ", "score": 3, "send_replies": true, "subreddit": "politics", "date_year_month": "2019-03", "created_utc_converted": "2019-03-06 15:27:51", "score_overall": 4, "words": "jew globalist conspiracy jewish", "shared_words": "jew globalist conspiracy jewish", "socre_distint": 4}
{"author": "LumpyPresentation", "body": "President Trump and his administration have made decisions and promoted dangerous rhetoric that is being interpreted as implicit support of egregious actions from the far right.\n\nIn 2009 and 2015 the Department of Homeland Security, as well as the FBI, warned us about the rise of far right terrorism.[1] In one of his first acts as President he cut funding to programs meant to combat far right terrorism.[2] This action was taken when there is a growing trend of anti-government terrorism.[3] The United States of America is a victim of 300 violent attacks inspired by the far right every year.[4] The threat of Islamic terrorism should never be overlooked and should be taken very seriously, however President Trump's administration completely ignores one of the largest perpetrators of terrorism in America.[5]\n\nThe frequency of far-right attacks is particularly significant in the United States, where white supremacist, anti-government and neo-Nazi extremists have been responsible for 73 percent of deadly terrorist attacks since Sept. 11, 2001, according to the Government Accountability Office. Also notable is that in many cases, Muslims have become the target of violence.\n\nFor example last year three men from Illinois who were charged for planning to bomb a mosque. One of the men drafted a border wall plan for Trump.[6] I'll include this small excerpt from an article by USA Today, I implore everyone to read how far right terrorism is rapidly accelerating in America. This all occurred in a single week in May of 2017 and yet President Trump is still waiting for all the facts before he does anything.[7]\n\n• May 20 – Richard Collins III, an African American and Bowie State University student, was stabbed to death by Sean Urbanski, a member of a Facebook group called the \"Alt-Reich: Nation.\"\n\n• May 26 – Three men in Portland tried to stop white supremacist Jeremy Christian from harassing two women who appeared to be Muslim. For their bravery, the three men were viciously attacked; two were murdered and the third was seriously injured.\n\n• May 27 – Anthony Hammond was arrested in Clearlake, Calif. for allegedly stabbing a black man with a machete, after yelling racial slurs. While en route to the Lake County Jail, Hammond threatened to kill the transporting officer and his family once he was released. Hammond was charged with committing a hate crime, among other charges.\n\n• May 28 – Two Native American men in Washington State were run over by a pickup truck driven by a white man shouting racial slurs and war whoops. One of the tribal members was killed and the other hospitalized.\n\nPresident Trump's rhetoric is incredibly dangerous and is reminiscent of authoritarian leaders who have committed crimes against humanity.\n\nThe President's rhetoric - his referral to undocumented immigrants as \"infesting\" the United States is incredibly dangerous and it is not the first time he has alluded to white nationalist talking points. First he tweeted it[8] followed by him saying this as a statement during a speech later in the day.[9] Moreover, former Trump Campaign Chairman Cory Lewandowski went on national television and dehumanized a child with Down Syndrome who had been separated from their family.[10] President Trump has peddled anti-semetic conspiracies including the conspiracy that a prominent Jew is behind the migrant caravans[11] that he claims are \"invading\" the country.[12] And Fox News has repeated extremely dangerous xenophobic rhetoric that these migrants are bringing diseases with them, they're not.[13] Holocaust experts have compared the President's statements to Nazi propaganda.[14]\n\nThese xenophobic conspiracy theories are incredibly dangerous. Last year a far right conspiracist murdered 11 people in a Synagogue.[15] The murderer believed in the same xenophobic, racist conspiracies that were being peddled by members of the GOP, President Trump and the American rightwing media sphere.[16]\n\n1) CBS - Rightwing Extremism: Current Economic And Political Climate Fueling Resurgence In Radicalization And Recruitment.\n\n2) Reuters - Exclusive: Trump to focus counter-extremism program solely on Islam - sources\n\n3) New York Times - The Growing Right-Wing Terror Threat\n\n4) PBS - U.S. sees 300 violent attacks inspired by far right every year\n\n5) Government Accountability Office - COUNTERING VIOLENT EXTREMISM; Actions Needed to Define Strategy and Assess Progress of Federal Efforts, Pg. 28, Appendix II: Violent Extremist Attacks in the United States that Resulted in Fatalities, September 12, 2001 through December 31, 2016\n\n6) Chicago Tribune - 3 Illinois men, including one who drafted a border wall plan for Trump, charged with Minnesota mosque bombing\n\n7) USA Today - President Trump wants 'the facts' on right-wing extremism. Here they are.\n\n8) Fox News - Republican pressure intensifies to end family separations at border\n\n9) Fox St. Louis - Trump ramps up rhetoric: Dems want ‘illegal immigrants’ to ‘infest our country’\n\n10) Washington Post - ‘Womp womp’: Corey Lewandowski mocks story of child with Down syndrome separated from parents\n\n11) The Hill - Trump: 'I wouldn't be surprised' if Soros were paying for migrant caravan\n\n12) PBS - WATCH: Trump defends calling migrant caravan an ‘invasion’ ahead of midterm elections\n\n13) Vox - Fox News says the migrant caravan will bring disease outbreaks. That’s xenophobic nonsense.\n\n14) Times of Israel - Critics say Trump’s talk of immigrants ‘infesting’ US recalls Nazi propaganda\n\n15) NBC - Pittsburgh synagogue shooting suspect threatened Jewish groups, pushed migrant caravan conspiracies\n\n16) Washington Post - How the Trumps and conservative media helped mainstream a conspiracy theory now tied to tragedy", "score": 2, "send_replies": true, "subreddit": "nba", "date_year_month": "2019-03", "created_utc_converted": "2019-03-06 15:28:50", "score_overall": 6, "words": "conspiracy jew holocaust conspiracy jewish conspiracy", "shared_words": "conspiracy jew holocaust jewish", "socre_distint": 4}
{"author": "Sorrymisunderstandin", "body": "&gt;what jew doesnt think their family wasnt in the holocaust?\n\nHis father fled from Poland and other family members were killed, keep in mind Bernie is really old, this isn’t somebody saying a great uncle or grand father they never knew or something, this is his father. \n\nI’m gonna have to side with every historian and reliable evidence over conspiracy theories often just found on YouTube, sorry man lol.  \n\nYou got any reliable sources? And what’s the point in lying about that by the way? What happened to the Jewish population in Poland? It was 3 million+ \n\nhttp://www.un.org/en/holocaustremembrance/docs/FAQ%20Holocaust%20EN%20Yad%20Vashem.pdf", "score": 1, "send_replies": true, "subreddit": "The_Donald", "date_year_month": "2019-03", "created_utc_converted": "2019-03-07 15:50:19", "score_overall": 4, "words": "jew holocaust conspiracy jewish", "shared_words": "jew holocaust conspiracy jewish", "socre_distint": 4}
{"author": "Dwight3469", "body": "&gt; Not sure why I'm wasting my time on someone who believes the blood  libel. There are no actual confirmed cases of that ever happening. It's  been repeated because idiots like you help repeating it. \n\nIt's funny how so many countries who didn't have our means of communication established so many investigations and got the same results through centuries. But I guess that if a guy goes in hundreds of bars across the world and gets thrown out of every bar he's been in, it's not at all the fault of the guy, just the intolerant bars.\n\n&gt; The Holocaust did happen \n\nAs I explained: mass deportations in shitty conditions did happen. Telepathic nazis using rollercoasters to throw Jews into furnaces and gas chambers which turned them into soap and sausages, these are the result of so called testimonies.  \nSo sorry, but I don't give a shit about testimonies, only factual evidence.\n\n&gt; it doesn't form any \"legal basis\" for Israel's existence. \n\nOf course, it does, anytime any Jew is threatened, he uses the holocaust religion to force others to shut their mouths and submit to him because they are indoctrinated and afraid of Satan aka Hitler in their mind.\n\n&gt; antisemites. \n\nDon't you think it's strange that everyone, and not idiots but famous writers and philosophers like Voltaire from the siècle des Lumières called the Jews disgusting and evil just like the Nazi did? Everyone described the Jew as a pervert, a manipulator and a greedy assassin throughout history, but the problem must lie with them eh? Just being \"evil antisemites\" for the sake of it. \n\n&gt;  A passport that lets people travel to Israel? That's what passports are *for*. \n\nYou seem to be pretty retarded. A guy becomes a protector for the french president, he's immediately given a passport to Israel, don't you think it indicates something?\n\n&gt; You can complain about Jews all you want. It won't fix your life. \n\nActually, getting rid of the Jews who control the police and the army in my country would fix a lot of things in the french society, since they love mutilating dozens of Yellow Vest but never do anything to fight against the sandniggers stabbing and shooting people every 2 days in a single neighborhood.\n\nThe guy who helped the terrorists from the Bataclan to hide from the police was condemned for murder but he was barely condemned to 8 years, and he didn't even stay in prison the whole time since he should have been liberated in 2016. He also played video games after the terrorist attacks with a guard from our minister of security, goes to show how much the justice system is fucked.\n\nGetting rid of these Jews would also save hundreds of thousands of lives by avoiding wars in the Middle East, all pushed by Jewish organizations.\n\n&amp;#x200B;", "score": 0, "send_replies": true, "subreddit": "isrconspiracyracist", "date_year_month": "2019-03", "created_utc_converted": "2019-03-07 19:54:01", "score_overall": 6, "words": "libel holocaust jew holocaust jew jewish", "shared_words": "libel holocaust jew jewish", "socre_distint": 4}
{"author": "darthhayek", "body": "&gt; Lol so under the first amendment I could say u/darthhayek was a serial rapist, or maybe he liked to steal from old people, or maybe I could say u/darthhayek was a holocaust denier. \n\nThe mainstream media you're defending does that literally all the time. Why would you pretend to care about it only when it's Alex Jones?\n\nHow does speculating about conspiracy theories qualify as defamation? How does the public interest in \"protecting\" the Sandy Hook parents from criticism override the necessity to protect the people's right to criticize government and the authorities in a free country?\n\n&gt;Now imagine if I had a semi popular internet show and perpetrated these, want I’m sure are not true, statements? See how ridiculous that is?\n\nNo, since the fact that there's no evidence that Alex Jones was actually a Sandy Hook denier. It's a tangential point to me, since I don't care, but it's still relevant to this discussion. Really, you have to think to yourself, of all the \"conspiracy theories\" they could have gone after, how fucking sad would it be if they targeted Alex Jones *for the one single conspiracy theory he didn't promote?*\n\n&gt;Now imagine your kid was murdered in cold blood and someone said “oh it didn’t happen like you think it did, the government murdered your child and your probably an actor who’s part of it” look man I’m all for protecting the first but that’s lies and libel... that’s not protected under the first, choose better battles to fight lol\n\nI'd say they should get fucked. I know that *my* father is a good enough person, that he wouldn't start trying to repeal the First and Second Amendments of everyone else just because something bad happened to me. I would hope that your parents would be or would have been the same way, if they're as principled conservatives as you are.\n\n&gt;Shoving a dildo up your ass on love tv for the reason to “own” people isn’t just cringe, it’s just uncalled for and disgusting. Lol cringe is the nice way of defending that. But you compare that to putting on a wig and a dress for a pre written skit that was to bring laughs. If you think those are even close to the same thing then idk what to say...\n\nI'm saying that they both qualify as ad hominem attacks rather than a criticism of something relevant, such as his political beliefs. Also, looks like /r/GavinMcInnes is listed on the sidebar so you have a lot more work to do than convincing me not to like someone who did something disgusting with a dildo if you want to be successful at pushing this agenda. (I'm bi, anyway, and if you think that the conservative movement is \"too liberal on LGBT\" or something - a fair opinion - than you should start with going after traitors like Matt Schlapp at CPAC than poor, innocent Miles McIngus)\n\n&gt;And I mean, roger stone isn’t a great man. He’s not some hero dude. Def not worth looking up to in anyway or form. He digs his own holes and tries to bring attention to himself constantly.\n\nNot liking someone is different from saying they deserve to get treated like a Jew in Nazi Germany.", "score": 2, "send_replies": true, "subreddit": "LouderWithCrowder", "date_year_month": "2019-03", "created_utc_converted": "2019-03-07 21:25:03", "score_overall": 6, "words": "holocaust conspiracy conspiracy conspiracy libel jew", "shared_words": "holocaust conspiracy libel jew", "socre_distint": 4}
{"author": "CueDramaticMusic", "body": "Eh, they’ll never be that overt about the whole thing, at least today. Most triple-parentheses T_D peeps will shy away from being openly anti-Semitic (except when they aren’t ), but will gladly talk about the Jewish Globalist Conspiracy, which in the least mind-melting way to describe it is “Jews are the Illuminati, and everything I hate is their pawns”. Hell, Hitler himself talked about what he referred to as “international Jewry” concerning basically the same things.\n\n&gt;You seem to know a lot about Nazis, Cue.\n\nWell, frankly, I’m copying off of The Golden One’s homework from several years ago, by way of Hbomberguy. It really helps to have someone constantly show his hand when it comes to subtextual shell games like this. ", "score": 8, "send_replies": true, "subreddit": "ChapoTrapHouse", "date_year_month": "2019-03", "created_utc_converted": "2019-03-08 05:23:32", "score_overall": 4, "words": "jewish globalist conspiracy illuminati", "shared_words": "jewish globalist conspiracy illuminati", "socre_distint": 4}
{"author": "taqiyya_kitman", "body": "&gt;In reality it is a tiny minority of blacks, Jews, and even white people, at the core of all of it.\n\n80% (see below) of anything is not a tiny minority though, and these traitorous leftist Jews stand with Muslim savages probably close to 90% of the time, too, in their unholy alliance to destroy America from within, as per Muslim Brotherhood's plan ([Exploratory Memorandum](https://www.centerforsecuritypolicy.org/wp-content/uploads/2014/05/Explanatory_Memoradum.pdf)). Many of them are even anti-Israel. Traitorous leftist Jew George Soros even collaborated with the Nazis to rob properties of his own people before leading them to the gas chambers during the Holocaust and said those days were the 'Happiest days of my life'\n\nFor example, anti-Israel ([http://archive.is/QSbCs](http://archive.is/QSbCs)) Bernie Sanders campaigned for Muslim Brotherhood terrorists Abdul Sayed in Michigan [http://archive.is/K0e1W](http://archive.is/K0e1W) and Linda Cockroach in Washington DC [https://ntknetwork.com/bernie-sanders-to-campaign-with-linda-sarsour-this-weekend/](https://ntknetwork.com/bernie-sanders-to-campaign-with-linda-sarsour-this-weekend/)\n\nDiane Feinstein tried to bring down Kavanaugh's judicial nomination, while having her 'Chinese connection' cash pipe flowing for 20 years via a Chinese spy working as her chauffeur.\n\nRod Rosenstein, colluded with the rest of Deep State traitors, to overthrow a duly elected President of United States.\n\nLisa Murkowski, the only Jew in GOP, and 1 of the 3 RINO's  (John McCain, Susan Collins) voted for Obamacare, also voted against Trump's travel ban, and later voted against Kavanaugh's confirmation, and now plans to vote against Trump's National Emergency [http://archive.is/ufD9g](http://archive.is/ufD9g)\n\nDebbie Wasserman Schultz committed voter fraud, threatened police chief, and allegedly killed at least 3 attorneys investigating her.\n\nScott Israel militarily trained Islamic jihadists in Florida\n\nChuck Schumer wants open borders and US population replacement with illegal aliens, fought against Trump's 'Muslim ban' [http://archive.is/5HdY5](http://archive.is/5HdY5), even threatened duly election POTUS Trump with assassination by Deep State [https://www.youtube.com/watch?v=XCtIdpBocNA](https://www.youtube.com/watch?v=XCtIdpBocNA)\n\nMark Zuckerberg &amp; Sheryl Sandberg censored and banned millions of Conservative &amp; anti-Islam Facebook users with hundreds of thousands to millions of followers\n\nKen Roth from HRW spreads fake news and pro-Islam globalist propaganda for his puppet master Soros thanks to $100 million donation.\n\nJonathan Greenblatt from ADL helps Google/YouTube in banning all Conservative and anti-Islam channels.\n\nDick 'Danang' Blumenthal lied about his service in Vietnam, support Muslim savages [http://archive.is/U3bc5](http://archive.is/U3bc5) against Trump's 'Muslim ban'\n\nAl Franken committed voter fraud to win Senate seat and later resigned for sexual misconduct\n\nSarah Silverman showed racist blackface and perpetual anti-USA, anti-Israel, anti-Trump tirades\n\nAmy Schumer showed anti-USA, anti-Trump, anti-Conservative protests [http://archive.is/yo0uk](http://archive.is/yo0uk)\n\nTraitorous Leftist Jews outnumber MAGA Orthodox Jews 4-to-1 in America, mirroring their voting pattern as at least 4 out of 5 Jews vote Democrat, or roughly 80% on average, since 1930's [https://www.jewishvirtuallibrary.org/jewish-voting-record-in-u-s-presidential-elections](https://www.jewishvirtuallibrary.org/jewish-voting-record-in-u-s-presidential-elections)\n\nThey especially dominate the fake news media [https://imgoat.com/uploads/5e00132373/145702.jpg](https://imgoat.com/uploads/5e00132373/145702.jpg), and Trump rightfully called them 'Enemy of the People'\n\nPatriots like David Horowitz, Pamela Geller, and Laura Loomer are MAGA Orthodox Jews who do exceptional work, but they are greatly outnumbered by their traitorous counterparts, unfortunately. In fact, they even fight each other. For example, traitorous leftist Jews endorsed Muslim Brotherhood/CAIR's Andrew Gillum and even invited him to speak at their synagogue, but kicked out MAGA Orthodox Jewish journalist Loomer [https://www.youtube.com/watch?v=5fCbhbdVgqw](https://www.youtube.com/watch?v=5fCbhbdVgqw)\n\nGeller even wrote about it 'Jewish Americans are now the face of the anti-Trump “Resistance”'[https://web.archive.org/web/20181116205408/https://gellerreport.com/2018/11/jewish-anti-trump.html/](https://web.archive.org/web/20181116205408/https://gellerreport.com/2018/11/jewish-anti-trump.html/)", "score": 38, "send_replies": true, "subreddit": "The_Donald", "date_year_month": "2019-03", "created_utc_converted": "2019-03-08 08:43:24", "score_overall": 10, "words": "jew holocaust jew globalist jewish jewish jewish jewish jewish jewish", "shared_words": "jew holocaust globalist jewish", "socre_distint": 4}
{"author": "Jijcf", "body": "\nWe reject the existence of normalized relations with the Zionist entity by any nation of this earth and call for Zionist organizations to be annihilated in total and collectively because of their status as one of the greatest dangers facing the planet and an international conspiracy that can only be fully beaten through a global struggle: armed struggle in some places, and boycott activity in others.\n\n \n\nWhile Modern Zionism is a \"secular\" concept, it cannot be seen as such in the conventional sense, because it espouses an exclusive state for the Jews.  This can no more be seen as secular than one could see the Vatican, ruled by the leader of the Catholic Church, as a secular state, even if it performs secular functions that a state must perform.  Secularism, in practice, has come to mean something far more enlightened than this.\n\n \n\nEven those who call for Arab-Jewish co-existence are simply using such sophistry as a Jewish colonialist bargaining chip.  After all, if these Jews like assimilating with their neighbors so much, why didn't they do that in Russia, Canada, Argentina, or whatever nations to which they each individually belong?  This is neither genuinely secular nor progressive.  The only thing genuinely progressive in the Zionist entity, involving Jews, is a bus bombing in Tel Aviv, with the number dead Jews reflecting the degree of progressiveness of that action.\n\n \n\nWe militantly reject the Eurocentric racism and opportunism of those who are totally aware of the Jewish threat and the social role that Jews play against all nations to which they belong, and yet who choose the path of dumping the Jews off in the land of Palestine, as if this were some sort of \"solution\".  The arrogance of this thought and behavior is boundless!  Purely one's own racism is at work, if rather than having to deal with their weak stomach for the Jewish question, one instead decides to cooperate with Jews and Zionists and move them out of the country, and which then accurses and punishes the Arab people who have done more than any other people in modern times to fight Jewish Supremacy and Zionism.\n\n \n\nAs consistent nationalists, must we not insist that the problems of Moscow, Berlin, or anywhere be solved by the national unit alone without making its problems an international drama?  Besides, as a matter of fact, the Jewish danger and Zionism must be fought even if with the firm recognition of the role of the national unit, ultimately on a global scale, in order to win a decisive political/military victory over the enemies of all humanity.\n\n \n\nWe stand with the Arabs and Muslims resisting the Zionist enemy, just as we stand with all people resisting imperialism and neo-colonialism, opposing all forms of scab behavior in this keynote struggle, and this regardless of how western leftists or international Jewry feel about the matter!\n\n \n\nOn the \"anti-Semitism\" misnomer and why our open disdain for Jews and Judaism is neither \"anti-Semitic\" nor chauvinistic.\n\n \n\nWhenever anyone attacks anything about Jews and Zionists, even if such attack clearly is objective and accurate, containing not a shred of racism whatsoever, it is almost always labeled \"anti-Semitism� and its author becomes a \"racist anti-Semite\".  The basis of this concept is that all Jews are Semites, and that they are being attacked because they are allegedly Semites.\n\n \n\nBy Semites, again we refer here to a macrocosm of nationalities encompassing one language group, one that makes this paradigm particularly comical as the Arabic language is Semitic, and therefore all Arabs are by definition Semites.  It is an attempt to give the impression that the Jews collectively constitute a nation, and that this nation is a legitimate state.  Well, not all Jews are \"Semitic\", as the Jew comes from a number of racial stocks and belongs to an even greater number of nationalities and speaks not a single common tongue\n\n \n\nThere exists a whole series of things which are unacceptable to the Jews and Zionists, and unfortunately today's Jewish-controlled western leftists, as well.  These range from the fact that Jews aren't a nationality and the bulk of them don't have even a shred of ancestral connection to the land of 1948 Palestine, to the Khazar origins of the Ashkenazi Jews, to the history of the Jews in the transatlantic slave trade which resulted in millions and millions of dead Africans, to the fact that revisionist historians have clearly shown that the three great tenets of the Jewish 'holocaust' myth are all lies, to approaching the parasitic social role of the Jew, or even the relationship they have been accused of having with Freemasonry.\n\n \n\nHow many Jews do you know who like to talk about the holohoax and its relevance to the Zionist entity?  Yet revisionist historians, many of them facing beatings, slayings, and long prison terms, have revealed that a number several hundred percent smaller than 5-6 million died during the Second World War, that no actual attempt to exterminate the Jews took place, and that the homicidal \"gas chambers\", whether diesel or dual use Zyklon B, never existed.\n\n \n\nWhen Arab resistance forces launch attacks against \"Israel's\" 1948 territories, how many \"anti-Zionist\" Jews actually support these actions?  Virtually none!\n\n \n\nWho gives a damn what the Jews like?!  The fact is that our struggle against Zionism and Jewish Supremacy does not require their approval or for us to \"prove\" anything to Jews.  In fact, within materialist parameters of struggle against Jewish behavior, ideology and social roles, which are not based on predetermined pseudo-racial characteristics of the Jew, but on individual and collective choices the Jew has made or at least chosen not to break with, it�s actually anti-racist and progressive to be \"anti-Jewish\".  In essence, there are anti-Jewish positions which are idealistic and potentially, but not necessarily, chauvinistic, and then there are anti-Jewish positions which are based on materialism and grounded in reality.  Even \"anti-Semitism\", actually anti-Jewish racialism, is far less a problem today than is the very Jewish racialism which gives rise and form and content to its mirror image.  Before and behind the reflection of hating the Jew for racial sectarian reasons, there was the Jew and his racial sectarian behavior, which gives rise to malformed expressions of the goyim popular masses.\n\n \n\nHere again we argue that the world is exponentially a greater victim of the Jews than the Jews of the world!\n\n \n\nII. Beyond Judeophilia: A Vital Look at \"Karl Marx on the Jewish Question\"\n\n \n\nIn 1844, Karl Marx published an essay called \"On the Jewish Question.\"  This essay has often been suppressed or ignored by people calling themselves Marxists, because Judaeophilic tendencies have become dominant in such groups, and what Karl Marx had to say about Jews was certainly not flattering.  The essay is available online at:\n\n \n\nwww.marxists.org/archive/marx/works/1844/jewish-question/index.htm\n\n \n\nIt is worth studying, because what was written about the Jews 162 years ago is true today as well.  Indeed, the Jews are, if anything, guilty of these vices on a far grander scale.  Let's be clear of whom Marx was speaking when he criticized Jews.  He wasn't speaking of bloodline.  Indeed, as many enemies of Marx often point out, that would have been quite a severe self-criticism. He wasn't speaking of religion, for he makes clear in his essay that he is not speaking of the \"Jew of the Sabbath.\"  He was clearly speaking of group identity, which would, of course, include secular people who call themselves Jews, even if they have never in their lives set foot in a synagogue.\n\n \n\nMarx starts off the essay by berating Jews for calling for their special emancipation.  He asks them why the German people should care about their emancipation, when they don't care about Germany.  Isn't it ironic that in certain respects Adolf Hitler came far closer to this position than Ernst Thaelman or Georgi Dimitroff?\n\n \n\n Marx also alluded to the Jewish dominance of finance capital, saying that the Jew in Vienna who is banned from German states still controls the fate of Europe.  He also clearly connected Jews with predatory capitalism.  Marx said, \"What is the worldly religion of the Jew? Huckstering.  What is his worldly god?  Money.\"\n\n \n\nMarx concludes by calling for the emancipation of the world from Jews, as the emancipation of the world from huckstering.  Marx was right in 1844, and his words are still true today.  We need to eliminate Jews from the world.\n\n \n\nJewish power over finance capital became power over the entire economy, as Lenin observed in \"Imperialism, the Highest Stage of Capitalism,\" without referring to Jews. Zionism also became a peculiarly Jewish form of colonialism, though Jewish finance capital backed other kinds of colonialism as well.\n\n \n\n", "score": 0, "send_replies": true, "subreddit": "DebateCommunism", "date_year_month": "2019-03", "created_utc_converted": "2019-03-08 22:38:23", "score_overall": 34, "words": "conspiracy jewish jewish jewish jewish jewish jewish jew jewish jewish holocaust jew jewish jewish jew jew jewish jewish jewish jewish jewish jew jew goyim jewish jewish jewish jew jewish jew jew jewish jewish jewish", "shared_words": "conspiracy jewish jew holocaust goyim", "socre_distint": 5}
{"author": "MarquisDePaid", "body": "It probably was a snuff film that got leaked rather than an act of pure terrorism or anything ISIS related\n\nI initially took the Morocco killing of those two Scandinavian women and its subsequent marginalization in MSM at face value.\n\nI had assumed some random extremists did the killing for personal pleasure or personal sense of vindication for their ideology.\n\nBut while I argued with a pacification shill something struck out to me. He argued the video should be censored and covered up to \"help the victims move on\". I asked why then do we not also censor tragic events like the Jewish Holocaust if censoring the tragedy helps people move on (rather than eliciting sympathy for the victims), and remembering it traumatizes them.\n\nThe pacification shill then called it a \"snuff film\". \n\n&gt;You just compared a governemnt not wanting a snuff film circulating with the cold calculated murder of millions of \"undesirables\"\n\nI certainly felt that I did a fantastic job out-arguing and geting the oppressive [pacification shill to self-destruct](http://magaimg.net/img/6zip.jpg), but it still lingered in my memory that it used the term \"snuff film\".\n\n\n\"Snuff\" is a very, very specific term, of sexualized killings that are filmed for wealthy clients, why would the pacification shill put such a frame on this killing? \n\nThen I heard about another recent trafficking attempt in Morocco, [src](https://www.rt.com/usa/448049-morocco-us-teacher-trafficking/)\n\n&gt;'Trafficking at its worst:' Texas teacher arrested for attempting to sell underage girl to Morocco\nPublished time: 4 Jan, 2019 05:33Edited time: 4 Jan, 2019 11:46\n\n&gt;A teacher in a Texas junior high school was making arrangements for her young relative to be shipped to Morocco allegedly for prostitution. The would-be pimp was arrested upon returning from Morocco after a tip by family.\nAmber Michelle Parker, a 37-year-old reading teacher at Mexia Independent School District, was arrested on Wednesday in a joint operation led by Freestone County and McLennan County Sheriff Offices.\n\n&gt;Detectives had been on Parker's trail for months before taking her into custody on charges of trafficking and a conspiracy to traffic a minor. Police searched Parker's electronic devices and her phone.\n\n\n\n[src](https://www.mirror.co.uk/news/world-news/morocco-backpacker-terrorist-killers-chilling-13788430)\n\n&gt;...They were discovered with knife wounds to the neck - with sickening video footage apparently showing one of them being beheaded.\nAhead of the murders, the four main suspects are alleged to have hastily formed a terrorist \"cell\", recruiting as many as 15 others into it.\n**They then agreed \"under the influence of their emir\" - said to be a 25-year-old street vendor - to commit a terrorist act, authorities claim.**\n\n\n\n&gt;Boubker Sabik, spokesman for the Moroccan security and domestic intelligence services, said the crime \"was not co-ordinated\" with ISIS.\nHe said on the state 2M TV channel that the four suspects, aged between 25 and 33 years, had headed to the region intent on committing a crime but without selecting their target in advance.\n\n&gt;\"The crime was not co-ordinated with Islamic State,\" Mr Sabik said.\n\n&gt;He dismissed reports that one was a returning foreign fighter from the Middle East. All four, who originated from the outskirts of Marrakech, had only informal jobs and had a low level of education, he said.\n\n&gt;The \"emir\" of the terrorist \"cell\" was allegedly Abdessamad Ejjoud.\nMr Khiam told AFP that the street vendor had “formed a kind of cell that discussed how to carry out a terrorist act inside the kingdom\".\n\n&gt;Compared with other countries in North Africa, Morocco has been largely insulated from militant attacks.\nThe most recent took place in April 2011, when 17 people were killed in the bombing of a Marrakech restaurant.\n\n\nThey were recruited by a vendor, who performs networking and services, to ~~\"commit a terrorist act\"~~ produce a video of a killing of young women. Why? \n\nThe killers were from relatively lower economic backgrounds. **Yet they stole none of the valuables**. Even ISIS terrorists usually steal belongings from victims. \n\n[src](http://archive.fo/Twu8Y)\n\n&gt;...**But police source told Morocco World News the murder investigation has excluded robbery as the motive because none of the victims' belongings were missing.\nRather, sexual assault may have been the motive for the crime at a spot six miles from the remote mountain village of Imlil, near the foot of Mount Toubkal, North Africa's highest peak.**\n\n\nThe group was international/globalist with roots to very wealthy Western countries and thus most likely with links to wealthy elites: \n\n[src](https://www.news.com.au/travel/travel-updates/incidents/swiss-man-linked-to-morocco-tourist-murder-suspects-arrested/news-story/1765bcc5555a9d03614d908ea906c310)\n\n&gt;**A Swiss man suspected of “training” the men who allegedly beheaded two Scandinavian tourists has been arrested, as details of the girls’ final days were revealed.**\nThe man, who lives in Morocco, was arrested in Marrakesh on Saturday, for alleged links to suspects in the recent murder of female Scandinavian hikers Louisa Vesterager Jespersen, 24, from Denmark, and Maren Ueland, 28, of Norway.\n\n&gt;Authorities allege the four main suspects — all of whom were arrested within three days of the murders — recruited up to 15 others into a hastily formed terrorist group.\n\nWas there any possbility this was a \"snuff film\" like the [Guardian detailed back in 2000](https://archive.fo/AiDeU)?\n\n&gt;Many customers repeatedly ordered videos from him. The Naples newspaper Il Mattino published a transcript of an alleged email exchange between a prospective client and the Russian vendors.\n\n&gt;'Promise me you're not ripping me off,' says the Italian.\n'Relax, I can assure you this one really dies,' the Russian responds.\n\n&gt;'The last time I paid and I didn't get what I wanted.'\n'What do you want?'\n'**To see them die.**'\n\nIs that why this has been censored so heavily?", "score": 1, "send_replies": true, "subreddit": "FreeSpeech", "date_year_month": "2019-03", "created_utc_converted": "2019-03-08 23:03:02", "score_overall": 4, "words": "jewish holocaust conspiracy globalist", "shared_words": "jewish holocaust conspiracy globalist", "socre_distint": 4}
{"author": "jamesd1100", "body": "Being jewish doesn't make you the authority on what is and is not anti-semitic.\n\nIf one black person believes the N-word isn't racist, that doesn't make the word not racist, or erase the blatant racist history associated with it.\n\nTropes of dual loyalty were used against Jews in Poland and Germany and used as justification for the holocaust. That's not opinion, that's historical fact, and a jewish person claiming that isn't anti-semitic doesn't change that.\n\nhttps://en.wikipedia.org/wiki/Antisemitic_canard\n\n&gt;A canard found in The Protocols of the Elders of Zion, but dating to before that document, is that Jews are more loyal to world Jewry than to their own country. Since the establishment of the state of Israel, this canard has taken the form of accusations that Jewish citizens of countries such as the United States are more loyal to Israel than to their country of residence\n\nHistorical tropes of Jews being rogues, swindlers, or hypnotists, which are blatantly rooted in centuries of history, are anti-semitic, again, not opinion, historical fact.\n\nhttps://books.google.com/books?id=CSiVjbER1MEC&amp;pg=PT31&amp;lpg=PT31&amp;dq=jewish+rogue+trope&amp;source=bl&amp;ots=bWgL0F0C6v&amp;sig=ACfU3U2RFGcu96qtZNuyDST9dYnZXcT1rA&amp;hl=en&amp;sa=X&amp;ved=2ahUKEwi77t3jovTgAhUliOAKHXdHA6wQ6AEwBHoECAYQAQ#v=onepage&amp;q=jewish%20rogue%20trope&amp;f=false\n\nhttps://www.jpost.com/Diaspora/Antisemitism/An-idiots-guide-to-anti-Semitic-tropes-581178\n\n&gt;She wrote of Israel having “hypnotized” the world, which touched on a trope as old as the “Protocols” of Jews mesmerizing governments into submission.\n\nStereotypes about jewish money, or jewish money controlling the media or politics are once again inarguably anti-semitic and rooted in history. \n\nhttps://en.wikipedia.org/wiki/Economic_antisemitism\n\n&gt;Derek Penslar describes modern economic antisemitism as a \"double helix of intersecting paradigms, the first associating the Jew with paupers and savages and the second conceiving of Jews as conspirators, leaders of a financial cabal seeking global domination\". Throughout history, stereotypes of Jews as being connected to greed, money-lending and usury have stoked anti-Jewish sentiments and still, to a large extent, influence the perception of Jews today. Reuveni and Wobick-segev suggest that we are still haunted by the image of \"the mighty, greedy Jew\".\n\nBut hey, I guess wikipedia, all of these sources and scholars, and all of history got it wrong, and this one blatantly biased dude who is clearly a leftist ideologue, that went \"Nah I don't think it's anti-semitic\" is right. Unreal. \n\nWeird, all of these jews that I cited claiming these things ARE anti-semitic based out of history are at odds with this other jew who says they aren't!!! Are you telling these jewish scholars what is and is not anti-semitic? ", "score": -1, "send_replies": true, "subreddit": "PoliticalVideo", "date_year_month": "2019-03", "created_utc_converted": "2019-03-09 04:58:53", "score_overall": 14, "words": "jewish holocaust jewish jewish jewish jewish jewish jewish jew greed jewish jew jew jewish", "shared_words": "jewish holocaust jew greed", "socre_distint": 4}
{"author": "sje46", "body": "Hitler and his lackeys wanted to kill the Jewish people to be rid of them.  He blamed them for losing WWI and destroying the German economy.  At first I think there were plans to just ship them away, but then they went with the murder plan.  Point is, it was \"personal\".  The Nazis really, really hated the Jewish people, and wanted revenge and just wanted them gone.\n\nNeo-nazis today aren't necessarily all about Jewish people the way the original Nazis were.  Neo-nazis tend to be focused about blacks, hispanics, arabs, and (to a lesser extent because there's actually some respect there) Asians.  Nazis also looked down on other races, for sure, but they didn't send black people to concentration camps.  The Nazis were actually focused on white people like European Jewish, Romani, and Slavs.  I mean it's similar; they had similar ideas about race purity and white supremacy and all that.  But the focus between the two groups about what the greater threat is is different.  \n\nToday's neo-nazis don't want all Jewish people dead, although they often do believe modern \"globalist\" conspiracy theories.  They're just so much more focused on race mixing and blacks/hispanics/etc than regular old jewish people.\n\nAlso, of course, few people actually support wholesale murder of millions.  Or if they do, they're not very public about it.  They want to try to seem reasonable, even though they not.  The Holocaust was a pretty horrible thing, and to support it makes htem seem irreasonable, so instead a lot of racists will say shit like \"We don't want to hurt other races; we just don't want our culture to be threatened\" and \"Africa for Africans, Asia for Asians, Europe for Europeans\".  Stuff that seems to promote respect for culture, even though it's all a dog-whistle for hardcore racial intolerance.\n\nAnd, of course, some think [The Turner Diaries](https://en.wikipedia.org/wiki/The_Turner_Diaries) is something to be emulated.  \n\nBut yeah, generally speaking Neo-nazis aren't focused on \"every day jewish people\" and it's not as personal to them as it was to the original nazis, and neo-nazis are so very focused on appearing to be reasonable, that *supporting* the Holocaust isn't acceptable, but *denying* the Holocaust is.", "score": 1, "send_replies": true, "subreddit": "NoStupidQuestions", "date_year_month": "2019-03", "created_utc_converted": "2019-03-09 16:00:37", "score_overall": 12, "words": "jewish jewish jewish jewish jewish globalist conspiracy jewish holocaust jewish holocaust holocaust", "shared_words": "jewish globalist conspiracy holocaust", "socre_distint": 4}
{"author": "allsleepingeye", "body": "Illhan Omars comments are anti Semitic dog whistles. I can break this down. You guys say she’s just criticizing Israel and money in politics. If you want to talk about money in politics why start with AIPAC? Here is a list of lobby’s by spender for 2018 https://www.opensecrets.org/lobby/top.php?showYear=2018&amp;indexType=s\n\nWeird how AIPAC isn’t on that list. So if we are gonna discuss money in politics why aren’t we talking about the chamber of commerce, or the association of realtors? Wouldn’t it logically make sense to start with the big spenders? Oh right this isn’t about logic or facts though, it’s about illhan omar not liking Jews. \n\nAs for criticizing Israel I’m all for it. What I’m not for is dog whistling ancient Jewish slanders in order to do it. In case you have no idea what these tropes are the common ones are Shylock, the idea that Jews are money grubbing heartless bankers, the blood libel where Christians said Jews used the blood of Christian children to bake their unleavened bread, and the grand Jewish conspiracy, where people believe Jews and Jew gold run the entire world banking systems media governments etc. \n\nSo when you pick a lobby that isn’t even in the top spenders for lobby’s and insinuate that politicians support for the Jewish state is bought by Jew gold from that low spending lobby you are dog whistling the grand Jewish conspiracy. I mean the fact that the “Andrew Gillum dog whistled racists cause he said monkey” crowd is denying a clear Jewish conspiracy dog whistle is absurd. \n\nShe wasn’t talking about money in politics because she started with a low spending lobby. She wasn’t “just criticizing Israel” because she dog whistle the grand Jewish conspiracy. This isn’t hard guys. I know cognitive dissonance is hitting you guys really hard, you don’t want to believe that a Democrat could be a bad guy, but she doesn’t like Jews. Get over it.\n\nI’m just going to add that it’s pretty funny to see the “punch a Nazi” crowd becoming a bunch of socialists who defend anti semitism. You’re one ideology away from being national socialists who hate Jews, or said another way actual 1940s nazis.", "score": -2, "send_replies": true, "subreddit": "Destiny", "date_year_month": "2019-03", "created_utc_converted": "2019-03-09 17:22:00", "score_overall": 13, "words": "jewish libel jewish conspiracy jew jewish jew jewish conspiracy jewish conspiracy jewish conspiracy", "shared_words": "jewish libel conspiracy jew", "socre_distint": 4}
{"author": "phite_wride", "body": "&gt;NWO Luciferians\n\nNice bait, mate. The Illuminati meme died in 2014. \nAnd plus, riddle me this : \n\nAre you getting silenced for criticizing Freemasons ?\nNo.\nAre you getting silenced for criticizing the 1% ?\nNo.\nAre you getting silenced for criticizing the Illuminati ?\nNo.\n\nSo why are you getting silenced ?\nFor criticizing Isreal.\nFor criticizing jewish ethnocentrism.\nFor criticizing AIPAC &amp; their Neocon puppets.\n\nWhy ? Because all of that Illuminati and Freemasons shit is either :\n\n1. Fake\n\n2. Part of this broader conspiracy.\n\nThere is literally nothing otherworldly or satanic and by the way AI is still a long way from reaching that level. (for now, it is just machine learning algorithms who are going to do repetitive work in the future, very very far from actual self-aware intelligence; either way, we still have to be careful)\n\n\nSo, unless you back your shit up with actual evidence (and not Jay-Z doing a triangle with his fingers plus X-Files theme videos type of evidence ), I'll stick to my own conspiracy of a Globalist plot organized primarily by (((them))).", "score": 3, "send_replies": true, "subreddit": "DebateAltRight", "date_year_month": "2019-03", "created_utc_converted": "2019-03-09 17:56:58", "score_overall": 7, "words": "illuminati illuminati jewish illuminati conspiracy conspiracy globalist", "shared_words": "illuminati jewish conspiracy globalist", "socre_distint": 4}
{"author": "Ozwaldo", "body": "Yup!  So Ilhan Omar's comments that have been criticized as anti-semitic are:\n\n* &gt; Israel has hypnotized the world, may Allah awaken the people and help them see the evil doings of Israel.\n\n* &gt; It's all about the Benjamins baby\n\nThe first is apparently anti-semitic because it is \"trope\" to reference jewish people as hypnotic, because of a long-standing \"conspiracy theory of the Jew as the hypnotic conspirator\".  I think that's a pretty far stretch, as I've never personally associated the word \"hypnotize\" with Jews.  But, whatever, she apologized, and I think it's pretty clear she wa pointing out Israel more then Jewish people with that statement.\n\nThe second is clearly just saying that Israel gets so much support because it's profitable to do so.  It's offensive to assume she's making some slander of Jewish people and the stereotype of their greed.", "score": 2, "send_replies": true, "subreddit": "politics", "date_year_month": "2019-03", "created_utc_converted": "2019-03-09 19:41:10", "score_overall": 6, "words": "jewish conspiracy jew jewish jewish greed", "shared_words": "jewish conspiracy jew greed", "socre_distint": 4}
{"author": "flinxsl", "body": "Ursury (lending with interest) was indeed against Jew's religion as laid out in the Talmud.  Fortunately for them, Jewish law clarified that only applied to other Jews.  It was perfectly kosher for usury against filthy goyim.", "score": 11, "send_replies": true, "subreddit": "fragilejewishredditor", "date_year_month": "2019-03", "created_utc_converted": "2019-03-09 21:31:49", "score_overall": 4, "words": "jew jewish kosher goyim", "shared_words": "jew jewish kosher goyim", "socre_distint": 4}
{"author": "CaravanOfDeath", "body": "Article text:\n\nTwo of Jeremy Corbyn’s closest aides directly intervened to lift the suspension of an activist accused of anti-semitism, according to leaked emails.\n\nSeumas Milne, the Labour leader’s director of strategy and communications, told party officials to reinstate Glyn Secker after two of them had ruled that he be kicked out for joining a Facebook group where members posted messages denying the Holocaust.\n\nMilne stepped in after Andrew Murray, another aide to Corbyn who is also the Unite union’s chief of staff, stated that the leader himself was “interested in this one”. Secker was readmitted to the party shortly afterwards.\n\nThe Sunday Times has also been passed a tape of John McDonnell, the shadow chancellor, admitting he is supporting a woman suspended as a Labour candidate over comments about “Zionist sympathies” of a Jewish MP. Rebecca Gordon-Nesbitt was dropped as candidate for South Thanet last year — and now plans to sue the party. But McDonnell said: “I’ve expressed my support for Rebecca.”\n\nThe leaks drive a coach and horses through claims by Corbyn’s inner circle that the leadership has not attempted to influence internal investigations of anti-semitism.\n\nSecker was suspended in March last year when it emerged that he belonged to a Corbynite Facebook group, Palestine Live, on which activists peddled conspiracy theories about Israeli involvement in the 9/11 attacks. Officials also criticised Secker, a Jewish campaigner against Israel, for comments about whether Labour should adopt an international measure of anti-semitism and for heckling a member of the Jewish Labour Movement (JLM) at Labour’s conference in 2016.\n\n“There are legitimate questions to be asked about someone who has contributed to Palestine Live, heckled JLM at conference and posted content saying ‘Jew = Zionist = Israel = Jew’,” a party official wrote. A second agreed: “We would normally suspend with this.”\n\nBut in an email sent two days later on March 9 last year Murray called for the suspension to be lifted and declared: “JC interested in this one.” He denounced campaigners who had exposed hatred of Jews in the party: “I don’t know if this came from ‘Labour Against Anti-Semitism’ but they are well dodgy.”\n\nMilne defended Secker and demanded the suspension be lifted. “None of the posts can be identified as anti-semitic in the terms of the definition we have adopted as a party . . . Several quite clearly relate to political arguments within the Jewish community.”\n\nThe leaked tape indicates a different tone from the one McDonnell has adopted in recent interviews. He told the Labour Representation Committee last month: “In terms of Thanet, I’ve expressed my support for Rebecca.” As to her legal action, he said: “I don’t want to in any way prejudice that, but I’ll express my public support, full stop.”\n\nA source said members of the leader’s office were no longer asked about disciplinary cases. “This is a malicious, selective briefing from a disgruntled former employee,” a spokesman said.", "score": 1, "send_replies": true, "subreddit": "ukpolitics", "date_year_month": "2019-03", "created_utc_converted": "2019-03-10 00:15:20", "score_overall": 8, "words": "holocaust jewish conspiracy jewish jewish jew jew jewish", "shared_words": "holocaust jewish conspiracy jew", "socre_distint": 4}
{"author": "Ewannnn", "body": "Article text:\n\nTwo of Jeremy Corbyn’s closest aides directly intervened to lift the suspension of an activist accused of anti-semitism, according to leaked emails.\n\nSeumas Milne, the Labour leader’s director of strategy and communications, told party officials to reinstate Glyn Secker after two of them had ruled that he be kicked out for joining a Facebook group where members posted messages denying the Holocaust.\n\nMilne stepped in after Andrew Murray, another aide to Corbyn who is also the Unite union’s chief of staff, stated that the leader himself was “interested in this one”. Secker was readmitted to the party shortly afterwards.\n\nThe Sunday Times has also been passed a tape of John McDonnell, the shadow chancellor, admitting he is supporting a woman suspended as a Labour candidate over comments about “Zionist sympathies” of a Jewish MP. Rebecca Gordon-Nesbitt was dropped as candidate for South Thanet last year — and now plans to sue the party. But McDonnell said: “I’ve expressed my support for Rebecca.”\n\nThe leaks drive a coach and horses through claims by Corbyn’s inner circle that the leadership has not attempted to influence internal investigations of anti-semitism.\n\nSecker was suspended in March last year when it emerged that he belonged to a Corbynite Facebook group, Palestine Live, on which activists peddled conspiracy theories about Israeli involvement in the 9/11 attacks. Officials also criticised Secker, a Jewish campaigner against Israel, for comments about whether Labour should adopt an international measure of anti-semitism and for heckling a member of the Jewish Labour Movement (JLM) at Labour’s conference in 2016.\n\n“There are legitimate questions to be asked about someone who has contributed to Palestine Live, heckled JLM at conference and posted content saying ‘Jew = Zionist = Israel = Jew’,” a party official wrote. A second agreed: “We would normally suspend with this.”\n\nBut in an email sent two days later on March 9 last year Murray called for the suspension to be lifted and declared: “JC interested in this one.” He denounced campaigners who had exposed hatred of Jews in the party: “I don’t know if this came from ‘Labour Against Anti-Semitism’ but they are well dodgy.”\n\nMilne defended Secker and demanded the suspension be lifted. “None of the posts can be identified as anti-semitic in the terms of the definition we have adopted as a party . . . Several quite clearly relate to political arguments within the Jewish community.”\n\nThe leaked tape indicates a different tone from the one McDonnell has adopted in recent interviews. He told the Labour Representation Committee last month: “In terms of Thanet, I’ve expressed my support for Rebecca.” As to her legal action, he said: “I don’t want to in any way prejudice that, but I’ll express my public support, full stop.”\n\nA source said members of the leader’s office were no longer asked about disciplinary cases. “This is a malicious, selective briefing from a disgruntled former employee,” a spokesman said.", "score": 16, "send_replies": true, "subreddit": "LabourUK", "date_year_month": "2019-03", "created_utc_converted": "2019-03-10 00:59:54", "score_overall": 8, "words": "holocaust jewish conspiracy jewish jewish jew jew jewish", "shared_words": "holocaust jewish conspiracy jew", "socre_distint": 4}
{"author": "xXx420VTECxXx", "body": "You're the one slamming an innocent man citing evidence that was \n\n- Thrown out of court.\n- Two boys testified under oath nothing happened (theyre now saying the opposite in the doc)\n- One boy said nothing happened at all and only made accusations after he didnt get to be in This Is it. (also used in this doc)\n- Judge said no reasonable prosecutor could look at this evidence gathered and convict him\n- He had Neverland raided by 70 SWAT members and police and they found NO EVIDENCE to support the conspiracy theory he was a pedophile\n- If they tried this in court they'd be breaking double jeopardy laws\n- There aren't any slander or libel laws for deceased people\n\nWhats not said?\n\nHe tried to buy universal music. He tried to buy back his own musical rights\n\nThe doctor that killed him was hired by this same company above.\n\nHe was an anti-semite. The same company above is owned by astute Jewish businessmen and women.\n\nThey don't care about us was about the Jews not caring about goyim like him and I, no matter if you're black or white. and him being branded as a pedophile. Look into it\n\n\"The Jews they do this on purpose, they make you rich then they leave you penniless\"\n\n\"Hitler was a genius\"\n\nOf course they didn't kill Michael, he lived as Daev Daev until December last year until he was assassinated in Las Vegas of December 2018.\n\nMcKauly Culkin said he was the only man in hollywood who would protect him and wasnt a pedophile.\n\nLook into it", "score": 6, "send_replies": true, "subreddit": "MGTOW", "date_year_month": "2019-03", "created_utc_converted": "2019-03-10 03:49:34", "score_overall": 4, "words": "conspiracy libel jewish goyim", "shared_words": "conspiracy libel jewish goyim", "socre_distint": 4}
{"author": "sjwcuckfag", "body": "They're basically taught anything that doesn't go along with globalist Jewish agenda is the second holocaust. Open your borders goyim.", "score": 1, "send_replies": true, "subreddit": "ShittyLifeProTips", "date_year_month": "2019-03", "created_utc_converted": "2019-03-10 07:11:46", "score_overall": 4, "words": "globalist jewish holocaust goyim", "shared_words": "globalist jewish holocaust goyim", "socre_distint": 4}
{"author": "Orpherischt", "body": "Day before Ethiopia crash:\n\nhttps://mybroadband.co.za/forum/threads/police-shoot-out-tyres-of-cigarette-robbers-after-chase-in-cape-town.1012260/\n\n&gt; Police **shoot out tyres** of 'cigarette robbers' after chase in Cape Town\n\nOn the same day as Ethiopia crash:\n\nhttps://mybroadband.co.za/forum/threads/david-mabuza%E2%80%99s-hair-raising-jet-landing.1012336/\n\n&gt; David Mabuza’s hair-raising jet landing\n\n&gt; Deputy President **David** Mabuza endured a hair-raising landing this week at the hands of the SA Air Force, when **both tyres** on the left side of the VIP jet he was travelling in **burst** during a landing at Cape Town International Airport.\n\nS.A. Air Force --&gt; SAAF --&gt; 1**911**6\n\n----\n\nZach does a video on the Ethiopian air incident:\n\n* https://www.youtube.com/watch?v=_LBIjJtes7s\n\n&gt; Ethiopian Airlines Flight 302 crash, March 10 &amp; Lion Air crash, October 29, 302nd day of the year\n\nAs does Derek:\n\n* https://www.youtube.com/watch?v=6BhvFK-vnZA\n\n&gt; Ethiopian Airlines Flight 302 Crashes, Killing 157\n\n----\n\nDay after news:\n\nhttps://mybroadband.co.za/forum/threads/misdiagnosis-means-eskom%E2%80%99s-problems-will-persist.1012384/\n\n* *\"Misdiagnosis\"* = **57** reduced\n\n...and we a circle of 'the number', but one short of a golden ratio code in trigonal (ie. 1060)...\n\n* thus: *\"A Misdiagnosis\"* = **1061** trigonal | **139** ordinal\n* ... see: /r/GeometersOfHistory/wiki/spellcomponents/161 (Golden ratio, Green Matrix Code)\n* ... see: /r/GeometersOfHistory/wiki/spellcomponents/139 (English Alphabet = Occult Alphabet)\n\nthus:\n\n* *\"Misdiagnosis\"* = **57** reduced\n* *\"Misdiagnosis\"* --&gt; *\"A Miss Diagnosis\"* = **157** | **2,343** sq (ie. 7x7x7 = **343**)\n\n----\n\nWikipedia description, front page:\n\n&gt; Ethiopian Airlines Flight 302 crashes shortly after take-off from Addis Ababa for Nairobi\n\n* *\"Nairobi\"* = **68** (ie. The Storm again)\n\nFrom my page on 911:\n\n&gt; Many conspiracy theorist point out that the 9/11 disaster was a ritual long-planned, with visible beginnings in 1968\n\n* *\"The Storm\"* = **1968** squares (note: square cypher --&gt; first visible to us blockheads)\n* ... see: /r/GeometersOfHistory/comments/8mq1ay/gematria_tangents/dztd211/ ('68)\n\n&gt; **1968** – 20/12 - The Zodiac Killer murdered the first of his five confirmed victims in Vallejo, California, a case which remains unsolved.\n\nAnyway:\n\n* *\"Nairobi\"* = **121** reverse (ie. Corruption, Pain, Revelation, Number Ring)\n* ... see: /r/GeometersOfHistory/wiki/spellcomponents/121\n* *\"Nairobi\"* = **408** sumerian (ie. Evil Ring)\n* *\"Nairobi\"* = **221** english-extended (ie. The Needle, The Bavarian Illuminati)\n* ... see: /r/GeometersOfHistory/wiki/spellcomponents/220\n* *\"Nairobi\"* = **191** jewish (ie. golden ratio code, 161, upside-down)\n* ... see: /r/GeometersOfHistory/wiki/spellcomponents/161\n* *\"Nairobi\"* = **38** jewish-reduced (ie. death, fire, change, gold)\n* *\"Nairobi\"* = **135** baconis (ie. one eye)\n* *\"Nairobi\"* = **202** primes (ie. master builder number, double-pillard entranceway)\n* ... see: /r/GeometersOfHistory/wiki/spellcomponents/220\n* *\"Nairobi\"* = **490** trigonal (ie. 49th prime is 227 circle code + a circle)\n* ... see: /r/GeometersOfHistory/wiki/spellcomponents/227\n* *\"Nairobi\"* = **912** squares (ie. one beyond **911**, will there be a 913 and 914?)\n* *\"A Church\"* = **912** squares (ie. *\"Church\"* = **911** squares)\n* ... see: /r/GeometersOfHistory/wiki/discovery/return_church\n\n&gt; take-off from Addis Ababa for Nairobi, Kenya\n\nsee: https://en.wikipedia.org/wiki/Quenya\n\n... converting the formal comma into a '1':\n\n* *\"Nairobi, Kenya\"* = *\"Nairobi (A) Kenya\"* = **203** bacon | **247** baconis | **1881** squares\n* ... see: https://en.wikipedia.org/wiki/23_enigma\n* ... see: /r/GeometersOfHistory/wiki/spellcomponents/247\n* ... *\"Occult Scheme\"* = **1881** squares (ie. reflective 188)\n* ... *\"Liturgy\"* = **1088** trigonal\n* ... *\"The Enlightened\"* = **188** bacon\n* ... *\"Alphabet Conspiracy\"* = **188** trigonal\n* ... see: /r/GeometersOfHistory/wiki/spellcomponents/188\n\n----\n\nThe date:\n\n* *\"March Ten, Twenty Nineteen\"* = **104** reduced | **319** reverse\n* ... see: /r/GeometersOfHistory/wiki/spellcomponents/104\n* ... see: /r/GeometersOfHistory/wiki/spellcomponents/319\n* *\"March Tenth, Twenty Nineteen\"* = **303** | **114** reduced\n* ... see: /r/GeometersOfHistory/wiki/spellcomponents/33\n* ... *\"domination\"* = *\"world war\"* = *\"holocaust\"* = *\"pearl harbor\"* = **114**\n* ... .. *\"history\"* = *\"the atom bomb\"* = *\"tinfoil hat\"* = **114**\n* ... .. .. *\"mind\"* = **114** primes\n* *\"March Ten, Two-Thousand Nineteen\"* = **121** | **119** jr | **1039** primes\n* *\"March 10, 2019\"* = **38** reduced (ie. death, fire, change, gold)\n* *\"March 10, 2019\"* = **580**  squares\n* ... .. .. /r/GeometersOfHistory/wiki/discovery/meaning\n* *\"March 10, 2019\"* = **318**  trigonal\n* ... see: /r/GeometersOfHistory/wiki/spellcomponents/318\n* *\"March 10\"* = **44** | **36** | **93**\n* *\"March 10\"* = **123** jewish | **306** trigonal\n* ... *\"Alphabetic Codes\"* = **123** | *\"Master\"* = **306** jewish\n* ... see: /r/GeometersOfHistory/wiki/spellcomponents/123\n* *\"March Ten, Twenty Nineteen, Plane Crash\"* = **2232** sumerian | **5,888** squares\n* ... see: /r/GeometersOfHistory/wiki/spellcomponents/223\n* ... see: /r/GeometersOfHistory/wiki/spellcomponents/888\n* *\"March Ten, Twenty Nineteen: A Plane Crash\"* = **1,187** primes | **373** ordinal\n* ... see: /r/GeometersOfHistory/wiki/spellcomponents/187\n* ... see: /r/GeometersOfHistory/wiki/spellcomponents/777\n* *\"March Ten, Twenty Nineteen: A Plane Crash\"* = **2,365** jewish | **555** bacon\n* ... see: /r/GeometersOfHistory/wiki/spellcomponents/365\n* ... see: /r/GeometersOfHistory/wiki/spellcomponents/555\n\n----\n\nEDIT: Some relevant extra notes on later articles in the footer of:\n\n* /r/GeometersOfHistory/wiki/spellcomponents/47 (ie. Ethiopian Lion)\n\n----\n\nEDIT: wikipedia featured article, front page:\n\n&gt; The **WAVES** (Women Accepted for Volunteer Emergency Service) served in the United States Naval Reserve during World War II.\n\n* *\"WAVES\"* =  **242** primes | **70** ordinal | **1400** squares\n* ... *\"Proof\"* = *\"Enough\"* = **70**\n* ... .. .. *\"To Know\"* = **322** primes\n* ... .. .. *\"The Proof\"* = **322** primes\n* ... see: /r/GeometersOfHistory/wiki/spellcomponents/322\n\nsee: https://en.wikipedia.org/wiki/Wave_%28gesture%29\n\n---\n\nEDIT: https://arstechnica.com/gaming/2019/03/breakthrough-review-cancers-rough-but-nobel-winner-jim-allison-is-a-tough-s-o-b/\n\n&gt; *Breakthrough*, the rare science documentary that feels like a miracle\n\n* \"*Breakthrough*\" = **1088** trigonal | **2402** squares (ie. **188** and **242**)\n* *\"The Breakthrough\"* = **77** reduced (ie. Power, Glory, Regency, Christ)\n* *\"The Breakthrough\"* = **664** jewish\n\nie. **664** is two short of **666** - what is the breakthrough? A=1:\n\n* *\"A=1: The Breakthrough\"* = **666** jewish\n* ... *\"Citizen\"* = **666** jewish | **777** trigonal\n* *\"A=1: The Breakthrough\"* = **247** bacon\n* ... *\"Jesus\"* = **247** primes\n* ... *\"Number of the Illuminati\"* = *\"Number of the Alphabet Song\"* = **247**\n\n&gt; *Breakthrough*, the rare science documentary that feels like a miracle\n\n* *\"The Breakthrough\"* = **332** baconis (ie. reflecting 233)\n* see: /r/southafrica/comments/ayoopi/south_africa_has_a_new_tallest_building_the/ei27via/\n\n---\n\nhttps://www.wired.com/story/the-genderless-digital-voice-the-world-needs-right-now/\n\n&gt; The Genderless Digital Voice the World Needs Right Now\n\n* *\"Genderless\"* = **332** primes (and **108** | **45** reduced)\n* ... https://en.wikipedia.org/wiki/Baphomet\n* ... Gender --&gt; not far from Gander\n* ... experiment: *\"Gundar\"* = **449** jewish ... and *\"GNDR\"* = **314** trigonal\n\nIf mainstream society rids itself of gender, it will have attained...\n\n... https://en.wikipedia.org/wiki/The_End_of_Violence\n\nAccording to my perceptions of the procreative symbolism in the alphabet codes, 'sex is violence' - particularly the taking of virginity. I'm still undecided about the original alphabet maker's perspective on this exactly (ie. how much the 'nasty tyrannical patriarchy' has expressed itself in these codes; how much 'objectification' is going on, or whether instead we have a 'worshipful acknowledgement' of the give-and-take of power, when it comes to sex). I suspect that while much innuendo and 'patronising' is to be found, that indeed the code is 'genderless', and the master-servant relationship goes both ways. Don't take my word on that - still under investigation...\n\n---\n\nOne of Zach's recent videos: https://www.youtube.com/watch?v=7jv8yAA_tBk\n\n&gt; Alyssa Carson, scheduled to be the first person on Mars in 2033, to establish colony\n\n* *\"Mars Mother\"* = **474** jewish \n* .. *\"The Illuminati\"* = **474** primes\n* .. *\"Numerology\"* = **474** primes\n* ... see: /r/GeometersOfHistory/wiki/spellcomponents/474\n* *\"Mars Mother\"* = **51** jewish-reduced \n* ... ie. see the 51's in Zach's video, as linked\n* *\"Mars Mother\"* = **130** basic alphabetic (ie. 'M' = **13**)\n* ... ie. Mars + Moon = new Martian Man\n* *\"Mars Mother\"* = **49** reduced (ie. 49th prime is **227**; pi; circle)\n* ... see: /r/GeometersOfHistory/wiki/spellcomponents/227\n* *\"Mars Mother\"* = **421** primes (ie. one beyond classic **420**; math circle; *smoke*)\n* *\"Mars Mother\"* = **1096** trigonal (ie. 10 = 'X'; and **96** is naughty knowledge of Atlantis)\n\nShe will be the first *\"Strong\"* = *\"Red Woman\"* = **93** | **123** reverse | **373** st\n\n* *\"The Mother of Mars\"* = **913** english-extended (see 911, 912, 913 query on this page)\n\n&gt; Alyssa Carson, first person on Mars in 2033, to establish colony\n\n* *\"The Geometry\"* = **2331** squares (ie. 233.1)\n\n... to make it symmetrical, ask a question and answer it:\n\nQ: Witch Geometry?\n\n*\"A: The Geometry\"* = **2332** squares (and thus **142** or one **42** in ordinal, and **1,321** in english-extended\n\nQ: Who makes it?\n\n*\"A: The Geometer\"* = **373** primes\n\nA &lt;--- https://en.wikipedia.org/wiki/Compass_%28drafting%29\n\n", "score": 1, "send_replies": true, "subreddit": "GeometersOfHistory", "date_year_month": "2019-03", "created_utc_converted": "2019-03-10 22:59:09", "score_overall": 17, "words": "conspiracy illuminati jewish jewish conspiracy holocaust jewish jewish jewish jewish jewish jewish illuminati jewish jewish illuminati jewish", "shared_words": "conspiracy illuminati jewish holocaust", "socre_distint": 4}
{"author": "RussiaWillFail", "body": "The problem you're always going to have is that Israel is a convenient geopolitical shield for both Western and Middle Eastern political ends. This is why there is no solution to the Middle Eastern crisis. Israel will never stop being a convenient target for the Guardian Council and Ayatollah in Iran to control ambitious extremist Parliamentarians in the Majlis. Israel will never stop being a convenient excuse for American and European governments to sell military equipment and services to Israeli-aligned forces in the region. Israel will never stop being a convenient distraction for religious extremists in America and Saudi Arabia, to gain power and support by arguing over who rightfully owns what in Israel.\n\nFrom a historical standpoint, Israel was minority Jew up until the 1920s and shifted only as a result of the Zionist movement, which itself only happened because of rising antisemitism against Ashkenazi Jews in the West - fueled predominantly by a populous that was terrified of a rapidly changing world and ended up blaming the Jews for the destabilization in the world, because in the 1880s, the complex shifting of monarchies to democracies, the chaos in France caused by the fall of Napoleon and the revolution of 1848, the rise of America, the creation of Germany, the decaying of Russia and the advent of Industrialization were extremely difficult to understand individually for the average person, let alone understanding all of this happening at once. The entire old world order was collapsing and people wanted something to blame for it all that was easy to understand: the unfortunately became the Jewish people, a relatively homogeneous culture that was a blend of Orthodox and mystic traditions that had been forced historically into non-desirable fields like money management.\n\nThe collapse of Mercantilism into Capitalism in the Industrial Age all of a sudden saw money managers become much more important and influential members of society. This was made especially true by the new economic systems emerging in America and the United Kingdom that were being copied and borrowed from in the emerging representative democracies across Europe. The Jews had effectively been lifted to prominence by a world that craved equal representation. This led to suspicion and conspiracy theories being thrown around, but were ultimately crystallized into their much more modern and recognizable form in Russia.\n\nAs Russia had faced one disastrous Czarist regime after another, they had seen the Russia that Catherine the Great built crumble into being the sick man of Europe. After attempts to cast the Ottoman Empire as being the source of Russia's failures fell flat, the Czarist regime's secret police under Nicholas II conspired with the Russian Orthodox Church to write *The Protocols of the Elders of Zion*. The Protocols centered around a narrative stolen from a relatively popular French fiction book by Maurice Joly called *Dialogue in Hell Between Machiavelli and Montesquieu (1864)* about a secret society trying to take over the world. This same book inspired many of the Illuminati conspiracy theories that became popular after the original Illuminati group failed in a comically spectacular fashion (seriously, look up the history of the actual Illuminati sometime, its founder was one of the most what we would call today \"cringey\" characters in world history). The secret society of Joly's book was repurposed into a grand Jewish conspiracy that accused the Jewish people of every modern antisemitic prejudice and conspiracy we know today.\n\nThe Protocols would go on to become a bestseller in Europe and America, setting off a mad wave of antisemitism and would eventually find its way to young Bavarian ex-soldier named Adolf Hitler. The Protocols are directly referenced in Mein Kampf as one of the founding sources of Hitler's conspiracies about the Jews and would go on to inform much of the antisemitic propaganda crafted by Goebbels in the Reich Ministry of Public Enlightenment and Propaganda.\n\nTo this day American Evangelicals, Neo-Nazis, UKIPers, National Fronters, Islamic Extremists, Islamic governments and even Russia to this day still promote these outright lies, fabrications and plagiarized fever dreams as being part of the Jewish conspiracy. Israel provides fodder for them, their hatred and their recruitment of others to their causes.\n\nStopping violence against Jews by any group is impossible in the modern era. They are intricately tied into the false narratives of the establishment of modern society for *hundreds of millions* of people, their families, their churches, their mosques, their religions and their cultures.\n\nIf this problem was solvable, we would have solved it decades ago. The problem with the Israel problem, is that it's caused by a bad strand of RNA in the DNA that makes up the modern world order.", "score": 6, "send_replies": true, "subreddit": "changemyview", "date_year_month": "2019-03", "created_utc_converted": "2019-03-10 23:20:16", "score_overall": 13, "words": "jew jewish conspiracy illuminati conspiracy illuminati illuminati jewish conspiracy jewish conspiracy jewish conspiracy", "shared_words": "jew jewish conspiracy illuminati", "socre_distint": 4}
{"author": "payvavraishkuf", "body": "I have never encountered anyone with a strong preference for Jew(s). I have met people with a strong preference for Jewish people. Most are ok with anything as long as there's good intentions (that's the camp I fall in as well).\n\nJust don't engage in blood libel or other antisemitic conspiracy theories or dogwhistles and we're all good. ", "score": 10, "send_replies": true, "subreddit": "Judaism", "date_year_month": "2019-03", "created_utc_converted": "2019-03-11 23:44:58", "score_overall": 4, "words": "jew jewish libel conspiracy", "shared_words": "jew jewish libel conspiracy", "socre_distint": 4}
{"author": "jamesd1100", "body": "People aren't claiming that \"questioning the U.S commitment to Israel\" is anti-semitic.\n\nWhat they are claiming, and what is inherently accurate, is a congresswoman invoking claims of Jewish money controlling political thought, an old anti-semitic trope, Israeli Jews being \"Hypnotists\" and hypnotizing foreign governments into submission, which is an old anti-semitic trope, and that Jewish Americans have dual loyalty to Israel, which is again, an old anti-semitic trope, constitutes full blown anti-semitism, is in no way a legitimate criticism of Israeli or US policy, and considering the multitude of well documented tropes she invoked, it seems intentional, and that she knows *exactly* what she is doing. \n\nThe fact that she is a member of the cultural and religious group which holds the most anti-semitic sentiment of any on the planet is just coincidence too I guess. Jews aren't persecuted in mass in Muslim countries or anything. \n\nThose comments are anti-semitic, it is not simply a questioning of our support of Israel or Israeli policy to say \"It's all about the Benjamins baby\" to imply jews are buying congressional influence, or to say \"Israel has hypnotized the world,\" or Jewish American \"Allegiance to a foreign country.\"\n\nTropes of dual loyalty were used against Jews in Poland and Germany and used as justification for the holocaust. That's not opinion, that's historical fact, and a jewish person claiming that isn't anti-semitic doesn't change that.\n\nhttps://en.wikipedia.org/wiki/Antisemitic_canard\n\n&gt;A canard found in The Protocols of the Elders of Zion, but dating to before that document, is that Jews are more loyal to world Jewry than to their own country. Since the establishment of the state of Israel, this canard has taken the form of accusations that Jewish citizens of countries such as the United States are more loyal to Israel than to their country of residence\n\nHistorical tropes of Jews being rogues, swindlers, or hypnotists, which are blatantly rooted in centuries of history, are anti-semitic, again, not opinion, historical fact.\n\nhttps://books.google.com/books?id=CSiVjbER1MEC&amp;pg=PT31&amp;lpg=PT31&amp;dq=jewish+rogue+trope&amp;source=bl&amp;ots=bWgL0F0C6v&amp;sig=ACfU3U2RFGcu96qtZNuyDST9dYnZXcT1rA&amp;hl=en&amp;sa=X&amp;ved=2ahUKEwi77t3jovTgAhUliOAKHXdHA6wQ6AEwBHoECAYQAQ#v=onepage&amp;q=jewish%20rogue%20trope&amp;f=false\n\nhttps://www.jpost.com/Diaspora/Antisemitism/An-idiots-guide-to-anti-Semitic-tropes-581178\n\n&gt;She wrote of Israel having “hypnotized” the world, which touched on a trope as old as the “Protocols” of Jews mesmerizing governments into submission.\n\nStereotypes about jewish money, or jewish money controlling the media or politics are once again inarguably anti-semitic and rooted in history. \n\nhttps://en.wikipedia.org/wiki/Economic_antisemitism\n\n&gt;Derek Penslar describes modern economic antisemitism as a \"double helix of intersecting paradigms, the first associating the Jew with paupers and savages and the second conceiving of Jews as conspirators, leaders of a financial cabal seeking global domination\". Throughout history, stereotypes of Jews as being connected to greed, money-lending and usury have stoked anti-Jewish sentiments and still, to a large extent, influence the perception of Jews today. Reuveni and Wobick-segev suggest that we are still haunted by the image of \"the mighty, greedy Jew\".\n\nI hope this post very well clarifies what people are finding anti-semitic, and it's not \"General criticisms\" or \"Questioning\" of US support of Israel.\n\nIf someone tweeted \"We should consider the nature of our relationship with Israel,\" or \"I don't agree with Israeli policy on ___\" no one would give a shit. That's not what has happened here.\n\nAnd worse, Democrats defended vehemently Omar's comments and changed a resolution on anti-semitism into something entirely different, ommitting her name entirely from the resolution, keeping her on the foreign affairs committee, and now painting her as a victim of Islamophobia and not the recipient of legitimate criticism for her terrible comments.\n\nThat's all excluding the fact that we SHOULD support Israel, our strongest ally in the most contentious region on the planet in the middle east, which consists of a group of people who flocked there in the wake of one of the worst genocides in human history, who have an ancestral religious claim on the land, which is the freest Democracy in the entire middle east. ", "score": -1, "send_replies": true, "subreddit": "changemyview", "date_year_month": "2019-03", "created_utc_converted": "2019-03-12 17:42:42", "score_overall": 14, "words": "jewish jewish jewish holocaust jewish jewish jewish jewish jewish jewish jew greed jewish jew", "shared_words": "jewish holocaust jew greed", "socre_distint": 4}
{"author": "hannahstohelit", "body": "I researched this, because it seemed like a fascinating question and I had no idea of the answer, and I found an interesting book called German Rocketeers in the Heart of Dixie, by Monique Laney, which went into this question as it pertained to the NASA scientists working in Hunstville, Alabama (where Wernher von Braun led the team at Redstone Arsenal). It includes interviews with Jewish residents of Huntsville at the time that the German scientists moved in- not necessarily Jews who were working for NASA (as the book mentions, Jews had been subject to quotas in both college admissions and hiring in the interwar years, and so were underrepresented in engineering and science fields), but Jews who lived with the Germans who were working for NASA. \n\nSome Jews definitely seem to have been discomfited by having new neighbors who were German and/or Nazi-affiliated. One anecdote by a woman from a long-standing, mostly assimilated Jewish family in Huntsville describes how her father, who had been involved in the attempted rescue of Holocaust victims, forbade her from dating the sons of the German scientists who lived in the area. A man discussed how his grandfather, who had been a refugee from Russia in the 1910s and whose family were killed in the Holocaust, used to go to the back of his office when he heard someone in a German accent come in and would have his son deal with those customers- but also says that this was based on the grandfather's personal experience of antisemitism from German POWs who had been kept near Huntsville during the war and with whom he had worked. There was, however, no open hostility directed at the Germans by the Jews- they were very careful to keep up a veneer of politeness. \n\nIt should be noted- there was not necessarily a direct correlation between this veiled anger and any actual Nazi affiliations on the part of the Germans. To a great extent, it was just as much a part at a general feeling of anger at the German nation as a whole on the part of American Jewry, the sense of collective blame for the horrors of the Holocaust. One son of one of the German scientists, who later married a Jew, described his \"radar toward when a Jewish person’s back gets up when they hear that I’m German. . . . it’s sort of a palpable kind of chemistry going on\" (123-124)- and this was in the 21st century! Imagine how much more intense those feelings of discomfort must have been among Jews only a decade removed from the Holocaust, but the anger was directed at Germans in general, not at the rocket scientists in particular. \n\nThis changed when a Huntsville scientist, Arthur Rudolph, was revealed in 1984 to have been in charge of a slave labor camp (most of the inmates of which were not Jewish) which produced V-2 rockets at Mittelbau-Dora. While Wernher von Braun had previously admitted that he'd known that slave labor was being used to produce rockets in Nazi Germany, he had claimed that the rocket scientists had no control over this and that it was entirely in the purview of the SS. It was then revealed that Rudolph had in fact directly chosen to utilize slave labor and supervised slaves in Dora, which led to Rudolph voluntarily giving up his US citizenship (as opposed to having it forcibly stripped from him) and leaving the country. This made it much clearer to the US public that von Braun had not been honest in his appraisal of the situation and that many of the German scientists brought to the US were almost certainly far more implicated in slave labor practices than had been previously assumed. \n\nWhile by and large the German scientist community in Huntsville certainly stood behind Rudolph, a large number of the rest of the (white non-Jewish) population did as well, as they attributed the growth of Huntsville and the US space program in general to these scientists and thought of them as their neighbors. They often felt that the treatment which Rudolph had received was a disgraceful reflection on the US, which had used him for his skills and then discarded him, and that people must be able to be forgiven for their past mistakes, especially in a war. The Jewish population of Huntsville, however, did not doubt that Rudolph was guilty. One woman (the same one mentioned above as being not allowed to date German boys) said that while she'd never really put two and two together about the rocket scientists and the Holocaust, she didn't doubt his guilt Another woman who had personally met Rudolph socially had a hard time reconciling the idea of a user of Holocaust slave labor with the nice man she'd met but also was confident that he was guilty of the crime. Her husband made a striking statement- while many non-Jewish Huntsville residents were saying that the US had used Rudolph and then tossed him out when they were done with him, he said that Rudolph's crime was using prisoners and when he was done with them tossing them in the crematorium. Laney uses this comparison to point out the vast perception gap between Jewish and non-Jewish residents of Huntsville. \n\nSome Jewish residents of Huntsville noted that while they had worked alongside the scientists and therefore pushed many of these thoughts (about potential Nazi collaboration on the part of their coworkers) away at the time (in the 50s and 60s), when the Rudolph story came out these thoughts resurfaced, and one described how since then she has never really stopped having negative thoughts about even the children of the scientists with whom she is now friends (including Rudolph's daughter). Jewish residents also were shocked and angered by antisemitism shown by many of their non-Jewish neighbors, as many of those defending Rudolph soon turned to conspiracy theories about \"the Jews\" being behind the whole setup and manufacturing a case. The case even brought outright Holocaust deniers like David Irving to town. They were also angered at the lack of any remorse expressed by their German neighbors for what had happened under their noses during WWII. ", "score": 4, "send_replies": true, "subreddit": "AskHistorians", "date_year_month": "2019-03", "created_utc_converted": "2019-03-12 18:28:26", "score_overall": 21, "words": "jewish jewish holocaust holocaust holocaust jew jewish holocaust jewish jewish jewish holocaust holocaust jewish jewish jewish jewish jewish jewish conspiracy holocaust", "shared_words": "jewish holocaust jew conspiracy", "socre_distint": 4}
{"author": "politicaldeviant", "body": "I know your comment is months old, but I've been reading through this thread after finding out about his views. I really want to stress that his content is the reason I have become interested in the speedrunning community. I was looking up videos on YouTube hoping for some Goldeneye nostalgia and came across SpeedLore, and ended up watching the entire series over the period of a month. It's a great series and I shared it with a lot of friends. \n\nAnd then I found out this controversy, and I was extremely disappointed by Goose's views and fully support AGDQ's decision. But I don't hate him, and his views do not lessen his previous contribution to Goldeneye and Perfect Dark speedrunning or the speedrunning community as a whole. I sincerely hope his records are not wiped. But I will not share his videos anymore and I will not support any organization that wants to stay affiliated with him.\n\nI once held the views you have expressed throughout this thread, that silencing and ostracizing individuals with these views is counterproductive and only enforces those views. But I have learned through personal experience that is inaccurate. It doesn't matter what you do, because their views will not change from any outside evidence or argument. Debate is counterproductive, it only reinforces their racial views. They have lost the entire concept of objective truth. They can't be reasoned with, and any debate about their views will not be conducted in good faith. The platform granted to them by those that hold the views I once had and that are similar to yours is exploited as a recruiting tool. \n\nI said I learned that personally, and it's because over the past five years I initially took your stance in how to deal with the very concerning views that a few of my childhood friends have developed. It took me way too long to realize I lost them the moment they bought into white-nationalist bullshit.\n\nAny proof or documentation you could provide will be met with 'Jewish lies and propaganda' or equally ridiculous claims of Jewish conspiracy. I tried to understand how they have come to their views. I listened to podcasts, I listened to their unsubstantiated 'proof', and what was most disturbing is how they focus on 'optics' and why.\n\nTheir growth depends and is centered around their ability to phrase and parse their talking points as somehow having an equal footing to that of any opposing view. They actively try to twist objective reality to give merit to ideas such as holocaust denial. They try to frame it as if there is a real academic debate on whether or not events like the holocaust ever occurred. They want an equal footing. They want to weaponize the idea of free speech. It's not as self-aware and insidious of an action as it sounds either, they're aware of the lack of concrete evidence to backup their claims, they however are convinced that is just a consequence of a vast Jewish conspiracy. So instead of providing proof, which can't stand up to any academic scrutiny, they turn it into an argument about free speech and try to 'red pill' and 'wake up' as many people as they can in the process. \n\nMost people are able to see through it, but some don't. And those that fall for it, they don't come back easily. They've actively decided to ignore any and all evidence that doesn't fit into their racial views *because anything counter to their narrative is proof of Jewish 'trickery'*. It's a self reinforcing mindset. It is a societal virus.\n\nGoose's content didn't push an agenda, some of the phrases he used or comments he made made me raise my eyebrows a couple times, but I still shared his content. But I've read the discord leaks and so has everyone else. And arguments like yours give people that share his views a platform in which to argue that their views are worthy of debate and consideration, and people that yell 'censorship!' and 'they have a right to voice their opinion regardless of what their opinions are!' haven't realized they rely on you to help them 'redpill' other far more gullible people. ", "score": 1, "send_replies": true, "subreddit": "speedrun", "date_year_month": "2019-03", "created_utc_converted": "2019-03-12 20:40:57", "score_overall": 9, "words": "silencing jewish jewish conspiracy holocaust holocaust jewish conspiracy jewish", "shared_words": "silencing jewish conspiracy holocaust", "socre_distint": 4}
{"author": "Tlas8693", "body": "Unfortunately anti-Semites racists have completely and utterly co-opted anti-Israel rhetoric to the point of being toxic. It is not inherently anti-semitic to criticize Israel unless you are applying double standard and just spewing vitriol with no nuance. Even the IHRA says that. \nWhen you go into foreign influence you go to completely into muddy waters if not the abyss of most vicious anti-semitic conspiracy theories like protocols of Zion and ford’s “ international jew” and the like, imo this is very dangerous since the likes of the protocols of Zion actually were instrumental in inspiring the Holocaust. \n\nThe theory of jewish foreign influence was a bedrock of nazi genocidal anti-semitism. Unfortunately most of those who promote foreign influence idea are outright anti-Semites tbh. It is such a thin line to the point the Jewish foreign influence idea is almost always certainly associated with rabid anti-semitism if not outright genocidal neo-nazism. \n\nUnfortunately anti-israel rhetoric is all but co-opted by anti-Semites so much so that they have really utterly tarnished it and made it toxic. There are legit sensible critics and criticisms of Israel who are not anti-semites but i really believe that they are really outnumbered by  anti-semite racists who use ages old anti-semitism and hide under the cloak of anti-israel rhetoric and just make the issue filled with hate and toxic anti-semitic racism. It is what it is.", "score": 1, "send_replies": true, "subreddit": "unpopularopinion", "date_year_month": "2019-03", "created_utc_converted": "2019-03-13 05:24:15", "score_overall": 5, "words": "conspiracy jew holocaust jewish jewish", "shared_words": "conspiracy jew holocaust jewish", "socre_distint": 4}
{"author": "dongasaurus", "body": "Of course they did, part of the conspiracy was that he was a Jewish holocaust survivor *who was also a Nazi as a child during the holocaust* and carried out all sorts of nefarious Jewish globalist plots using his Jew money.", "score": 4, "send_replies": true, "subreddit": "europe", "date_year_month": "2019-03", "created_utc_converted": "2019-03-13 11:59:53", "score_overall": 7, "words": "conspiracy jewish holocaust holocaust jewish globalist jew", "shared_words": "conspiracy jewish holocaust globalist jew", "socre_distint": 5}
{"author": "senpuu_kns", "body": "I think it's government thing. Israeli government has reached quite high level of being despicable and so did Polish. When u have antisemites in government, who publicly push the \"jewish conspiracy against poles\" agenda, not expecting Israeli reaction is quite naive.  \n\n\nI know, that former Eastern Block countries have quite an issue regarding antisemitism, some big scars because of some despicable people were cooperating with nazis during holocaust (more of them were not, of course) and they all go protective on this, however what I see in Poland is government fueled antisemitism. And that is something what is really bad.  \n\n\nYou can't blame Israel for being overzealous regarding antisemitism. 6 millions of Jews died because of antisemitism. However when government starts blaming certain Jews for controlling media publicly - well, holocaust started by government taking actions against Jews also.  \n\n\nFor jewish people this looks like Russia for us. You never know, when \"minor\" skirmishes in Ukraine will end up spilling all over Eastern Europe.  \n\n\nWe should be a little bit more emphatic and more reasonable. Sadly, if you're in government and you want to maintain power, scapegoat strategy helps...", "score": 0, "send_replies": true, "subreddit": "poland", "date_year_month": "2019-03", "created_utc_converted": "2019-03-13 12:05:19", "score_overall": 6, "words": "jewish conspiracy holocaust holocaust jewish scapegoat", "shared_words": "jewish conspiracy holocaust scapegoat", "socre_distint": 4}
{"author": "PoppinKREAM", "body": "**President Trump and his administration have espoused dangerous rhetoric and have made decisions that are being interpreted as implicit support of egregious actions perpetuated by the far right.**\n\nIn 2009 and 2015 the Department of Homeland Security, as well as the FBI, warned us about the rise of far right terrorism.^[[1]](http://www.cbsnews.com/news/dhs-report-warns-of-right-wing-extremists/) In one of his first acts as President he cut funding to programs meant to combat far right terrorism.^[[2]](https://www.reuters.com/article/us-usa-trump-extremists-program-exclusiv-idUSKBN15G5VO) This action was taken when there is a growing trend of anti-government terrorism.^[[3]](https://www.nytimes.com/2015/06/16/opinion/the-other-terror-threat.html) The United States of America is a victim of 300 violent attacks inspired by the far right every year.^[[4]](https://www.pbs.org/newshour/show/u-s-sees-300-violent-attacks-inspired-far-right-every-year) The threat of Islamic terrorism should never be overlooked and should be taken very seriously, however President Trump's administration completely ignores one of the largest perpetrators of terrorism in America.^[[5]](https://www.gao.gov/assets/690/683984.pdf) \n\n&gt;The frequency of far-right attacks is particularly significant in the United States, where white supremacist, anti-government and neo-Nazi extremists have been responsible for 73 percent of deadly terrorist attacks since Sept. 11, 2001, according to the Government Accountability Office. Also notable is that in many cases, Muslims have become the target of violence.\n\nFor example last year three men from Illinois who were charged for planning to bomb a mosque. One of the men drafted a border wall plan for Trump.^[[6]](http://www.chicagotribune.com/news/local/breaking/ct-minnesota-mosque-bombing-20180313-story.html) I'll include this small excerpt from an article by USA Today, I implore everyone to read how far right terrorism is rapidly accelerating in America. This all occurred in a single week in May of 2017 and yet President Trump is still waiting for all the facts before he does anything.^[[7]](https://www.usatoday.com/story/opinion/2017/08/18/president-trump-wants-facts-right-wing-extremism-here-they-are-erroll-southers-column/577308001/) \n\n&gt;•    May 20 – Richard Collins III, an African American and Bowie State University student, was stabbed to death by Sean Urbanski, a member of a Facebook group called the \"Alt-Reich: Nation.\"\n\n&gt; •    May 26 – Three men in Portland tried to stop white supremacist Jeremy Christian  from harassing two women who appeared to be Muslim. For their bravery, the three men were viciously attacked; two were murdered and the third was seriously injured. \n\n&gt;•    May 27 – Anthony Hammond was arrested in Clearlake, Calif. for allegedly stabbing a black man with a machete, after yelling racial slurs. While en route to the Lake County Jail, Hammond threatened to kill the transporting officer and his family once he was released. Hammond was charged with committing a hate crime, among other charges.\n\n&gt;•    May 28 – Two Native American men in Washington State were run over by a pickup truck driven by a white man shouting racial slurs and war whoops. One of the tribal members was killed and the other hospitalized.\n\n**President Trump's rhetoric is incredibly dangerous and is reminiscent of authoritarian leaders who have committed crimes against humanity.**\n\nThe President's rhetoric - his referral to undocumented immigrants as *\"infesting\"* the United States is incredibly dangerous and it is not the first time he has alluded to white nationalist talking points. First he tweeted it^[[8]](http://www.foxnews.com/politics/2018/06/19/republican-pressure-intensifies-to-end-family-separations-at-border.html) followed by him saying this as a statement during a speech later in the day.^[[9]](http://fox2now.com/2018/06/19/trump-ramps-up-rhetoric-dems-want-illegal-immigrants-to-infest-our-country/) Moreover, former Trump Campaign Chairman Cory Lewandowski went on national television and dehumanized a child with Down Syndrome who had been separated from their family.^[[10]](https://www.washingtonpost.com/news/morning-mix/wp/2018/06/20/womp-womp-outrage-after-corey-lewandowski-mocks-story-of-child-with-down-syndrome-separated-from-parents/?noredirect=on&amp;utm_term=.18f884832b12) President Trump has peddled anti-semetic conspiracies including the conspiracy that a prominent Jew is behind the migrant caravans^[[11]](https://thehill.com/homenews/administration/414171-trump-i-wouldnt-be-surprised-if-soros-were-paying-for-migrant-caravan) that he claims are *\"invading\"* the country.^[[12]](https://www.pbs.org/newshour/politics/watch-trump-defends-calling-migrant-caravan-an-invasion-ahead-of-midterm-elections) And Fox News has repeated extremely dangerous xenophobic rhetoric that these migrants are bringing diseases with them, they're not.^[[13]](https://www.vox.com/science-and-health/2018/11/1/18048332/migrant-caravan-fox-news-disease-smallpox-outbreaks-vaccines-xenophobia) Holocaust experts have compared the President's statements to Nazi propaganda.^[[14]](https://www.timesofisrael.com/critics-say-trumps-description-of-immigrants-recalls-nazi-propaganda/)\n\n**These xenophobic conspiracy theories are incredibly dangerous. Last year a far right conspiracist murdered 11 people in a Synagogue.^[[15]](https://www.nbcnews.com/news/crime-courts/pittsburgh-synagogue-shooting-suspect-threatened-jewish-groups-pushed-migrant-caravan-n925256) The murderer believed in the same xenophobic, racist conspiracies that were being peddled by members of the GOP, President Trump and the American rightwing media sphere.^[[16]](https://www.washingtonpost.com/politics/2018/10/29/how-trumps-conservative-media-helped-mainstream-conspiracy-theory-now-tied-tragedy/?utm_term=.005def0fb638)**\n\n___________\n\n1) [CBS - Rightwing Extremism: Current Economic And Political Climate Fueling Resurgence In Radicalization And Recruitment.](http://www.cbsnews.com/news/dhs-report-warns-of-right-wing-extremists/)\n\n2) [Reuters - Exclusive: Trump to focus counter-extremism program solely on Islam - sources](https://www.reuters.com/article/us-usa-trump-extremists-program-exclusiv-idUSKBN15G5VO)\n\n3) [New York Times - The Growing Right-Wing Terror Threat](https://www.nytimes.com/2015/06/16/opinion/the-other-terror-threat.html)\n\n4) [PBS - U.S. sees 300 violent attacks inspired by far right every year](https://www.pbs.org/newshour/show/u-s-sees-300-violent-attacks-inspired-far-right-every-year)\n\n5) [Government Accountability Office - COUNTERING VIOLENT EXTREMISM; Actions Needed to Define Strategy and Assess Progress of Federal Efforts, Pg. 28, Appendix II: Violent Extremist Attacks in the United States that Resulted in Fatalities, September 12, 2001 through December 31, 2016](https://www.gao.gov/assets/690/683984.pdf)\n\n6) [Chicago Tribune - 3 Illinois men, including one who drafted a border wall plan for Trump, charged with Minnesota mosque bombing](http://www.chicagotribune.com/news/local/breaking/ct-minnesota-mosque-bombing-20180313-story.html)\n\n7) [USA Today - President Trump wants 'the facts' on right-wing extremism. Here they are.](https://www.usatoday.com/story/opinion/2017/08/18/president-trump-wants-facts-right-wing-extremism-here-they-are-erroll-southers-column/577308001/)\n\n8) [Fox News - Republican pressure intensifies to end family separations at border](http://www.foxnews.com/politics/2018/06/19/republican-pressure-intensifies-to-end-family-separations-at-border.html)\n\n9) [Fox St. Louis - Trump ramps up rhetoric: Dems want ‘illegal immigrants’ to ‘infest our country’](http://fox2now.com/2018/06/19/trump-ramps-up-rhetoric-dems-want-illegal-immigrants-to-infest-our-country/)\n\n10) [Washington Post - ‘Womp womp’: Corey Lewandowski mocks story of child with Down syndrome separated from parents](https://www.washingtonpost.com/news/morning-mix/wp/2018/06/20/womp-womp-outrage-after-corey-lewandowski-mocks-story-of-child-with-down-syndrome-separated-from-parents/?noredirect=on&amp;utm_term=.18f884832b12)\n\n11) [The Hill - Trump: 'I wouldn't be surprised' if Soros were paying for migrant caravan](https://thehill.com/homenews/administration/414171-trump-i-wouldnt-be-surprised-if-soros-were-paying-for-migrant-caravan)\n\n12) [PBS - WATCH: Trump defends calling migrant caravan an ‘invasion’ ahead of midterm elections](https://www.pbs.org/newshour/politics/watch-trump-defends-calling-migrant-caravan-an-invasion-ahead-of-midterm-elections)\n\n13) [Vox - Fox News says the migrant caravan will bring disease outbreaks. That’s xenophobic nonsense.](https://www.vox.com/science-and-health/2018/11/1/18048332/migrant-caravan-fox-news-disease-smallpox-outbreaks-vaccines-xenophobia)\n\n14) [Times of Israel - Critics say Trump’s talk of immigrants ‘infesting’ US recalls Nazi propaganda](https://www.timesofisrael.com/critics-say-trumps-description-of-immigrants-recalls-nazi-propaganda/)\n\n15) [NBC - Pittsburgh synagogue shooting suspect threatened Jewish groups, pushed migrant caravan conspiracies](https://www.nbcnews.com/news/crime-courts/pittsburgh-synagogue-shooting-suspect-threatened-jewish-groups-pushed-migrant-caravan-n925256)\n\n16) [Washington Post - How the Trumps and conservative media helped mainstream a conspiracy theory now tied to tragedy](https://www.washingtonpost.com/politics/2018/10/29/how-trumps-conservative-media-helped-mainstream-conspiracy-theory-now-tied-tragedy/?utm_term=.005def0fb638)", "score": 1707, "send_replies": true, "subreddit": "politics", "date_year_month": "2019-03", "created_utc_converted": "2019-03-14 17:39:17", "score_overall": 10, "words": "conspiracy jew holocaust conspiracy jewish conspiracy jewish jewish conspiracy conspiracy", "shared_words": "conspiracy jew holocaust jewish", "socre_distint": 4}
{"author": "Red-Droid-Blue-Droid", "body": "I don't know what to tell you besides see a therapist if you can and that I understand you. I was the weird kid for being Jewish, got a lot of \"omg going to hell, why U kill Jesus, money Hollywood waaaa\" shit from Christian kids. Strangely or not, the Muslims and Sikh kids were fine with me. They surely know what it's all like better than some. Older Jews or ring one ones love to tell me how dangerous Muslims are, yet my worst experiences are with white Christians. Sometimes, it's like they lose their minds and go on endless bible spouting sprees. Right now it's them hounding me on Israeli politics and shit I don't know or can't care about. Or some of them act like anti-semitism isn't real, false flags and shit. Even better are the real conspiracy theorist who just amaze me with their bullshit. I'm sure the opposite is true somewhere, but that's just me. To this day, I still struggle with letting people know because I've gotten into the mindset of expecting the worst in every situation. I judge people fast and hard before deciding what they are, and I know it's a problem. My pessimism can be pretty bad. I'm currently seeing a therapist to work on anxiety, depression, and the strong pessimism that feeds the cycle. I may never be comfortable being open about it, it feels like taking off armor, but I'll try. \n\nWhat's sad is I've also experienced a lot of \"no real Jew\" stuff from my fellow Jews. You can never pray enough, never keep kosher or Shabbat to my heavenly standards, and many synagogs across all the major sects have been snobby rich it's like they want the money stereotype to be real. No self awareness, they shun and look down on Jews who aren't upper class. They set the bar so high with lavish Bar/Bat parties, super fancy gear, and like 2 sets rooms to be level 10000 kosher...and sometimes don't even try to hide that it's about money. And sometimes it felt real. Why did god favor them and not listen to me? Why did god make my dad sick? Why did my horrible family members live and \"only the good die young\"? Rabbis didn't help me with questions, they hand waved or shrugged or acted bored. The Chabad nearest me only talks to you for more than 5 min if you donate. Only Hillel people and maybe 1 reform rabbi helped me understand how real life and Judaism work, balance, and so on. I'm still not 100%, but at least I'm not an edgy angry atheist who does what was done to me. \n\nThese \"real Jews\" and anti-Semitic people drove me from Judaism so hard, I become an angry atheist from middle school through high school. I hated god, was suicidal, and more. I wrote off large parts of my own because of years of pain. I used to have ptsd like reactions to the though of going to or near synagogue, the real or imagined or expected judgment and hounding and interrogation was too much. What if a classmate saw me and blew my cover? So many what if's, it should be no shock I'm so anxious. I may never be very observant, I may stay reform or conservative, sometimes religion and I need to ignore each other or keep some space so extreme reactions don't happen. At best I really like Judaism, at worst I can't deal with it. I've got better friends, Jewish and non Jewish, who defy those old experiences. I've realized it's people and their choices, and I need to separate it all. I need to work on my reactions to people and such, try not to generalize. \n\nAnyways, done with my rant. Just wanted to say I know how you feel. ", "score": 4, "send_replies": true, "subreddit": "Judaism", "date_year_month": "2019-03", "created_utc_converted": "2019-03-16 17:47:50", "score_overall": 7, "words": "jewish conspiracy jew kosher kosher jewish jewish", "shared_words": "jewish conspiracy jew kosher", "socre_distint": 4}
{"author": "PoppinKREAM", "body": "The President of the United States cares more about a comedy show than  a white supremacist terrorist who massacred scores of people. The President is taking more action to support an openly racist fox news host  than condemning white nationalists. \n\nThe President of the United States is an absolute disgrace.\n\n**President Trump's administration have made policy decisions and promoted dangerous rhetoric that is being interpreted as implicit support of egregious actions perpetuated by white nationalists and the far right.**\n\nIn 2009 and 2015 the Department of Homeland Security, as well as the FBI, warned us about the rise of far right terrorism.^[[1]](http://www.cbsnews.com/news/dhs-report-warns-of-right-wing-extremists/) In one of his first acts as President he cut funding to programs meant to combat far right terrorism.^[[2]](https://www.reuters.com/article/us-usa-trump-extremists-program-exclusiv-idUSKBN15G5VO) This action was taken when there is a growing trend of anti-government terrorism.^[[3]](https://www.nytimes.com/2015/06/16/opinion/the-other-terror-threat.html) The United States of America is a victim of 300 violent attacks inspired by the far right every year.^[[4]](https://www.pbs.org/newshour/show/u-s-sees-300-violent-attacks-inspired-far-right-every-year) The threat of Islamic terrorism should never be overlooked and should be taken very seriously, however President Trump's administration completely ignores one of the largest perpetrators of terrorism in America.^[[5]](https://www.gao.gov/assets/690/683984.pdf) \n\n&gt;The frequency of far-right attacks is particularly significant in the United States, where white supremacist, anti-government and neo-Nazi extremists have been responsible for 73 percent of deadly terrorist attacks since Sept. 11, 2001, according to the Government Accountability Office. Also notable is that in many cases, Muslims have become the target of violence.\n\nFor example last year three men from Illinois who were charged for planning to bomb a mosque. One of the men drafted a border wall plan for Trump.^[[6]](http://www.chicagotribune.com/news/local/breaking/ct-minnesota-mosque-bombing-20180313-story.html) I'll include this small excerpt from an article by USA Today, I implore everyone to read how far right terrorism is rapidly accelerating in America. This all occurred in a single week in May of 2017 and yet President Trump is still waiting for all the facts before he does anything.^[[7]](https://www.usatoday.com/story/opinion/2017/08/18/president-trump-wants-facts-right-wing-extremism-here-they-are-erroll-southers-column/577308001/) \n\n&gt;•    May 20 – Richard Collins III, an African American and Bowie State University student, was stabbed to death by Sean Urbanski, a member of a Facebook group called the \"Alt-Reich: Nation.\"\n\n&gt; •    May 26 – Three men in Portland tried to stop white supremacist Jeremy Christian  from harassing two women who appeared to be Muslim. For their bravery, the three men were viciously attacked; two were murdered and the third was seriously injured. \n\n&gt;•    May 27 – Anthony Hammond was arrested in Clearlake, Calif. for allegedly stabbing a black man with a machete, after yelling racial slurs. While en route to the Lake County Jail, Hammond threatened to kill the transporting officer and his family once he was released. Hammond was charged with committing a hate crime, among other charges.\n\n&gt;•    May 28 – Two Native American men in Washington State were run over by a pickup truck driven by a white man shouting racial slurs and war whoops. One of the tribal members was killed and the other hospitalized.\n\n**President Trump's rhetoric is incredibly dangerous and is reminiscent of authoritarian leaders who have committed crimes against humanity.**\n\nThe President's rhetoric - his referral to undocumented immigrants as *\"infesting\"* the United States is incredibly dangerous and it is not the first time he has alluded to white nationalist talking points. First he tweeted it^[[8]](http://www.foxnews.com/politics/2018/06/19/republican-pressure-intensifies-to-end-family-separations-at-border.html) followed by him saying this as a statement during a speech later in the day.^[[9]](http://fox2now.com/2018/06/19/trump-ramps-up-rhetoric-dems-want-illegal-immigrants-to-infest-our-country/) Moreover, former Trump Campaign Chairman Cory Lewandowski went on national television and dehumanized a child with Down Syndrome who had been separated from their family.^[[10]](https://www.washingtonpost.com/news/morning-mix/wp/2018/06/20/womp-womp-outrage-after-corey-lewandowski-mocks-story-of-child-with-down-syndrome-separated-from-parents/?noredirect=on&amp;utm_term=.18f884832b12) President Trump has peddled anti-semetic conspiracies including the conspiracy that a prominent Jew is behind the migrant caravans^[[11]](https://thehill.com/homenews/administration/414171-trump-i-wouldnt-be-surprised-if-soros-were-paying-for-migrant-caravan) that he claims are *\"invading\"* the country.^[[12]](https://www.pbs.org/newshour/politics/watch-trump-defends-calling-migrant-caravan-an-invasion-ahead-of-midterm-elections) And Fox News has repeated extremely dangerous xenophobic rhetoric that these migrants are bringing diseases with them, they're not.^[[13]](https://www.vox.com/science-and-health/2018/11/1/18048332/migrant-caravan-fox-news-disease-smallpox-outbreaks-vaccines-xenophobia) Holocaust experts have compared the President's statements to Nazi propaganda.^[[14]](https://www.timesofisrael.com/critics-say-trumps-description-of-immigrants-recalls-nazi-propaganda/)\n\n**These xenophobic conspiracy theories are incredibly dangerous. Last year a far right conspiracist murdered 11 people in a Synagogue.^[[15]](https://www.nbcnews.com/news/crime-courts/pittsburgh-synagogue-shooting-suspect-threatened-jewish-groups-pushed-migrant-caravan-n925256) The murderer believed in the same xenophobic, racist conspiracies that were being peddled by members of the GOP, President Trump and the American rightwing media sphere.^[[16]](https://www.washingtonpost.com/politics/2018/10/29/how-trumps-conservative-media-helped-mainstream-conspiracy-theory-now-tied-tragedy/?utm_term=.005def0fb638)**\n\n___________\n\n1) [CBS - Rightwing Extremism: Current Economic And Political Climate Fueling Resurgence In Radicalization And Recruitment.](http://www.cbsnews.com/news/dhs-report-warns-of-right-wing-extremists/)\n\n2) [Reuters - Exclusive: Trump to focus counter-extremism program solely on Islam - sources](https://www.reuters.com/article/us-usa-trump-extremists-program-exclusiv-idUSKBN15G5VO)\n\n3) [New York Times - The Growing Right-Wing Terror Threat](https://www.nytimes.com/2015/06/16/opinion/the-other-terror-threat.html)\n\n4) [PBS - U.S. sees 300 violent attacks inspired by far right every year](https://www.pbs.org/newshour/show/u-s-sees-300-violent-attacks-inspired-far-right-every-year)\n\n5) [Government Accountability Office - COUNTERING VIOLENT EXTREMISM; Actions Needed to Define Strategy and Assess Progress of Federal Efforts, Pg. 28, Appendix II: Violent Extremist Attacks in the United States that Resulted in Fatalities, September 12, 2001 through December 31, 2016](https://www.gao.gov/assets/690/683984.pdf)\n\n6) [Chicago Tribune - 3 Illinois men, including one who drafted a border wall plan for Trump, charged with Minnesota mosque bombing](http://www.chicagotribune.com/news/local/breaking/ct-minnesota-mosque-bombing-20180313-story.html)\n\n7) [USA Today - President Trump wants 'the facts' on right-wing extremism. Here they are.](https://www.usatoday.com/story/opinion/2017/08/18/president-trump-wants-facts-right-wing-extremism-here-they-are-erroll-southers-column/577308001/)\n\n8) [Fox News - Republican pressure intensifies to end family separations at border](http://www.foxnews.com/politics/2018/06/19/republican-pressure-intensifies-to-end-family-separations-at-border.html)\n\n9) [Fox St. Louis - Trump ramps up rhetoric: Dems want ‘illegal immigrants’ to ‘infest our country’](http://fox2now.com/2018/06/19/trump-ramps-up-rhetoric-dems-want-illegal-immigrants-to-infest-our-country/)\n\n10) [Washington Post - ‘Womp womp’: Corey Lewandowski mocks story of child with Down syndrome separated from parents](https://www.washingtonpost.com/news/morning-mix/wp/2018/06/20/womp-womp-outrage-after-corey-lewandowski-mocks-story-of-child-with-down-syndrome-separated-from-parents/?noredirect=on&amp;utm_term=.18f884832b12)\n\n11) [The Hill - Trump: 'I wouldn't be surprised' if Soros were paying for migrant caravan](https://thehill.com/homenews/administration/414171-trump-i-wouldnt-be-surprised-if-soros-were-paying-for-migrant-caravan)\n\n12) [PBS - WATCH: Trump defends calling migrant caravan an ‘invasion’ ahead of midterm elections](https://www.pbs.org/newshour/politics/watch-trump-defends-calling-migrant-caravan-an-invasion-ahead-of-midterm-elections)\n\n13) [Vox - Fox News says the migrant caravan will bring disease outbreaks. That’s xenophobic nonsense.](https://www.vox.com/science-and-health/2018/11/1/18048332/migrant-caravan-fox-news-disease-smallpox-outbreaks-vaccines-xenophobia)\n\n14) [Times of Israel - Critics say Trump’s talk of immigrants ‘infesting’ US recalls Nazi propaganda](https://www.timesofisrael.com/critics-say-trumps-description-of-immigrants-recalls-nazi-propaganda/)\n\n15) [NBC - Pittsburgh synagogue shooting suspect threatened Jewish groups, pushed migrant caravan conspiracies](https://www.nbcnews.com/news/crime-courts/pittsburgh-synagogue-shooting-suspect-threatened-jewish-groups-pushed-migrant-caravan-n925256)\n\n16) [Washington Post - How the Trumps and conservative media helped mainstream a conspiracy theory now tied to tragedy](https://www.washingtonpost.com/politics/2018/10/29/how-trumps-conservative-media-helped-mainstream-conspiracy-theory-now-tied-tragedy/?utm_term=.005def0fb638)", "score": 931, "send_replies": true, "subreddit": "politics", "date_year_month": "2019-03", "created_utc_converted": "2019-03-17 17:20:56", "score_overall": 10, "words": "conspiracy jew holocaust conspiracy jewish conspiracy jewish jewish conspiracy conspiracy", "shared_words": "conspiracy jew holocaust jewish", "socre_distint": 4}
{"author": "Rough_Ad", "body": "On a Sunday morning at Beth Israel Worship Center in Wayne, N.J., a bearded pastor named Jonathan Cahn stood on an elevated platform, gazing over a full house. Stage lights shifted from blue to white as the backing band played a drifting melody. Two men hoisted curled rams’ horns and let out long blasts.\n\n“Some of you have been saying you want to live in biblical times,” Mr. Cahn said, pacing behind a lectern. Then he spread his hands wide. “Well, you are.”\n\nSitting at the end of a sleepy drive an hour from Manhattan, Beth Israel may look like any common suburban church. But the center has a highly unusual draw. Every weekend, some 1,000 congregants gather for the idiosyncratic teachings of the church’s celebrity pastor, an entrepreneurial doomsday prophet who claims that President Trump’s rise to power was foretold in the Bible.\n\nMr. Cahn is tapping into a belief more popular than may appear.\n\nA recent Fox News poll found one in four Americans believe “God wanted Donald Trump to become president.” Celebrities like the televangelist Paula White and Franklin Graham have boosted the idea. The president’s own press secretary suggested as much in a January interview. And on the opening day of the Conservative Political Action Conference this month, the millionaire businessman Michael Lindell took to the stage and declared President Trump “chosen by God.”\n\nMr. Cahn was ahead of the curve.\n\nHe has dedicated an entire book to this very thesis, an insight he claims to have received from God. “The Paradigm: The Ancient Blueprint That Holds the Mystery of Our Times,” in fact, is only the most recent installment of a best-selling series dealing with the supposed mystical meaning behind all manner of current events. In it, Mr. Cahn likens Mr. Trump to the biblical king Jehu, who led the ancient nation of Israel away from idolatry.\n\nWith his growing stature, Mr. Cahn is also a rising figure in some quarters of conservative politics. In an email to congregants, Mr. Cahn shared his latest good news: This weekend he is making his first trip to the president’s vacation retreat, Mar-a-Lago. He is set to address a small gathering of activists and advisers.\n\nAfter worship on a recent Sunday, in a roped-off section flanked by security guards, Mr. Cahn signed piles of his books before a small crowd. At 59, Mr. Cahn cultivates a refined demeanor, rarely appearing without a signature all-black suit and tie. He laid his hands gently on one man’s shoulders and offered quiet counsel. “Be patient,” he said. “Keep praying for breakthrough.”\n\nGail Greenholtz, an elder member, stood near the end of the line. “Many of us consider him a prophet of our time,” she said. “A visionary.”\n\nMichael Cooney, 58, had driven an hour to hear the pastor teach on politics and prophecy. “It’s all relevant for this moment,” he said. “He shows us that Trump was actually in the Bible.”\n\nImage\nImage\nCentral to Beth Israel’s story is the unlikely rise of its pastor, a liberal Jew transformed into an end-times evangelist. The tale is also a step into a controversial and burgeoning layer of American religion, where commerce, supernatural belief and patriotism blend freely. Daniel Silliman, a Valparaiso University professor of religion, called Beth Israel and its pastor part of a long tradition of Americans “looking to prophecy as a way to absorb the chaos” of current events. “It can make someone feel that God is working through human history,” he said, “transforming anxiety into a sense of fullness.”\n\nThe son of a Holocaust refugee, Mr. Cahn was raised in a nominally Jewish family in the New York suburbs. But from an early age, he was drawn to the more esoteric corners of belief.\n\nHe devoured the writings of Nostradamus, the Virginia psychic Edgar Cayce and far-out conspiracy theories about ancient astronauts. Mr. Cahn soon stumbled on “The Late Great Planet Earth,” the 1970s best-seller that argued doomsday prophecies of the Bible were playing out with events like the Cold War and Israel’s Six-Day War. Mr. Cahn bought the book thinking it was about UFOs; instead he was given a crash-course in Christian eschatology.\n\n“I was just floored,” Mr. Cahn said. On his 20th birthday, after a near-death experience — and to the dismay of his Jewish father — he became a Christian.\n\nBy the 1980s, Mr. Cahn was leading outreach for a hippy-style church in New Jersey. His hair and beard grown shaggy, he led services with a guitar slung around his neck. Mr. Cahn later broke off to lead an independent congregation, Beth Israel, and built his following through a slot on Christian radio, where his messages took on an end-times flavor.\n\nAfter the 2001 terrorist attacks struck Manhattan, Mr. Cahn adopted a sharp, even more apocalyptic focus.\n\nIn sermons, he began comparing the attacks to the ancient warnings of the Bible, drawing largely from the book of Isaiah, where God vows to punish the disobedient nation of Israel.\n\nMr. Cahn said abortion, gay rights and the perceived retreat of religion in the public square were all troubling signs that America, like ancient Israel, had lost its way.\n\nOnce rolling with this comparison, Mr. Cahn began seeing patterns everywhere. As the Israelites turned away from their God, they were attacked by Assyrians; America, in modern times, was also attacked by a foreign army from the East, Al Qaeda terrorists. After the ancient siege, the Israelites vowed to replant a destroyed sycamore grove with new trees; near ground zero, a huge sycamore tree was also destroyed, as the towers fell.\n\nThe supposed connections go on. Tenuous as they may seem, Mr. Cahn saw the links as compelling. His flock did too. “God revealed patterns,” he said. “I called it the download process.”\n\n\n\nImage\nMr. Cahn eventually turned his thesis into a full-length book, “The Harbinger,” in 2012, put out by the publishing arm of the powerhouse Charisma Media, a Christian multimedia company that also runs a daily news site. The book climbed up best-seller lists and hovered there for months, alongside blockbusters like “Fifty Shades of Grey.” He followed his debut with a companion edition and three other titles, all embellishing on the same theme of  prophecies replaying today.\n\n“None of us knew it would be so successful,” Mr. Cahn said. “It was the Lord’s hand, I believe that.”\n\nA charismatic preacher inveighing against imminent devastation is nothing new. America has long been fertile ground for would-be doomsday prophets, stretching back centuries.\n\nMatthew Sutton, a professor of history at Washington State University and the author of “American Apocalypse,” said Mr. Cahn fits a unique American mold. “In key historical moments, religious figures like this find a way to step in,” Mr. Sutton said. “They draw from apocalyptic theology and say, ‘We have this secret knowledge and can explain what’s going on.’ It fosters this sense that God’s judgment is hanging over your head.”\n\nAmong several of Mr. Cahn’s recent predecessors of this ilk would be televangelists like the Christians United for Israel founder John Hagee, whose books include “Can America Survive?” and Jim Bakker, the controversy-prone preacher who now hosts an end-times TV program and sells disaster survival products.\n\nMr. Cahn brings the tradition fully into the social-media age: many of his fans first saw him on Facebook; hundreds of posts and reposts of his sermons are uploaded on YouTube, slipped into the corners of the web where esoteric religion and conspiracy theories overlap.\n\nInto this mix came Mr. Cahn’s latest book, “The Paradigm,” which could be his most polarizing, tying his prophetic work to the election of Donald Trump.\n\nThe book, published in the months after Trump’s win, again likens America to the ancient nation of Israel — two peoples, Mr. Cahn says, who have a unique relationship with God. He then argues that all sorts of figures in contemporary politics have biblical counterparts. Bill Clinton and Hillary Clinton, for example, are the modern-day analogues to wicked Ahab and Jezebel. Trump is the  warrior-king Jehu, who took control of the nation and cast idols out of the capital. “Jehu also sought to drain the swamp,” Mr. Cahn said.\n\nTrump, “like his ancient predecessor,” Mr. Cahn writes in his book, was a “flawed vessel” being used by God. “The unlikely and controversial warrior was destined to become the new ruler of the land,” Mr. Cahn goes on. “The template would ordain that Donald Trump would become the next president.”\n\nPointing to Trump’s possible rollback of abortion rights, appointment of conservative Supreme Court judges and the move of the American Embassy to Jerusalem, Mr. Cahn casts Trump as a heroic figure. “Trump is offering us a window for revival, a window to return to God,” Mr. Cahn said. “What happened in the election was not about Trump but about something much higher, the purposes of God.”\n\n\n", "score": 1, "send_replies": true, "subreddit": "politics", "date_year_month": "2019-03", "created_utc_converted": "2019-03-17 20:17:16", "score_overall": 6, "words": "jew holocaust jewish conspiracy jewish conspiracy", "shared_words": "jew holocaust jewish conspiracy", "socre_distint": 4}
{"author": "dagdegan", "body": "Because there’s no such thing as Jewish privilege. That’s silly, to think that just because you’re born a Jew you’re entitled to some kind of compensation and get some kind of bonus. Tell that to the 6 million Jews of Arab decent who live secretly in Arab countries under sharia law.\n\nWhite privileged it over used and used incorrectly... but a fool can’t see the benefit of being white when a cop stops you over being black. Or running in an airport or government office.\n\nA Jew could probably do that too, just like a white person. But then again once people discover he’s a Jew they might start thinking hes part of a global conspiracy of Jews that are trying to control the world.\n\nI’ll say this again here. No Jew is somehow taking all the glory of the holocaust. Almost everybody acknowledges there were millions of other casualties, Including Jews. That’s why this meme agitates me... it’s wrong and people are pretending it’s knowledge dropped.", "score": 2, "send_replies": true, "subreddit": "HistoryMemes", "date_year_month": "2019-03", "created_utc_converted": "2019-03-19 02:02:27", "score_overall": 7, "words": "jewish jew jew jew conspiracy jew holocaust", "shared_words": "jewish jew conspiracy holocaust", "socre_distint": 4}
{"author": "Alexinova", "body": "Islamophobia is oft criticized as a term for it implies that any and all negative perception of Islam is hateful. Opponents of Islamophobia being a legitimized and systematized term say it is a form of censorship and a method of silencing critics. Proponents of it tend to have a better grasp of history and the systematization of anti-Jewish rhetoric turning into racial discrimination which lead into the holocaust. The conundrum with Sam Harris and other critics of Islam are that they do not wish to acknowledge the racial implications their words have, approaching each discussion with such a strict sense of ethnocentrism that they nigh dehumanize the 'other'. Their arguments exist purely in vacuums where religion is but a scapegoat for every suffering, excluding sociopolitical and economical prospects which reduced the Islamic world to ashes. This terribly simplistic argument 'otherizes' the other group quite successfully for it was not invasions or corruptions which created Daesh and Al-Qaeda, it was some vague monster named 'Islam', ergo Islam is intrinsically dangerous  and its followers are enablers which translates into the mind of a nationalist as 'expelling the germ to continue Western progression'.\n\n&gt;There is no stopping them (Jews) . . . . German culture has proved itself ineffective and powerless against  this foreign power. This is a fact; a brutal \\[inescapable\\] fact. State,  Church, Catholicism, Protestantism, Creed and Dogma, all are brought low  before the Jewish tribunal, that is, the irreverent daily press \\[which  the Jews control\\]. The Jews were late in their assault on Germany, but once they started there was no stopping them. Gambetta, Simon, and Crémieux were the dictators of France in 1870–1871. . . . Poor, Judaized France! In England, the Semite Disraeli \\[Prime Minister Benjamin Disraeli\\], a  German hater . . . , holds in his vest pocket the key to war and peace  in the Orient \\[the East\\].\n\nThe Victory of Judaism over Germandom by Wilhelm Marr. Sounds awfully similar to the rhetoric these critics oft give, does it not? \"The Great Replacement\". The line between religious critique and racism is of the thinnest strand. There is no doubt that Islam is primarily associated with dark skinned individuals due to the perception constructed by prominent figures and it is quite known that Sikhs fall victim to targeted violence for they are thought of as being Muslim. \n\n&gt;After the multiple jihadist terror attacks Western cities have faced to  date, it has been these same far-left and Islamist voices resisting the  call to name the ideology behind these attacks as “Islamism”, and to  distinguish it from the religion of Islam. They have taken the view that  talking about the Islamist ideology unfairly stigmatises all Muslims.  They have preferred to beseech us all to understand the grievances that  fuel the anger of jihadists, and have encouraged instead ‘hug a Muslim’  campaigns. Yet, after New Zealand, these same voices paradoxically  insist on directly addressing white nationalist ideology; they hounded a  pregnant Chelsea Clinton; they have taken to compiling blacklists of  individuals they do not like; and they are calling for the deplatforming  of “right-wing” pundits and protests against “right-wing” media.  Consistency has been sorely missing. This is dangerous, despicable and  disingenuous. Only the extremist seeks to erase all opposition. \n\nMaajid Nawaaz's understanding of religious discrimination and ideologies is quite simplistic. White nationalism differentiates from Islam, Judaism, Hinduism, Christianity in two ways: The foundational principle and the two commandments. The foundational principles of Islam are: There is One God who is merciful and forgiving and His final messenger is Muhammad. The two commandments of every religion are: follow the path to salvation/enlightenment and love thy neighbour, do unto them what you wish is done to you. White nationalism and far-right ideology is found strictly upon the principle of expelling the foreign agent which is interrupting the pure Aryan/Caucasian/Arab/Jewish/Hindu/Muslim's (etc.) progression. Nationalism is divisive and isolationist due to its essence. \n\n&gt;With a fervor for accepting a grotesque self-image of supremacy and for finding scapegoats to be blamed for subverting this greatness, Germany  turned to National Socialism in 1933. By 1936, Germany had become the  \"anti-Semitic country *par excellence*\" (Valentin 1936, 5).  Traditional Christian-based anti-Semitism combined with scientific  racism, economic woes, and political instability to set the stage for  what would eventually culminate in the Holocaust.  \n\n\"Islam is holding back the Middle East therefore it will hold back the West ergo we must expel these Muslims to progress socially and morally.\" It is quite naive to think that any and all critique of Islam, be it strictly alone of the ideology, does not have racial implications, especially when there are imperialistic and ethnocentric undertones within each criticism. Furthermore, it removes the idea of a 'liberal Muslim', creating a perceived 'inherent moral conflict' between every Muslim and the West. The far-right, due to their nationalistic foundational principle, are intrinsically discriminatory. While I do not agree with deplatforming them (there must be a form of equilibrium but it has been disturbed with nationalism on the rise), they must be argued and held accountable for inciting nationalism. The worst flaw in their arguments is that everything in relation to Islam must be absolute. 'Islam calls for this, Islam calls for that'. Islam is inherently terror in their arguments. Reformation will never come with such rhetoric, all it will do is make Muslim children feel they have no place and join Daesh and white children feel as if they are under invasion and join Neo-Nazis. In the words of Tagore, \"Nationalism is a great menace.\"", "score": 5, "send_replies": true, "subreddit": "progressive_islam", "date_year_month": "2019-03", "created_utc_converted": "2019-03-19 22:34:36", "score_overall": 7, "words": "silencing jewish holocaust scapegoat jewish jewish holocaust", "shared_words": "silencing jewish holocaust scapegoat", "socre_distint": 4}
{"author": "19T268505E4808024N", "body": "Views on race\n\n\"Oldschoolcool is usually just constant posts of mixed race couples and everyone saying wow how brave they must have been. And usually focuses on non whites from the past, didnt like it.\n\nI liked this sub because it focused and does focus on white people, who i like to see pictures of from the past.\n\nThats all.\"\n\nHolocaust denial\n\n\"BAD GOY!\n\nIt was 6 million and dont you say otherwise! Or else we will legally imprison you for your opinion on a historical event.\n\nSilly goyim...\"\n\n\n\nConspiracy including the triple parenthesis that neonazis use to mark a jewish action\n\n\"For thousands of years we did not have porn, mass media, and drugs (somewhat). And we managed quite well. I think those things, are there to control us, but I think we would not be 'bored' without them.\n\nWe were never 'bored' before this (((degeneracy))) we had families, built homes and made inventions. So, I think we would begin to wake up if we did not have these things, but definitely not through boredom cause thats a stupid idea.\"\n\nantisemetic comments\n\n\"Is hating longnose good or bad? Because i am assuming we all have one thing in common and that is Mr. Samir El Hyaid?\"\n\n\nnot even going to try to post all the pizzagater shit you post, but that is just more evidence that you are a fucking idiot. I have wasted enough of my time playing keyboard warrior so I can tell you to fuck off.", "score": 1, "send_replies": true, "subreddit": "newhampshire", "date_year_month": "2019-03", "created_utc_converted": "2019-03-20 02:04:24", "score_overall": 4, "words": "holocaust goyim conspiracy jewish", "shared_words": "holocaust goyim conspiracy jewish", "socre_distint": 4}
{"author": "sreiches", "body": "I have never, anywhere, equated criticism of Israeli with anti-semitism. Ever. My original comment was even *inviting* criticism and simply asking for that criticism to avoid anti-semitic tropes. \n\nYour argument boils down to “if I didn’t know it was anti-Semitic, I wasn’t being anti-Semitic”\n\nFucker, if you don’t know black people don’t have naturally straight hair and you comment inappropriately on it, you’re still being fucking racist. If you draw on a trope about “dual allegiance” that was literally used to justify the Spanish Inquisition, the Holocaust, the Yemeni purge of Jews, and a general wariness of Jewish people as perpetual outsiders that persists, today, in Zionist conspiracy theories, then you are being anti-Semitic.\n\nActions matter. Intentions are a luxury.\n\nCalling Israel an apartheid nation and highlighting their human rights abuses isn’t anti-Semitic, and I never said it was. Where the fuck did you get the idea that I thought differently? Did you even read my original comment? The one where I even specifically stated that I wasn’t calling anything in this article or anyone I was responding to anti-Semitic?\n\nNo. Apparently you didn’t. Because you have a LOT of assumptions.\n\nYou assume I’m a Likud supporter. I’m not and never would be. Nor any of the parties closely associated with them. \n\nYou assume I’m Israeli. I’m an American Jew and, frankly, pro-Palestinian. I know I brought up one of the tropes Ilhan Omar drew upon earlier, but (especially as a former Minnesotan) I actually really like her and support her, too. She admits when she was insensitive or wrong and learns how to stand behind her message in a way that doesn’t do collateral damage. \n\nAnd this is my big thing. Omar is not an anti-Semite, but what she said was still anti-Semitic. Just as, perhaps, Meadows isn’t a racist, but pulling in a token black woman to claim that Trump wasn’t racist because she never, personally, saw it was a racist move. As Rashida Tlaib pointed out, very effectively. \n\nSo enjoy railing against the words you put in my mouth, and have a good fucking night. ", "score": 1, "send_replies": true, "subreddit": "worldnews", "date_year_month": "2019-03", "created_utc_converted": "2019-03-21 02:22:46", "score_overall": 4, "words": "holocaust jewish conspiracy jew", "shared_words": "holocaust jewish conspiracy jew", "socre_distint": 4}
{"author": "NotaCarPart", "body": "I think there's a lot of crossover between the hatred of trust fund kids and Chinese people. My issue is that I think there is so much crossover now that it's becoming/has become a new stereotype. My partner is from a literal village in Alberta, but people presume she has a ton of money since she's at UofA. When they find out, they almost always presume that I have money - \"why else would she be with a transwoman\"?\n\nYeah, my partner's parents are pretty racist and closed minded. I don't disagree that a great many of all Asian people are especially racist against other Asians, it is a fact. The other user I'm talking with is saying they're the most racist group, though, and j do disagree with that. I think the closed-minded-ness is a result of the communism in China, and it's leeching into Canadian culture, especially on things like WeChat. Chinese culture has a long history of excluding the marginalized, but I feel like the \"us vs them\" mentality is ramping up under Uncle Xixi, and that will meet hardline against the racism towards Chinese-Canadians soon, I think.\n\nEverybody racist, and we all need to get their shit together.\n\nI think it's just an exceptional kind of racism that Alberta and BC experience in comparison to other areas in Canada from my experience. It's become less the \"oriental\" stereotype, and more this \"Chinese globalist\", conspiracy-theory-esque racism we see today. I think the latter is especially dangerous - it's always been used against Jewish people, and I don't want to see a Chinese holocaust like I've read about online. If I had to choose, I think I'd rather be seeing the \"oriental\" stereotype, y'know? ", "score": 2, "send_replies": true, "subreddit": "alberta", "date_year_month": "2019-03", "created_utc_converted": "2019-03-21 18:52:06", "score_overall": 4, "words": "globalist conspiracy jewish holocaust", "shared_words": "globalist conspiracy jewish holocaust", "socre_distint": 4}
{"author": "link11020", "body": "It's a conveinant scapegoat for neonazi jackassess to justify their hatred and dismiss their critics so they can go on believing their idiotic conspiracy theories without any critical thought whatsoever.\n\nIf a black person denounces a skinhead, \"he's just a no good _______\"\n\nIf a woman speaks out against the movement? Suddenly they switch tactics to misogeny. \"Women should know their place!\" Etc.\n\nIf they can't rely on racism or sexism to dismiss their critics, then they always have the default fallback of religion.\n\n\"This person is (Inser religion differnt from my own here) so clearly they must be wrong!\"\n\nBut, what happens when the neo-nazi skinhead has no where left to run intellectually? If a white male cristian skinhead is called out by a white male christian intellectual, he should have nothing else to guard his fragile little ego.\n\n\"You're a SECRET JEW!\"\n\nBigots are scared to look inward because they know they are monsters, so they need their victim of last resort. Unfortunatly the Jewish comunity ended up being their victims of choice.", "score": -1, "send_replies": true, "subreddit": "AskReddit", "date_year_month": "2019-03", "created_utc_converted": "2019-03-22 09:06:18", "score_overall": 4, "words": "scapegoat conspiracy jew jewish", "shared_words": "scapegoat conspiracy jew jewish", "socre_distint": 4}
{"author": "QueenMoogle", "body": "I think about this often, as the granddaughter of a Holocaust survivor. Sometimes I think it has to do with the fact that people have tried to end Jews SO many times, but Jews pull through every single time. Yeah we may lose a lot, and lose our homes, but we flee and run and rebuild time and time again. \n\n&amp;#x200B;\n\nIf you break down many of the blatantly stated reasons for Jew hatred, almost none of them make any sense. We are painted as being lazy and inferior, yet apparently we also control the world and everything in it. We are painted as money grubbing villains, yet historically Jewish populations have suffered from extreme poverty and continue to today. We are told we are outsiders, yet when the Nazi party was gaining steam Jews were trying to convert in droves, which further infuriated the Nazis. We are told it is because we are the world's scapegoats, but that is a symptom, not a cause. If someone is going to be a scapegoat, there must be preexisting hatred or distrust there. \n\n&amp;#x200B;\n\nNothing we can do will help us. Nothing we can do is ever right. Somehow, the world's evils are always our faults. Nothing about it makes sense. ", "score": 60, "send_replies": true, "subreddit": "AskReddit", "date_year_month": "2019-03", "created_utc_converted": "2019-03-22 16:27:44", "score_overall": 4, "words": "holocaust jew jewish scapegoat", "shared_words": "holocaust jew jewish scapegoat", "socre_distint": 4}
{"author": "xepa105", "body": "&gt; why do so many people think Jews are behind every bad thing that happens?\n\nIt comes from a very old \"tradition\" that can be traced all the way back to the Early Middle Ages. Basically, Jews were very spread out throughout Europe and the Middle East from Late Antiquity. And especially after the rise of Islam effectively separated the Christian and Muslim worlds, this gave Jews a certain kind of ease of movement between the two, since they had a presence on both sides and were seen as somewhat non-aligned with either side.\n\nThis flexibility was also what fostered anger since the Jew was seen as an 'other' everywhere he went, he had no place to call home, no cities or villages where they were the majority; they were always the minority. As you can guess, whenever shit went bad anywhere - be it floods, or droughts, or pestilence, or any other form of so-thought Divine retribution - the Jews were often used as a scapegoat. You know how immigrants are the go-to bad guys for populists nowadays? That was the Jew back in the past. It didn't help that the 'The Jews killed Jesus' myth was very popular back then.\n\nOftentimes this hatred would spark massive uprisings against the Jews, which led to indiscriminate violence and killings. When the Crusades were called, a lot of cities in France and Germany went crazy against their Jewish population for no other reason than being caught up in the religious fervour of the time. When the Black Death hit, and Jews were seen to be less affected by it (which might actually have been true, but only because Jews lived in isolated Ghettos, and as such could be better protected against disease) they were the ones who were targeted.\n\nThe stereotype of the money-controlling Jew - which is the most common version of the Evil Jew stereotype now - also has its roots in the Middle Ages. Slowly throughout the decades and centuries, Jews were increasingly restricted on what kind of jobs they could do, to the point where the only real profitable job was to be a merchant (dealing with money was seen in the medieval times as unclean and sinful, which meant that it was looked down upon, and therefore allowed for Jews to partake in). And remember how I mentioned there were Jews everywhere in Europe and the Middle East? Well, because of that, it was a lot easier for a Jew to go into Muslim territory, buy products there, and then resell in a Christian territory, and vice versa. This meant that, although Jews were completely disenfranchised in Christian Europe (and largely so in Muslim lands), they had access to wealth. Now imagine you're a church-going, God-fearing, tithe-paying Christian and yet the Jesus-killer Jew has more money than you? That caused a lot of tension and anger back then.\n\nThen there were the loans. Back then, the Catholic Church listed Usury as a very serious sin, meaning that good Christians should not lend money and charge interest, which was all well and good, except they did - most of the most important bankers of all time were and are Christian (the Medici, Fugger, Pazzi, etc.). There were also Jews who went into banking for the same reason, and because they could - again, dealing with money was seen as icky and beneath 'people of means'. The difference, and the reason why Jews became so strong in that sector, was that Christian bankers could - and would - often screw you over on your interest rates and repayment methods, etc. Whereas Jew could not do so, because if they tried, they would have an entire city come down and burn down their operation. So it became a well-know fact after a while that if you wanted a loan where the bank wasn't going to screw you, you went to the Jewish bank. The only drawback was the stigma of doing business with Jewish people. But as that stigma began to become less important in society, and as society became more and more reliant on loans and debt, Jewish families grew their businesses in size and importance to the point where some were some of the richest people in the world.\n\nAnd as the dominant parts of society became more and more bourgeois, bank-dependent, and as Jewish families used this and their money to establish themselves worldwide, the old prejudices and hatred evolved from Jews being the killers of Christ, the eater of babies, and the propagators of pestilence, to the Jews being the controllers of money, the puppet-masters of the world, and the propagators of war and death.\n\nThe modern conspiracies about the Jews are nothing more or less than the Anti-Semitism of the Middle Ages with a modern veneer.", "score": 17, "send_replies": true, "subreddit": "worldnews", "date_year_month": "2019-03", "created_utc_converted": "2019-03-22 20:54:28", "score_overall": 14, "words": "jew scapegoat jew jewish jew jew merchant jew jew jew jewish jewish jewish jewish", "shared_words": "jew scapegoat jewish merchant", "socre_distint": 4}
{"author": "louatsi1", "body": "What benefits do you get from being racist? I only see negatives in hating a group of people, like it takes effort and you gotta invest resources into it. I think people dont become racist because its easy and gives them stuff. At least where Im at racists are looked down upon, often face scorn by the society and are outcasts. I mean even in this thread you can tell the general sentiment towards people who express something other than \"because they are scapegoats\"/\"because people are evil they always wanna bully someone\". I am not saying that those people are racist, but the moment you spew something that could me misinterpreted as anti semitic you will get downvoted to hell online and are met with scorn in the real world. You have to go well outta your way to hate someone and stand nothing to gain from it which leads me to believe that there is something else going on with the jew haters.  \n\n\nPerhaps this is the reason why some people are hating jews right now, because they feel that they are a protected class by society, with more privileges than others. Many antisemites view the Jewish people as professional victims, and I've heard people use the following examples to illustrate this:  \n\\-One can bicker and argue about all sorts of horrific historical events and debate the number of victims, yet as we all know this is really not accepted when done about the holocaust for example. In fact it is illegal to express anything else than the 6 million jew figure in relation to the holocaust in many countries, it can get you into serious trouble in German speaking countries. The bigoted type will view this as preferential treatment toward jews and it provides a fertile ground for conspiracy theories.   \n\\-Some of the ultra conservative types I had conversations with will argue that positions of power held by jews are passed on to other jews. They are a tight nit community that will look out for one another and show other jews preferential treatments, this leads to what they call jewish nepotism. Once they have accumulated a few positions of power in a company, organization or industry their successors will usually also be jewish, leaving others feeling disenfranchised and hateful. (The people in question have shown me some evidence to back that claim, but it was too long ago and I dont care enough to do a deep dive to find this, what matters is that to the people holding these hateful views its a reality, substantiated or not)  \n\\-They heavily invest in education. Historically the jewish people have amassed a lot of books and knowledge, these were some of their most prized possessions. Since jewish families and communities place so much emphasis on constant education and intellectual advancement they tend to end up in better paying jobs with better options. This breeds resentment from others. You can take a look at the Nobel Prize laureate list and will find out that jewish people are WAY disproportionately represented here. Envy in this case leads to hate.   \n\n\nThe above points were ones that i havent seen mentioned in here yet, of course theres the whole money lending and not being allowed land dynamic which others mentioned and that historically shaped the hatred of jews. Its not surprising that people dislike paying back their creditors. Additionally, its the same as the bad rap bankers and finance people are getting nowadays people view these professions as predatory and not creating value, the inner eye sees a greedy vulture sapping every penny out of hard working laborers when one thinks of financial institutions. Financial institutions are associated with jewish influence, for historic reasons as well as the disproportionate number of jews in these professions still nowadays.   \n\n\nDont really thinks it matters, but for those of you who want to know what sorta background I come from so you understand my spin on things: German, 25-30, lived, studied and worked in many european countries &amp; upper-middle class background (lawyers, doctors and that sorta crowd of middle class).  \n", "score": 3, "send_replies": true, "subreddit": "AskReddit", "date_year_month": "2019-03", "created_utc_converted": "2019-03-22 21:46:46", "score_overall": 12, "words": "jew jewish holocaust jew holocaust conspiracy jewish jewish jewish jewish jewish jewish", "shared_words": "jew jewish holocaust conspiracy", "socre_distint": 4}
{"author": "themiddlestHaHa", "body": "“Guys, globalist doesn’t mean Jew. We’re just talking about the international Jewish banking conspiracy or the Jewish new world order. How could that ever be a dog whistle”", "score": 0, "send_replies": true, "subreddit": "WatchRedditDie", "date_year_month": "2019-03", "created_utc_converted": "2019-03-22 23:02:50", "score_overall": 5, "words": "globalist jew jewish conspiracy jewish", "shared_words": "globalist jew jewish conspiracy", "socre_distint": 4}
{"author": "kusuriurikun", "body": "The Kardashian family are awful people by all appearances, but you don't see people making up massive conspiracy theories about them regarding baby-eating, do you?\n\nIn case you're genuinely not aware: [There have been some rather nasty anti-Semitic memes for literally close to a millenium about Jewish people involved in the banking industry](https://en.wikipedia.org/wiki/Antisemitic_canard#Accusations_of_controlling_the_world_financial_system)\\--ironically, [one of the very few industries Jewish people were legally permitted to be in and even encouraged to be in during the Middle Ages and Renaissance due to prohibitions in Christianity and Islam on charging interest](https://en.wikipedia.org/wiki/Medieval_antisemitism#Restrictions_to_marginal_occupations_(tax_collecting,_moneylending,_etc.)).  Quite a lot of these involve claims that *teh j00s* are taking over the world via the banking industry for some unspecified revenge against Good Christian Folk, and [quite a lot of these have historically tied in to the original \"baby-eating\" conspiracy theory](https://en.wikipedia.org/wiki/Blood_libel) in which it was claimed *teh j00s* were, uh, drinking blood and somehow grinding up Christian babies to bake into unleavened bread.  (Yes, pretty much this was the very first version of the \"adrenochrome is made from babies\" thing.  Yes, the Adrenochrome Thing IS pretty much a modern version of the \"blood libel\", and as much as the NAR in particular tends to have a creepy level of quasi-idolatry for practically everything that's culturally Jewish they seem to have missed that QAnonsense is basically pushing a renewed blood libel with a bit of sci-fi added on.)  \n\nIn fact, the \"j00ish banker Xanatos Gambit\" conspiracy theory has had such a long run that both the phrase \"international bankers\" and the very surnames of historically Jewish families that have been involved in banking (like, oh, the Bilderbergs, and, yes, especially the Rothschilds) have in and of *themselves* become dog-whistles for the International j00ish Illuminati Conspiracy (TINIJIC).  Racists, especially when not allowed to drop the K-word outright, would very euphemistically refer to \"international bankers\" or \"the Rothschild conspiracy\" or \"the Bilderberg plot\" whatnot--pretty much everyone knew damn well they were talking about *teh j00s.*  (Again, just like racist asshats on Twitter and elsewhere like to put multiple parentheses around the names of people who are descended from Jewish families.  Nobody said racists weren't entirely lacking in invention in finding new ways to slur folks.)\n\nAnd yes, probably one of the single nastiest knock-down drag-outs I ever had with my NAR-devotee maternal unit was when I explicitly pointed out the anti-Semitic dog whistles in a TV preacher (on community cable TV station) ranting about the Rothschilds and the Bildebergs and the International Bankers...", "score": 5, "send_replies": true, "subreddit": "Qult_Headquarters", "date_year_month": "2019-03", "created_utc_converted": "2019-03-23 15:14:31", "score_overall": 13, "words": "conspiracy jewish jewish conspiracy libel jewish libel conspiracy jewish illuminati conspiracy conspiracy jewish", "shared_words": "conspiracy jewish libel illuminati", "socre_distint": 4}
{"author": "The_Bill_Brasky_", "body": "If a Jew is born in America, are they Jewish, American, or Jewish-American?  He is a German Jew.  Neither are necessarily wrong, but it's worth noting that he was born in (then) Prussia to an ethnically Jewish family, rather than a German child to a family that practiced Judaism.\n\nIt's an important distinction because, as you've suggested in your previous replies, it's not something people on the internet would admit to or acknowledge.  This is, I believe, because of his political writings and his Jewish ethnicity's (wrongful) implication that the point of his writings might be contrasted with the principle known as Cultural Marxism: that age-old excuse that every group likes to lean on before murdering or hating Jews.  Cultural Marxism asserts that Jews, given their historically significant role in financial markets in Europe and America (as well as entertainment in more modern times) is actually an effort by the diaspora to pull the strings of world leaders and exact dominance over the globe.  It also partially lends itself to the stereotype that Jews are obsessed with money, get bullied, and seek revenge in cunning or duplicitous ways.\n\nEssentially, people might look at his heritage and assign false value to the Cultural Marxism conspiracy.  And as we all know, that leads to White Supremacy or Fascism taking root in European Country X or Modern American Candidate Y.\n\nDistancing Marx from the Jewish Diaspora religiously and culturally, as he was, paints a more realistic picture of both his political theories and how difficult it may be to scapegoat Marxist lenses altogether as \"Jewish conspiracies\".", "score": 0, "send_replies": true, "subreddit": "2007scape", "date_year_month": "2019-03", "created_utc_converted": "2019-03-23 23:34:21", "score_overall": 10, "words": "jew jewish jewish jew jewish jewish conspiracy jewish scapegoat jewish", "shared_words": "jew jewish conspiracy scapegoat", "socre_distint": 4}
{"author": "foot_kisser", "body": "&gt; The problem with that logic is that the only people who are in on the 'joke' and want to do it are people who are actually white supremacists. This means if you see someone doing it, chances are that person is actually a white supremacist.\n\nThat's not true at all.  \n\n&gt; One\n\nThat's a question about IQ and race, not on the \"JQ\".  \n\nThe \"JQ\" is essentially \"Isn't there a sinister Jewish conspiracy?  And how should we solve this problem?\".  \n\nPeterson's answer pisses the white nationalists off.  He says there is no Jewish conspiracy, that instead a subset of Jews have a higher than average IQ, causing them to be disproportionally represented in positions of influence.  They want there to be an international globalist Jewish conspiracy.  He debunks them.  They don't like being debunked.  \n\n&gt; two\n\nThat's the one I remembered.  \n\n&gt; three\n\nHave you taken a look at this guy's youtube channel?  He's not a fan of Peterson.  He is a fan of Hitler and interested in UFOs, from the titles of his videos.  \n\nHe has 4 videos on Peterson, this one, part one and two of a longer version of this one, and one titled \"The Occidental Observer Challenges Jordan Peterson for Selling Out\".  The title of this one includes the word \"confronted\", and has an unflattering thumbnail.  \n\nIn contrast, he has 24 videos on Hitler, most with complimentary titles, the word Jew shows up 11 times, including another time he confronted a different professor with the \"Jewish question\", and the word UFO shows up 32 times.  \n\n&gt; four\n\nIt's interesting that you'd link this one instead of to the Q&amp;A video from his channel.  \n\nThis one has subtitles *mocking Peterson* for disagreeing with the white nationalist position.  \n\nI suspect the motive for asking the question was to make videos like this, so I'm not convinced the question was asked by a fan instead of an opponent, but since it was asked on his Patreon Q&amp;A, I'll go ahead and give you credit for this one too.  \n\nSo that brings up the total number of times he was asked this question by people who could arguably be called his fans to two.  You're ignoring the fact that his answer doesn't make them happy, BTW.  \n\n&gt; It is literally the first link on google when you google his name and the words jewish question.\n\nYou told me it was a section on his website.  There is no section, just one page, thoroughly debunking the JQ.  \n\n&gt; Yet you claim that white supremacists don't like him. So strange.\n\nI don't usually like to link to alt-right stuff, since I don't want to point people in the wrong direction, but since you're almost certainly going to be the only one to look at this, I'll make an exception.  \n\n[Here's one of (if not the) most popular alt-right youtube channels](https://www.youtube.com/watch?v=mc3o4YmHJbc) reacting to Peterson getting asked the \"JQ\".  \n\n&gt; the exact sort of thing you don't want to be on the same page as nazis.\n\nHe's not only not on the same page as nazis, he's in complete opposition to them.  He went out of his way to teach his students how to avoid exactly that.  \n\nThe closest thing you have to evidence is that he was asked a question where his answer debunks them totally, and they disliked him as a consequence.  \n\n&gt; You literally waved away a guy giving a nazi salute as 'just a white nationalist'\n\nYou're literally misrepresenting me here.  \n\n&gt; Actually he says plenty of racist stuff (Mostly debunked 'science' on race and IQ),\n\nReally?  You think talking about facts is somehow racist?  \n\nCome on.  \n\nAnd how would you answer the \"JQ\" then?  It's a fact that Jews are and have been overrepresented in various positions of power.  If you take away the IQ explanation, what's left?  Do you have an alternate explanation, one that could persuade people considering becoming white nationalists not to believe in the \"Jewish conspiracy\"?  \n\nIf you just stick your head in the sand and hide from the question, it makes the conspiracy theory look plausible.  \n\n&gt; You either don't know a fairly basic term in political discussions or you're playing dumb.\n\nNo, you weren't being clear.  \"Demographics\" doesn't tell me which demographic you're talking about.  ", "score": 0, "send_replies": true, "subreddit": "changemyview", "date_year_month": "2019-03", "created_utc_converted": "2019-03-24 18:38:24", "score_overall": 13, "words": "jewish conspiracy jewish conspiracy globalist jewish conspiracy jew jewish jewish jewish conspiracy conspiracy", "shared_words": "jewish conspiracy globalist jew", "socre_distint": 4}
{"author": "SingleSliceCheese", "body": "THIS for real.  \n\n\nAlex Jones started to uncover some uncomfortable things for the powerful when he filmed inside the Bohemian Grove Society.\n\n&amp;#x200B;\n\n[https://www.youtube.com/watch?v=FpKdSvwYsrE](https://www.youtube.com/watch?v=FpKdSvwYsrE)\n\n  \nPossibly his early stuff was his only legitimate stuff. He keeps just a LITTLE real and truthful stuff on infowars as a way to hook people in. Just a few CIA operations that really turn out to be true, a few photographs that are real and hard to explain. Just enough that a new comer can see and say \"ok that's real / plausible\" or a true believer can start a new person on.\n\n&amp;#x200B;\n\nThen the rest of it is straight off the deep end. And for a while, it wasn't geared towards one political party. It was \"anti globalist\" but it wasn't explicitly anti jewish. It was \"aliens are out there\" but not explicitly \"Hillary and Obama are shape shifting reptile overlords\" - He used to criticize David Icke for his crazy lizard people stuff. (David Icke als had JUST ENOUGH real conspiracy to pull people in)\n\n  \nThen at some point, it went full blown insane. I don't know if he just found that one niche was easier to exploit, that people coming to his conspiracy site were naturally forming anti Democrat, anti Jew, anti Progressive rhetoric? Or he started framing the narrative that way?  \n\n\nBut I think he went beyond just \"presenting a view point\" or \"pointing out possible conspiracies\" at a certain point. The idea that he's \"controlled opposition\" is honestly not that crazy. If he uncovered something that actual powerful people really didn't want, they could offer him a huge sum of money and an increased platform to push a narrative and leave theirs alone.  \n\n\nEither he found a niche and exploited it hard, and is purely profiting off the naivity of others, or he's gone COMPLETELY off the deep end, or honestly, he's controlled opposition. He's working for someone, they intend for him to throw out mostly bullshit, but just enough truth, so when he says something truthful it can be dismissed as conspiracy, and keep one niche market completely tied up and hanging on his every comment.\n\n  \nI mean, the guy went from \"The Bohemian Grove are a bunch of rich ass holes and republicans plotting how to control the governments and corporations of the world\" to \"Donald Trump is the only savior and Obama is a lizard person\"", "score": 2, "send_replies": true, "subreddit": "PublicFreakout", "date_year_month": "2019-03", "created_utc_converted": "2019-03-24 20:42:24", "score_overall": 6, "words": "globalist jewish conspiracy conspiracy jew conspiracy", "shared_words": "globalist jewish conspiracy jew", "socre_distint": 4}
{"author": "WickedMainah", "body": "I am currently VVLC with my uBPD mom. I've had a few NC periods since I was 17 that were 5 or 6 years each. My mom was/is an alcoholic though the severity of drinking and blackouts has decreased with her age. I suffered from neglect mostly, as well as being the golden child or scapegoat depending on which side of her splitting I fell on that week as I was an only child. Parents divorced when I was 10 or 11. \n\nI began serious therapy about 15 years ago and now have successful boundaries enough to have a VVLC relationship. She has never mentioned anything about my upbringing or periods of separation. If we try to move closer, her shitty behaviors show and I have to pull away. So VVLC is probably going to be it. She went \"born again\" about a decade ago so she no longer celebrates birthdays or holidays which helps. I last visited her 4 years ago and stayed at her house. Our interactions were mostly fine, but I won't visit again until I can afford a hotel and a rental car because she.... insists on having a bunk bed for guests... and just want to do my own things if Im on vacation. \n\nWe talk on the phone maybe twice a year. Its always surface topics. Gardening, the weather, our pets, that's it. We avoid politics because she has taken an extreme alt right view, even conspiracy level stuff like the Illuminati, bohenian grove, and chem trails. She takes colloidal silver and is a full blown prepper. She believes the apocalypse is near, but doesn't believe in climate change, but also says god will fix it. She has legally changed her name 3 times avoiding legal repercussions for 2 drunk driving accidents 20 years ago, and has changed it again to a Hebrew name because her latest adventures in being born again makes her part of the hidden secret lost 13th tribe. She tries to tell me we are really Jewish. Not that there is anything wrong with that, but we are most definitely not. She is desperately looking to belong and be special. \n\nSo its exhausting being anything more than VVLC. ", "score": 9, "send_replies": true, "subreddit": "raisedbyborderlines", "date_year_month": "2019-03", "created_utc_converted": "2019-03-25 12:18:05", "score_overall": 4, "words": "scapegoat conspiracy illuminati jewish", "shared_words": "scapegoat conspiracy illuminati jewish", "socre_distint": 4}
{"author": "ChillandBreath", "body": "&gt; Wouldn’t be surprised at these attacks if I were an Israeli.\n\nJew hater's always think anything tangentially related to sympathizing with the Jewish plight is a conspiracy.\n\n&gt; Stop occupying other people’s countries\n\nPalestinians came [from](https://www.youtube.com/watch?v=XwBSWN4s9JU) Egypt and the deserts of Saudi Arabia as COLONISTS. Jewish Israelite's are indigenous to Israel.\n\n&gt; being an apartheid state\n\nUnder SA apartheid or Jim Crow: blacks had no voice in government or in the courts; they couldn't be part of mainstream society in politics, professions, the army or police.\n\nIn Israel: Arabs vote, work in any profession anywhere, including the army or the police, as lawyers and judges; non-Jewish judges were in the courts that sent a former president of Israel and a former prime minister to prison in Israel! Arabs serve in the Israeli parliament, the Knesset. Arabs can visit any park, beach or public facility. They can buy property almost anywhere if they chose to do so. Visit Israeli hospitals and you'll see Arab and Jewish doctors and nurses working side by side, on Arab and Jewish patients in the same wards and rooms.\n\nThe official language of Israel is Hebrew… and Arabic. All the street signs are in Hebrew, Arabic and English.\n\nWhere does the apartheid \"second class citizen\" myth come from? From the same source that the medieval blood libel against Jews came from: ignorance, prejudice, jealousy, pre-conceived stereotypical racist stigma, and from political or religious indoctrination that give an excuse to hate Jews.\n\n[90](http://www.pewresearch.org/fact-tank/2017/08/09/muslims-and-islam-key-findings-in-the-u-s-and-around-the-world/)% of Palestinians support sharia law, highest in the middle east, according to PEW polls, so by default, that would be an Islamic state. That is the opposite of secular and there is no proof that they would be turning any future into non-racist progressiveland that you want.\n\n&gt; Israeli terrorists gangs like the Stern Gang and the Irgun existed long before Hamas did.\n\nMenachem Begin was an absolute hero. Irgun never carried out attacks except as retribution, either for turning away ships full of Jewish refugees (back to Germany!) or for the countless times British police handed Jews over to Arab mobs to be torn apart, or that they chose simply not to prosecute Arab murders of Jews. Begin was a legend, as was Stern.", "score": 0, "send_replies": true, "subreddit": "ukpolitics", "date_year_month": "2019-03", "created_utc_converted": "2019-03-25 15:49:11", "score_overall": 9, "words": "jew jewish conspiracy jewish jewish jewish jewish libel jewish", "shared_words": "jew jewish conspiracy libel", "socre_distint": 4}
{"author": "send_nasty_stuff", "body": "I can get you started.\n\n  /r/911truth and r/holocaust has source driven stuff.  The ron unz site is good.\n\nStarter, source driven, articles.\n\nhttps://www.unz.com/runz/our-american-pravda/\n\nhttp://www.unz.com/runz/american-pravda-holocaust-denial/\n\nhttp://www.unz.com/runz/american-pravda-911-conspiracy-theories/\n\n*Source* driven full texts.\n\nJews and sexual 'freedom' agenda\n\nhttp://www.culturewars.com/CultureWars/1999/libido_ad.html\n\nJews as revolutionaries and subversionaries through history all the way up to the neo con movement.\n\nhttp://www.culturewars.com/Reviews/RevolutionaryReviews.html\n\nhttps://www.bookdepository.com/Culture-Critique-Kevin-Macdonald/9780759672222\n\nIf you don't have the time to read 800 and 1200 page books here are two documentaries.\n\nhttps://www.youtube.com/watch?v=eCkc-ZF_TSY\n\nhttps://www.youtube.com/watch?v=NiGYtQ1EWZw\n\nthis doc covers lots of the issues brought up in op's post but doesn't have a book associated with it.\n\n**https://www.youtube.com/watch?v=NJl0bH8ey-M**\n\nThe late Emeritus Professor Dr. Tony Martin covers jews and the slave trade. WITH SOURCES\n\nhttps://www.amazon.com/Jewish-Onslaught-Despatches-Wellesley-Battlefront/dp/0912469307\n\nHere's a shorter read on jews and the slave trade.\n\nhttps://wethoughttheywerewhite.tumblr.com/WhoAreTheJews\n\nThose sources should cover 90% of /u/translate4mepls post.  Please let me know if you have questions.\n\nand if you need jews and bolshevism the Juri Lina books and documentaries are good and of course Solzenitzyn. \n\nedit.  if you are VERY short on time this is a compact documentary (20 minutes) yet still data/source driven.\n\nhttps://www.youtube.com/watch?v=ljMPafQpfDU\n\nedit 2.  sorry I left out more specific israel lobbying books.\n\nhttps://www.amazon.com/Big-Israel-Israels-Lobby-America/dp/0982775717\n\nhttps://www.amazon.com/Israel-Lobby-U-S-Foreign-Policy/dp/0374531501/ref=pd_lpo_sbs_14_t_0?_encoding=UTF8&amp;psc=1&amp;refRID=2AP6DCM7502FT8F0FNZZ\n\nhttps://www.amazon.com/Where-Right-Went-Wrong-Neoconservatives-ebook/dp/B003J56502/ref=sr_1_1?keywords=neo+conservatives+pat+buchanene&amp;qid=1553479646&amp;s=books&amp;sr=1-1-spell\n\n**Need more sources?**\n\nhttps://imgur.com/a/RI1lA1j\n\nhttps://imgur.com/a/IOSTDYs\n\nhttps://imgur.com/a/rMMHiQv\n\nhttps://imgur.com/a/mx4KK9X\n\nhttps://imgur.com/a/oxPYWCc\n\nhttps://imgur.com/a/sBtcAEh\n\nhttps://imgur.com/a/XPosuJ6\n\nhttps://www.youtube.com/watch?v=NJl0bH8ey-M\n\nAlso read the Hooton Plan and Kalergi plan.  Here are two funny animations about this topic as well.\n\nhttps://www.youtube.com/watch?v=lKDeyuM0-Og\n\nhttps://www.youtube.com/watch?v=faNge-o0V-k\n\n**need more?**\n\nQuick history on the last 200 years of jews.\n\nhttps://www.reddit.com/r/DebateAltRight/comments/a8u6rp/the_cuck_and_based_map_of_white_countries/eced3ar/\n\nSmall collection of jpgs on the jews\n\nhttps://old.reddit.com/r/conspiracy/comments/a9qw2y/the_rothschilds_started_the_civil_war/ecln6kd/?context=3\n\nThread on Study resources\n\nhttps://www.reddit.com/r/DebateAltRight/comments/a56b51/jewish_study_resources/\n\nStep by step guide on Jews\n\nhttps://www.reddit.com/r/DebateAltRight/comments/a13foq/how_to_explain_the_jq_in_a_simple_stepbystep_guide/eamjm9n/\n\nJews and Communism\n\nhttps://www.reddit.com/r/DebateAltRight/comments/a1bf7q/debunking_jewish_communism/eaodfbt/\n\nWhy the JQ is important to white identitarianism movements\n\nhttps://www.reddit.com/r/DebateAltRight/comments/9wxv0m/what_is_the_specific_importance_of_the_jq/e9o46qe/\n\nJews and Pedophillia\n\nhttps://www.reddit.com/r/DebateAltRight/comments/9t18cm/ok_im_sold_now_what/e8vtgmp/\n\nThe JQ simplified in plain language.\n\nhttps://www.reddit.com/r/SubOfPeace/comments/9n7iin/2_am_schitzopost/e7krwez/\n\nThread on THE Epic Unz Article\n\nhttps://www.reddit.com/r/DebateAltRight/comments/9bi1rv/the_holocaust_did_not_happen/\n\nJew in their own words\n\nhttps://www.reddit.com/r/DebateAltRight/comments/93gzrj/can_anybody_here_just_admit_that_the_jq_is_dumb/e3d92gg/\n\nA redpill story and some JQ info from /u/certifiedrabbi\n\nhttps://www.reddit.com/r/DebateAltRight/comments/8szqmz/is_the_altright_environmentalistwhat_altrights/e14rdzd/\n\nJews vs the Parsi\n\nhttps://www.reddit.com/r/DebateAltRight/comments/91cejs/the_reason_you_fight_for_an_open_society_is/e2xqyvz/\n\nJewish Tricks: driving cognitive overload to overwhelm enemies\n\nhttps://www.reddit.com/r/DebateAltRight/comments/8zmix9/cognitive_load_is_the_driver_of_pilpul_and/\n\nExample of how jews first stigmatize, isolate and destroy enemies.\n\nhttps://www.reddit.com/r/politics/comments/8xbmrs/the_social_shaming_of_racists_is_working/e22bb07/\n\nExamples of jewish subversion in the west\n\nhttps://www.reddit.com/r/DebateAltRight/comments/8wisse/frequently_among_the_altright_i_see_posts_talking/e1vuaif/\n\nUnderstanding Jewish motives\n\nhttps://www.reddit.com/r/DebateAltRight/comments/8o4fmt/what_are_some_altright_beliefs_you_dont_100_agree/e00p9fx/\n\nUnderstanding why whites ignore the JQ\n\nhttps://www.reddit.com/r/DebateAltRight/comments/8o4fmt/what_are_some_altright_beliefs_you_dont_100_agree/e0125ba/\n\nDo jews really want to genocide whites?\n\nhttps://www.reddit.com/r/DebateAltRight/comments/8jfaao/i_need_some_clarification_on_white_genocide/dyzei69/\n\nData on broken social cohesion\n\nhttps://www.reddit.com/r/DebateAltRight/comments/8jee6p/does_the_altright_want_nonwhite_americans_to_leave/dyzflru/", "score": 2, "send_replies": true, "subreddit": "israelexposed", "date_year_month": "2019-03", "created_utc_converted": "2019-03-27 13:26:16", "score_overall": 9, "words": "holocaust holocaust conspiracy jewish conspiracy jew jewish jewish jewish", "shared_words": "holocaust conspiracy jewish jew", "socre_distint": 4}
{"author": "DeathToPennies", "body": "By normalizing and de-stigmatizing the idea that Hitler wasn’t that bad, you can simultaneously proceed to paint the nazi regime in increasingly more favorable lights (“they were brilliant engineers” -&gt; “holocaust death counts are exaggerated” -&gt; “Jewish globalist conspiracy”), and paint people poised against white supremacy as overly-concerned moralizers. ", "score": -19, "send_replies": true, "subreddit": "fakehistoryporn", "date_year_month": "2019-03", "created_utc_converted": "2019-03-27 15:06:00", "score_overall": 4, "words": "holocaust jewish globalist conspiracy", "shared_words": "holocaust jewish globalist conspiracy", "socre_distint": 4}
{"author": "Psyentific", "body": "&gt; Who said anything about the Jews?\n\n\"The Globalists\" are a common dogwhistle for \"The Jews\", in the context of \"global jewish conspiracy\", of the same sort as using (((Triple Brackets))) to subtly signal (to those who know the code) that this person is a Jew. Here's [a few](https://www.washingtonpost.com/outlook/2018/10/24/conspiracy-theories-about-soros-arent-just-false-theyre-anti-semitic/?utm_term=.386d6a6f28f3) articles [from](https://www.vox.com/policy-and-politics/2018/3/8/17096876/globalists-explained) some [cursory googling](https://www.haaretz.com/us-news/.premium-how-did-the-term-globalist-became-an-anti-semitic-slur-blame-bannon-1.5895925)", "score": 7, "send_replies": true, "subreddit": "CanadaPolitics", "date_year_month": "2019-03", "created_utc_converted": "2019-03-27 20:18:33", "score_overall": 5, "words": "jewish conspiracy jew conspiracy globalist", "shared_words": "jewish conspiracy jew globalist", "socre_distint": 4}
{"author": "ST616", "body": "No it doesn't.\n\n&gt;Walker says “Is Tania seriously suggesting Jews are marginalised… all data points to the opposite” and “at the moment Jews as a group are not marginalised” – denying the prejudice Jewish people face at a time when antisemitism is on the rise in the UK and across many countries.\n\nPrejudice, hatred, and discrimination are often accompanied by marginalisation. But not always. To say that there is rising prejudice, hatred, and discrimination doesn't prove that there is also marginalisation.\n\n&gt;Walker posted on Facebook criticising Momentum for campaigning against Gilad Atzmon, choosing to attack Atzmon’s critics rather than him and suggesting challenging Atzmon’s vile rhetoric should not be a priority. Atzmon is widely thought to have supported Holocaust denial.\n\nShe isn't supporting Atzmon. She's questioning why Momentum are focusing on him when there are other issues that are more important than an relatively obscure musician with antisemitic views.\n\n&gt;Walker shared a list of Jewish people accused of antisemitism, saying she’s proud to be among them. Some of those listed are highly respected Jewish people, who are clearly not antisemitic. But the second person listed, whose name is displayed prominently, is Miko Peled.\n\nPure guilt by association stuff.\n\n&gt;On Corbyn's comments about pockets of antisemitism within Labour and his much needed apology for his FB mural comments, Walker says “I think Jeremy’s formulation was unfortunate”, downplaying antisemitism problem and criticising Jeremy for recognising and taking it seriously\n\nIt was unfornate that Jeremy caved into pressure to pretend there is a widespread problem with antisemitism.\n\n&gt;Walker posts regularly about Jon Lansman, painting him as a sinister cheerleader for Israel just because he’s Jewish and has visited Israel and Palestine. As it happens he’s a vocal opponent of Israel's policies &amp; in favour of a free Palestine, as is Momentum e.g. on social media\n\nPure libel. Walker's criticism of Lansman has nothing whatsoever to do with him being Jewish. She's Jewish herself and works with other Jewish activists.\n\nCriticising him for visiting Israel is perfectly legitimate. It's wrong to ignore the calls by Palestinians to boycott Apartheid Israel, just as it was wrong to ignore the calls by black South Africans to boycott Apartheid South Africa.\n\nI'm sure he's criticised some aspects of Israeli policy. Doesn't make him not pro-Israel though. His efforts to persuade the NEC to adopt the bullshit IHRA definition prove he is no supporter of a free Palestine.\n\n&gt;Her posts often imply he’s pulling the strings behind Labour’s disciplinary procedures, but he doesn’t oversee them &amp; is one of 30+ members of the NEC. ‘Labour friends of Lansman’ refers to ‘Labour friends of Israel’. Doubt she would have said the same about a non-Jewish person\n\nHe doesn't oversee them, but pretending his control over Momentum doesn't give him an enormous amount of influence is dishonest. The right wingers of the NEC are always going to support expelling left wingers, if the head of Momentum supported those left wingers, the right could be outvoted.\n\n&gt;In another example of Walker dangerously conflating Jewish people and Zionism/Israel, she shares an article about “pressure from Jews” rather than pro-Israel activists.\n\nA completely dishonest account of what the attached picture shows.\n\n1) She isn't sharing an article, she's sharing somebody else's comment about that article.\n\n2) The comment explicity says the pressure came mainly from Christian Zionists not from Jews.\n\n3) The article is from Forward, an American mainstream Jewish publication founded in 1897. Implying that Forward is antisemitic is bizare.\n\n&gt;Walker also shared a bizarre post about the controversy over the appalling comments Jared O’Mara made online when he was younger being a Zionist plot, even though Jared admitted these were disgraceful and sincerely apologised. This is a totally unfounded conspiracy theory.\n\nSaying that someone may have searched through O'Mara's old social media to find things to discredit him for political reasons doesn't mean the comments weren't disgraceful.\n\nAnd it has nothing to do with antisemitism. She didn't claim it had anything to do with Jews.\n\n&gt;And, of course, Walked defended Ken Livingstone’s comments about Hitler and Nazis, which if you ask me is enough reason to get the boot 🤢🤢🤢\n\nThe Zionist Organisation of Germany made a deal with Hitler. That's historical fact.\n\n", "score": 2, "send_replies": true, "subreddit": "Labour", "date_year_month": "2019-03", "created_utc_converted": "2019-03-27 22:38:57", "score_overall": 13, "words": "jewish holocaust jewish jewish jewish libel jewish jewish jewish jewish jewish jewish conspiracy", "shared_words": "jewish holocaust libel conspiracy", "socre_distint": 4}
{"author": "Us3rn4m34lr34dyT4k3n", "body": "First Part:\n\n&gt;Really. Can you just decide to hold a different opinion in the next minute and believe it? No. You can’t force a new perspective on yourself. You must be convinced of it.\n\nYes and as I set the standard for what convinces me, I am the person to decide what opinions I hold, drop, keep or whatever...\n\n&gt;Accuse someone of holding a position they don’t hold and refuse to substantiate the claim when called out. Such integrity and intellectual honesty.\n\nDude with all due respect that thread is getting really long and if you keep responding to the first comment instead of the one where I made a claim it becomes even more annoying to look it up. So if you don't care enough to provide the least bit of context I don't care enough to look it up. Deal with it or change your behavior...\n\n&gt;At this point I think it would be more useful to get you to be specific. Please give me specific examples of speech that you would deem a violation of a “right not to be verbally abused” which is not already illegal. There’s a lot of vague talk about power dynamics, certain contexts in which expressing opinions is authoritarian, opinions you view as facts, etc and I’d like to see specifics.\n\nThe most obvious would be slurs and insults and furthermore the stuff that falls under libel, slander and harassment. The latter should already be illegal and the former might be subsumed under the latter, I'm not a lawyer. But as far as I know the legal definitions for these terms are so strict that they barely apply to anything. Could you give an example that what we defined so far as harassment is actually covered under harassment? Also the vagueness is kind of deliberate, I do not intend to compile a blacklist of words and concepts that are taboo as I don't think that is a good approach. That being said the concept of power dynamics and \"expressions of opinions\" that are authoritarian or opinions being used as facts isn't vague and we've discussed plenty of examples for these so far, so I'm not really getting your point here.\n\nSecond Part:\n\n&gt;Remind me, which side is for small government and which side is for increasing government control?\n\nAnd have you ever asked yourself **why** they are for a \"small government\" and what that actually means? Because if you take a closer look this \"small government\" essentially means that wealthy business people are \"free\" to not give a fuck about the negative [externalities](https://en.wikipedia.org/wiki/Externality), because they are no longer obligated to get through the democratic process on topics that involve the general public. That's actually an authoritarian move because it shifts power over people from the deluded state of a democracy to the uncontrolled tyranny of a wealthy minority. I never understood why people cheer for giving up **their** control over politics. Seriously unless you get rid of the underlying power dynamic, getting rid of the government only means that a shadow government will emerge over which you have no control at all... Congratulation, you played yourself if you honestly believe in that fairy tale...\n\n&gt;Is this you suggesting that Soviet Russia, Maoist China, and the Khmer Rouge weren’t left wing?\n\nFirst of all, in order to make things clear: Those are just definitions and they aren't my definition, that is apparently how social science and politics, group the left-right spectrum. \nSo the aforementioned dictatorships were at least in rhetoric and projected goals \"left wing\" as their preferred system was one of no social hierarchies (neither politically nor economically) however it should be controversial to see that the actual system they brought about was really nothing like that. The party hierarchy is rather a caste system and so it's rather a right wing government. Whereas some of the stuff that you probably think of as \"right wing\" might actually be left wing in that framework. What makes the conservative worldview right wing is rather it's defense and support for social stratification, leading in it's extremes to social darwinism. Again at the end of the day those are only names the question is not whether you group yourself in the loaded terms of left and right but whether or not you are in support of social hierarchies or not. \n\n&gt;Then check it.\n\nAre you referring to this:\n&gt;And here's a ton of lawyers on this point: https://www.avvo.com/legal-answers/is-accusing-someone-of-being-a-racist-defamation-p-1055687.html\n\nThose are 6 answers but you're talking about 55 lawyers, so I'm a little confused...\n\n&gt;How does this rebuff my point at all?\n\nThe fact that there is a difference in being able to broadcast your opinion is relevant to the point that \"nobody can be silenced\". Because you can practically silence people without actually banning their speech. I mean that McDonald's hot coffee incident is a good example where that woman suffered 3rd degree burns and it apparently was legit McD's fault, but where the media representation was that the woman was too stupid to drink her coffee or to realize that coffee is served hot. So effectively her opinion was silenced due to the fact that it didn't got the attention that the opposing opinion got. And while that is not the definition of silencing it has effectively the same effect. And no I'm not proposing legal ways to change that I'm just making sure that you are aware of those shortcomings.\n\n&gt;See first section.\n\nFirst section of what?\n\n&gt;Not only see first section, but really? So that happening in San Francisco is totally cool, but if it happens somewhere in Alabama then it’s a problem?\n\nDon't get me wrong, you're a piece of shit regardless where you say that, but it makes a difference to know that a random stranger is an asshole and that when push comes to shove the people around you will side with the person being harassed over the harasser or whether it's literally the other way around and people will protect the bully over a person offending him by just being themselves not even engaging with him in any way...\n\n&gt;At no point do I argue this.\n\nThen what point did you try to make arguing about \"underlying statistics\"? \n\n&gt;Most people for most of history were dirt poor subsistence farmers.. \n\nAs far as I remember you're claim was that of below average immigration due to lax or missing restricting factors and now you argue that they were mostly average?\n\n&gt;What is?\n\nThe idea that before 1924 immigrants would fall into that category:\n\"any convict, lunatic, idiot, or person unable to take care of him or herself\" \njust because they technically could. \n\n&gt;Jews.. they were prohibited from voting, prejudice in the form of stereotyping Jews as swindlers, blood libelers, part of an international Jewish conspiracy, targeted by the KKK, smeared with responsibility for the emergence of communism during red scares, etc etc.\n\n&gt;Asians.. died working on railroads in dangerous conditions and poor pay, while other workers rioted against them and drove them out of towns, confined to Chinatowns which didn’t get police protection, not granted voting rights, not granted the right to purchase property, forced deportations, internment, etc etc.\n\n&gt;Irish.. religious persecution, died working railroads in brutal conditions, assumed to be violent drunks, forbade from entering establishments “no Irish, no blacks, no dogs”, forbade from being employed “no Irish need apply”, claims of being an inferior race, etc etc.\n\n&gt;Blacks obviously. The list goes on. History is a nasty place.\n\nYes, history is a nasty place but that didn't really answer my questions you made claims about success being connected to culture, which kinda perpetuates inferiority claims. So the question how long that bullshit persistent how rigorous it was applied and when it was finally dropped is kind of important. Also my intent is not to rank oppression in any way shape or form, my point is just that you're making a claim that perpetuates racist stereotypes and I'm not ok with that.\n\n&gt;Making positive progress in terms of income, employment, wealth, etc. to get them to where they are today, despite the discrimination.\n\nhttps://en.wikipedia.org/wiki/Model_minority#Possible_causes_of_model_minority_status\n\n&gt;Social behavior and norms. A culture that values education, hard work, and rule of law is infinitely more likely to succeed than one that does not value those things.\n\nWhere do you got that bullshit from? I mean education is fairly important as knowledge is power that way or another, but \"hard work\" is a \"subjective\" description. I mean slaves both in the historic and modern context can work really hard without having any benefit from that.\nAlso see the link about model minorities...\n\n&gt;Racists see color and judge. They don’t get into a nuanced discussion of what it means to be in a racial category. So if racism against black people is a widespread issue in the US, then why wouldn’t it act on black immigrants?\n\nDon't oversimplify things here, who can distinguish between \"White\", \"Irish\" and \"Jews\" not must be pretty \"sophisticated\" in his bullshit. That isn't a natural reaction that is trained behavior. And again that can be rooted in vetting procedures letting only high skilled people into the country, as well as structural racism that simply creates worse starting conditions. \n\n&gt;No.. because the people are in the same environment….. how can the environment be the distinguishing factor when it’s a shared factor? Are you saying black immigrants don’t experience racism in the US?\n\nIt's a shared factor after immigration. Up to that point you have different environments. Or are you talking about 2-3rd generation immigrants? Also do you have a control group to say that they aren't doing worse, than what they could? \n\n&gt;The sentencing isn’t the same.\n\nYeah, but **WHY**? I mean one explanation is that powder cocaine is a drug for the wealthy, whereas crack has a cheap image and that the difference in sentencing is a racist discrimination.", "score": 1, "send_replies": true, "subreddit": "changemyview", "date_year_month": "2019-03", "created_utc_converted": "2019-03-28 02:20:07", "score_overall": 4, "words": "libel silencing jewish conspiracy", "shared_words": "libel silencing jewish conspiracy", "socre_distint": 4}
{"author": "NorGu5", "body": "\"the pagans knew the Earth was flat.\"\nI think most people knew that a couple thausands year back.\"\n\n\"You LARP a fictitious understanding of paganism.\"\nExcactly like you LARP a fivtious understanding of the fictinary Jew Jesus Christs teachings. I don't recall the bible being a full of hatered and conspiracy theories and in fact I remember some parts about love, and nothing at all about stuffing kids and women in gas Chambers. Oh that's right, you probably think the holocaust is a jewish conspiracy top, stupid me. \n\nThe way you type I am going to have to assume your mind is corrupted deeply. Forget about getting help but just getting a job or some sunlight on your skin would probably be a good idea. I promise you won't turn into an african person, 100%!\n", "score": 1, "send_replies": true, "subreddit": "Jordan_Peterson_Memes", "date_year_month": "2019-03", "created_utc_converted": "2019-03-28 05:34:07", "score_overall": 5, "words": "jew conspiracy holocaust jewish conspiracy", "shared_words": "jew conspiracy holocaust jewish", "socre_distint": 4}
{"author": "vzenov", "body": "Bullshit.\n\nThe US has not been an ally until around 1967-1973. The shift came in late 70s after oil-producing gulf countries had to be controlled once dollar went off gold in 1971. The attack on USS Liberty was not an act by an ally.   It is after US dollar becomes the only currency for trading oil and the reinvestment of oil profits from the Gulf becomes an issue that having Israel as a chained dog in the region really pays off.\n\nThe influence Jews had in opinion-shaping sectors of the economy like press, publishing, entertainment and academia has played a major role. The reason why there's so much screeching about \"anti-semitism\" and \"conspiracy theories\" is because it is a fact.  Not only it is a fact, there are direct connections between Israeli government and special services (in Israel there's no separation between intelligence and army and government it's a Soviet-style pseudo-democracy) and Jewish organizations in the US and US government (primarily in the Republican party after Reagan) promoting a specific narrative. The ideas of \"new anti-semitism\" begin in America in 1970s but it really takes off after 1982 when Israel invades Lebanon and war crimes happen.\n\nThose people helped to sell the \"religious reasons\"  to dumb Americans as means of making the justification less dependent on objective factors.  Make it about religion and no amount of human rights and international law violations by Israel can change your mind. But they were even more instrumental in silencing criticism from the left by creating a narrative about the holocaust and the creation of state of Israel which is contrary to historical fact.  Critics call it the \"holocaust industry\" - a phrase coined by Jewish scholar Norman Finkelstein.  It was so efficient that only the most hardcore leftists like Finkelstein or Chomsky and the people who listen to them  resisted it.\n\nThe expansion of Israeli arms industry which is funded supported and aided by the US is the result and not the cause of US-Israeli relationship. America doesn't need Israeli weapons because Israel buys US weapons with US aid. America makes Israel dependent so it plays by American rules and then Israel retaliates by using all resources at its disposal to make sure US plays by Israeli rules.\n\nThe result is that US energy companies get their oil, US banking gets their money, US defense industry get their sales and right-wing Zionists get their Greater Israel For Jews Only. Isn't it great?\n\nAnd anyone who talks about it is an anti-semite, a Holocaust denier and a conspiracy theorist who wants to see all Jews murdered.\n", "score": -1, "send_replies": true, "subreddit": "worldnews", "date_year_month": "2019-03", "created_utc_converted": "2019-03-28 14:09:53", "score_overall": 8, "words": "conspiracy jewish silencing holocaust holocaust jewish holocaust conspiracy", "shared_words": "conspiracy jewish silencing holocaust", "socre_distint": 4}
{"author": "RighteousKill66", "body": "Thank you in advance for answering my questions. \n\nBut I must begin by saying that I feel that Jews in general don't receive criticism very well. Any comment that vaguely contains a critique of a Jewish person is often called anti-Semitic without any attention to the validity of the claim. If someone criticises the Catholic Church for their problem of priests molesting children, such a critique is not inherently anti-Catholic. Often in the media, any political or academic figure that even questions Israel is slandered as an anti-semite and has their careers ruined. And laws are often put in place that put people in jail for any criticism of Jews. Many European countries put people in jail for simply doubting the exact number of Jews that died during the Holocaust. \n\nThe detriment that Jews have been to their host society and the unpleasant things that I've heard about them can both be grouped together under rumors, but I'm hoping that you can dispel these rumors.\n\nJews financed and were the intellectual leaders of the Bolshivek Revolution that killed millions of people.\n\nJEWISH RELIGIOUS PRACTICES\n\nFirst, if what I hear about Jewish religious practices are true, then I don't want Jews in any country let alone a Catholic monarchy.\n\nJews giving babies herpes because rabbis put their mouth on the baby's penis after the circumscion.\nhttps://www.cnn.com/2013/04/07/health/new-york-neonatal-herpes/index.html\n\nJewish views on Gentiles:\nThe following is a quote by Rabbi Yitzhak Ginsburgh in Jewish Week. Can you please confirm or deny the theological validity of the following statement:\n\n\" Gentile souls are of a completely different and inferior order. They are totally evil, with no redeeming qualities whatsoever. ...If every simple cell in a Jewish body entails divinity, is a part of God, then every strand of DNA is a part of God. Therefore, something is special about Jewish DNA. ...\n\nIf a Jew needs liver, can you take the liver of an innocent non-Jew passing by to save him? The Torah would probably permit that. Jewish life has an infinite value. There is something infinitely more holy and unique about Jewish life than non-Jewish life.\"\n(end quote)\n\nHere is another quote from a Rabbi known as the Great Rebbe, whom I believe is a highly honored religious figure\n\n\"A Jew was not created as a means for some [other] purpose; he himself is the purpose, since the substance of all [Divine] emanations was created only to serve the Jews.\"\n\nAnother rumor that I have heard is that Jews have a burning hatred for Jesus Christ and that some Jews forbid his name from even being uttered. \n\n\"according to the Jewish Talmud, Jesus is perhaps the vilest being who ever lived, condemned to spend eternity in the bottommost pit of Hell, immersed in a boiling vat of excrement. Religious Jews regard the Muslim Quran as just another book, though a totally mistaken one, but the Christian Bible represents purest evil, and if circumstances permit, burning Bibles is a very praiseworthy act. Pious Jews are also enjoined to always spit three times at any cross or church they encounter, and direct a curse at all Christian cemeteries. Indeed, many deeply religious Jews utter a prayer each and every day for the immediate extermination of all Christians.\"\n\nAnother rumor is that Jews believe that it is their duty to dominate and enslave Gentiles for all eternity.\n\nThe following rumors about Jewish religious practices are from a book review of Israel Shahak's books on Jewish history and Jewish Fundamentalism.\n\n \"Religious Jews apparently pray to Satan almost as readily as they pray to God, and depending upon the various rabbinical schools, the particular rituals and sacrifices they practice may be aimed at enlisting the support of the one or the other\"\n\n\"On the most basic level, the religion of most traditional Jews is actually not at all monotheistic, but instead contains a wide variety of different male and female gods, having quite complex relations to each other, with these entities and their properties varying enormously among the numerous different Jewish sub-sects, depending upon which portions of the Talmud and the Kabala they place uppermost. For example, the traditional Jewish religious cry “The Lord Is One” has always been interpreted by most people to be an monotheistic affirmation, and indeed, many Jews take exactly this same view. But large numbers of other Jews believe this declaration instead refers to achievement of sexual union between the primary male and female divine entities\"\n\n\"many of the traditional rituals are explicitly intended to fool or trick God or His angels or sometimes Satan, much like the mortal heroes of some Greek legend might seek to trick Zeus or Aphrodite. For example, certain prayers must be uttered in Aramaic rather than Hebrew on the grounds that holy angels apparently don’t understand the former language, and their confusion allows those verses to slip by unimpeded and take effect without divine interference\"\n\n\" Indeed, the primary reason for the existence of non-Jews is to serve as the slaves of Jews, with some very high-ranking rabbis occasionally stating this well-known fact. In 2010, Israel’s top Sephardic rabbi [used his weekly sermon to declare] that the only reason for the existence of non-Jews is to serve Jews and do work for them. The enslavement or extermination of all non-Jews seems an ultimate implied goal of the religion.\n\nJewish lives have infinite value, and non-Jewish ones none at all, which has obvious policy implications. For example, in a published article a prominent Israeli rabbi explained that if a Jew needed a liver, it would be perfectly fine, and indeed obligatory, to kill an innocent Gentile and take his\"\n\n\"according to mainstream Talmudic doctrine, black Africans are traditionally placed somewhere between people and monkeys in their intrinsic nature\"\n\nAnd finally, possibly the most egregious rumor is that of blood libel that was also mentioned in another comment. The idea that medieval Jews would kidnap Christian children and use their blood for rituals. Before you immediately dismiss this claim I would like to point out that extensive research has been done on the topic of blood passovers.\n\nhttp://www.unz.com/ishamir/the-bloody-passovers-of-dr-toaff/\n\n\n\nI apologize for the obscene amount of block quotes but I would appreciate a Jewish perspective on any of the above claims. \n\n \n\n\n\n", "score": 0, "send_replies": true, "subreddit": "monarchism", "date_year_month": "2019-03", "created_utc_converted": "2019-03-28 16:46:04", "score_overall": 25, "words": "jewish holocaust jewish jewish jewish jewish jewish jewish jew jew jewish jewish jewish jew jewish jewish jewish jewish jewish jewish jewish jewish jew libel jewish", "shared_words": "jewish holocaust jew libel", "socre_distint": 4}
{"author": "FreePalestineN0W", "body": "Those were my friends exact words to me \"look into the Holocaust\". when I asked him why? he just said \"look into it!\" (if it helps, we were both heavily researching 9/11 way back when, so we both were interested in various \"conspiracy theories\" for want of a better word) \n\nI had no idea that there was even a conspiracy surrounding the holocaust until he told me to \"look into it\"\n\nseveral years, books, and documentaries later, I have to say it is the deepest and biggest rabbit hole you/anyone is likely to discover. \n\nr/holocaust \n\nis banned and quarantined for a reason. and no, the posts there are not all hate filled Anti-Semitic rantings. quite the opposite usually (though it is not a very active community)\n\nI have as much empathy for the Jews as I do for my Palestinian friends, how the Jewish people have been used by their own over the years is equally as shocking as the treatment handed out to Palestinians and Arabs (and Ethiopian or Eastern European jews) in Israel.\n\nYes there is a group of elite Jews and gentiles who will sell out their own people for greed, money and power or control over others. it is the same people who are happy when idiots use blanket terms like \"the jews did it\" when trying to understand certain issues. \n\nI can highly recommend reading Ilan Pappe's (a Jewish author, who was the first person to be expatriated from Israel I believe) books on Palestine. \"The Forgotten Palestinians\" and the \"Ethnic Cleansing of Palestine\" (though his books have nothing to do with the Holocaust!)\n\nNorman J Finklestein's  (first ever Jew to be denied Visa and entry into Israel, both his parents survived Aushwitz, even though large number of his immediate family perished there) Book's \"the holocaust industry\" and \"beyond the Cutzpah\" are also great reads... \n\nNeither of these Authors discuss the Holocaust as a hoax or conspiracy theory, but they both give outstanding information regarding current problems in the region, and Finklestein does an outstanding job dissecting the holocaust as an \"industry\" \n\nreading both authors help one to gain a wider picture of the current problem. before delving down the rabbit hoe IMO\n\nBut if you are looking for pertinent books regarding the validity of the history of the Holocaust, I would suggest reading Carlo Mattogno or ANY of the Holocaust Handbooks series (54 books in total) \n\nhttps://holocausthandbooks.com\n\nfree to download from the site!  \n\nDavid Irving (although painted in the press and wikipedia as an Anti-Semite) IMO is one of the best historians regarding WWII history and has several great books that also help to give great insight. (\"nuremberg the last battle\" \"Hitlers war\" and \"Churchill's war\" are thoroughly researched through WWII archives and original sources, and are must reads from Irving) \n\nTo understand history it is my belief that we must try to understand and research both sides of any argument. only then can we come to form our own conclusions based on facts, not the opinions of others. \n\nif you are interested I can send you some documentaries. but as my friend once told me \"look into it yourself\" \n\nhttps://codoh.com\n\nhttp://whatreallyhappened.info\n\nhttp://www.holohoax101.org\n\nedited some incorrect information and added a few links at the bottom", "score": 2, "send_replies": true, "subreddit": "conspiracy", "date_year_month": "2019-03", "created_utc_converted": "2019-03-28 16:50:11", "score_overall": 16, "words": "holocaust conspiracy conspiracy holocaust holocaust jewish greed jewish holocaust jew holocaust holocaust conspiracy holocaust holocaust holocaust", "shared_words": "holocaust conspiracy jewish greed jew", "socre_distint": 5}
{"author": "fairlyintrigued", "body": "Wow ok. I guess to start, it is clear you are big onto the conspiracy and possibly Neo-Nazi/White nationalist reading lists. But here goes nothing (in order):\n\n1) Metzitzah b'peh: it is not required in Jewish law to actually have a mohel touch his mouth to a baby's penis after circumcision. The overwhelming majorities of mohels use a straw or gauze pad to accomplish the same goal of removing the blood from the cut area. There are a very small number of Hasidic communities that continue to do metzitzah b'peh in the traditional way, but they are certainly not a majority and even those communities are beginning to stop the practice. \n\n2) Rabbi Ginsburgh is a radical who has been disavowed by every major rabbinical organization on the planet, including those of the so-called \"ultra Orthodox.\" Jewish law forbids harming another person to help oneself, and specifically states that there are three sins for which a Jew must commit suicide before he commits: murder, adultery and idolatry. Murder is not limited to the murder of another Jew, it is for all human beings. As such, it would certainly not be allowed to take the liver of a gentile.\n\n3) I don't know who the \"great Rebbe\" is. \"Rebbe\" is an honorific title given to the leader of a specific Hasidic movement, of which there are well over 100. Many of them refer to either their current or past leaders as \"great rebbe.\" The quote referenced is also incredibly vague. Jews have the idea that our purpose is to fulfill the word of God and His plan with the earth. The plan has nothing to do with serving the Jews, contrary, Jews are about serving God. \n\n4) I'm not sure where that quote comes from, but Jesus is not mentioned in the Talmud. There are a few vague references to a man from Nazareth referred to as a false messiah, but regardless he is certainly not considered a vile person. I'm a \"deeply religious Jew\" and I have certainly never heard of a prayer calling for the extermination of any person or group. Judaism is the only religion that states one can ascend to the afterlife without believing in its tenets. Judaism states that gentiles only need to follow the 7 Noahide laws to ascend to the Garden of Eden, and both Christian and Muslim religious practice are fully compliant with those laws. Jews do not hold the New Testament or the Quran as the word of God, but I've never heard anyone refer to them as \"evil.\" There also is no requirement to burn a Bible, spit at a cross or curse cemeteries - no Jewish law directs Jewish action towards any other group, except that respecting the laws of the country in which they reside holds the same level of religious responsibility as the religious laws themselves.\n\n5) Jews have no desire to enslave or dominate Gentiles. The sole goal of the Jewish people is to reestablish God's temple in Jerusalem and live in peace amongst the family of nations in the Land of Israel. That, according to Jewish law, is considered the age of redemption.\n\n6) Jews are forbidden to pray to anyone or anything that is not God Himself. The fundamental tenet of Judaism is the unity of God (\"Hear o Israel, the Lord is God, the Lord is One\"). \"Praying to Satan\" is completely forbidden, as would be praying to \"male\" and \"female\" gods. There is no such thing. \n\n7) The only prayer that is said in Aramaic is the Kaddish, a prayer for mourners. It is traditionally said in Aramaic because that was the language of the common Jew, and it is a hugely important commandment to say the prayer for a family member when it is required, and making it in Aramaic was easier for Jews at the time. Regardless, any prayer can be said in any language and is received the same by God. Prayers are also only said directly to God and never to angels or prophets, so the larger point is irrelevant. \n\n8) Rabbi Ovadia Yosef did say the first part of the quote, and was immediately condemned by rabbis across the world: \"Rabbi Yosef’s remarks — suggesting outrageously that Jewish scripture asserts non-Jews exist to serve Jews — are abhorrent and an offense to human dignity and human equality,” said AJC Executive Director David Harris. \"Judaism first taught the world that all individuals are created in the divine image, which helped form the basis of our moral code. A rabbi should be the first, not the last, to reflect that bedrock teaching of our tradition.\" \n\n9) The blood libel is the most heinous charge ever put against the Jews and it is completely false. I have no doubt that certain anti-Semites would try to prove that it is real, but I promise you it is not. Killing children is a violation that I mentioned far earlier in this response that would have necessitated that Jew killing himself before committing. On a more basic level, it would not be possible to make matzah using blood, which is what the charge has always been. \n\nI hope these are satisfactory answers to you. I would be happy to have additional conversations with you, or even to send you a copy of a Jewish prayer book (siddur) for you to see what I actually pray 3 times a day. \n", "score": 4, "send_replies": true, "subreddit": "monarchism", "date_year_month": "2019-03", "created_utc_converted": "2019-03-28 17:47:27", "score_overall": 15, "words": "conspiracy jewish jewish jew jew jew jewish jewish jewish jewish jew jewish libel jew jewish", "shared_words": "conspiracy jewish jew libel", "socre_distint": 4}
{"author": "MeredithQLesly", "body": "**Jews are like trolls IRL.**\n\n1. They often change their names to German names, pretending to be ''fellow white people'' when they're not, and they often change their stance on if they're white or not depending on if they get personal gain for it. This is like trolls playing devil's advocate.\n\n2. The ADL was literally founded on defending a child murderer because he was Jewish, despite all the evidence against him. The ADL constantly alludes to this fact and then tries to seek pity points by associating every mass shooting with how tragic it was this Jewish child murderer got lynched. It's being dishonest and condescending, which is what trolls are like online, and seeing how many people take the bait.\n\n3. They try and gaslight people and our ancestors by trying to blame everyone else for why they got kicked out of over 109 countries 500+ times. As a popular proverb says - ''the Jew will always tell you he's hated, but never why''.\n\n4. They want us to believe Jewish ritual murder was all a lie despite every single country somehow coming up with the same thing - countries that had no communication between each other at the time. They like to call it ''blood libel'' instead, when it is anything but.\n\n5. They push for white people to be eliminated and push for open borders in white countries but open borders for Israel? Nah, that'd be antisemetic, goyim!\n\n6. They call anyone who doesn't kiss their ass ''anti semetic'' even though Jews have admitted this is a trick they use to shut people down.\n\n7. They constantly go on about what happened to them 70+ years ago.\n\n8. Usury. \n\n9. Trying to get the US to start a war with Egypt after Israel bombed the USS Liberty. \n\nEven Michael Jackson hated them, which is saying a lot. I don't support Hitler killing people but when he got them out of Germany the German economy thrived. Literally all Jews do is whine about how oppressed they are while their Israeli lobbyists in Congress try to destroy free speech and silence any criticism of the racist apartheid state Israel. \n\nI am not saying every Jew is bad, but there are definitely valid reasons for why they're so unpopular. ", "score": 0, "send_replies": true, "subreddit": "unpopularopinion", "date_year_month": "2019-03", "created_utc_converted": "2019-03-28 23:56:15", "score_overall": 7, "words": "jewish jewish jew jewish libel goyim jew", "shared_words": "jewish jew libel goyim", "socre_distint": 4}
{"author": "lovepotao", "body": "Judaism has obviously evolved over time. However, what has remained constant (at least since the Babylonian exile when the Torah was written down) is a belief in one god, the Torah’s 613 commandments, the belief in a messiah (who according to the Torah needs to be directly descended from King David and bring peace in his lifetime- which is why to Jews Jesus does no qualify). The reason Jesus was controversial in his lifetime was because while he acknowledged   the sacredness of the Torah, he saw a lot of hypocrisy and preached that ultimately it’s more important to just be a good person instead of worrying about breaking one of the 613 commandments of the Torah. *I don’t care what religion someone is- this is just common sense! If you need to question if god would want you to follow a ritual instead of helping someone in need, you need to question the god you’re believing in. *\nJesus’s followers kept Kosher and attended synagogue even after his death. It wasn’t until St.  Paul who suggested that if Jesus died for our sins that the 613 laws of the Torah are unnecessary. That and his preaching to gentiles (non-Jews) is really what led to the split from Judaism to Christianity. So Jesus definitely was Jewish. \nThe Last Supper even was a Passover Seder. \nThere is a sect of Christianity that calls themselves “Jews for Jesus”. They are NOT Jewish; in fact their mission is to convert Jews to accepting Jesus as the messiah. I will never forget being at Columbia University in 2001 and receiving a pamphlet from a Jew for Jesus- it was the story of a Holocaust survivor - who said that if only he had found Jesus sooner his family would have been saved. I was so disgusted years later I wrote a letter to their church and of course never heard back. \nWhy can’t people just be good to each other? Ultimately isn’t that what being religious is supposed to be about (aside from a belief in a higher power)? ", "score": 3, "send_replies": true, "subreddit": "entitledparents", "date_year_month": "2019-03", "created_utc_converted": "2019-03-29 03:05:42", "score_overall": 5, "words": "kosher jewish jewish jew holocaust", "shared_words": "kosher jewish jew holocaust", "socre_distint": 4}
{"author": "brandongoldberg", "body": "I don't consider Shapiro directly alt right because he's mostly hated by the most radical alt righters. The problem is that Ben works unsuspectingly as a useful idiot in white nationalist radicalization. He is very good at convincing his viewers of the alt rights favorite topics like Western Values, threat of Islam, legitimate use of Ethonostates, decline in masculinity/western civilization/freedom, left wing anti white sentiment, anti SJWs, anti transgender, Holocaust/Nazi revisionism, legitimacy of innocent civilian casualties ect.\n\nThe thing is that Ben is an orthodox Jew which leaves his audience open to radicalization through the Jewish Question (which is what many alt righters say pushed them over the edge). If the conspiracy that Jews control society is true (it's not) then Ben is just a tool of that occupation force. They shift from seeing him as an honest actor (he's not) to another Jew trying to control them and this is where he loses control of the people he's worked to radicalize. His arguments turn into half truths where he's seen as presenting the real issues but then manipulating to take out the work of the Jews/Zog/Zionists and continue to destroy white civilization.\n\nEither Ben is unaware of this and somewhat delusional or more like he knows of it but doesn't care because he over estimates his rhetorical ability or just doesn't care due to greed.", "score": 4, "send_replies": true, "subreddit": "samharris", "date_year_month": "2019-03", "created_utc_converted": "2019-03-29 15:09:35", "score_overall": 6, "words": "holocaust jew jewish conspiracy jew greed", "shared_words": "holocaust jew jewish conspiracy greed", "socre_distint": 5}
{"author": "Intortoise", "body": "This might come as a shocker but conservatives are often self contradictory in their \"principles\"\n\n[Ben Shapiro somehow managed to reach a counter to type this](https://twitter.com/benshapiro/status/133918830073352192?lang=en)\n\nA famous jewish conservative even manages to pander to the conservative anti-semitism. The implications of his tweet are that you can trust him because he's one of the good ones, a Good Jew (tm), and every jewish person who doesn't believe exactly how he does is a BAD JEW.\n\n&gt;Conservatives are overwhelmingly supportive of Israel.\n\nThe myriad of jewish conspiracies and holocaust denial are an almost *exclusively* conservative phenomenon. The main conservative subs on this very site right at this very moment are having a terrible little cry about the insidious jewish conspiracy to... put people of difference races in commercials.", "score": 23, "send_replies": true, "subreddit": "SubredditDrama", "date_year_month": "2019-03", "created_utc_converted": "2019-03-29 18:35:32", "score_overall": 8, "words": "jewish jew jewish jew jewish holocaust jewish conspiracy", "shared_words": "jewish jew holocaust conspiracy", "socre_distint": 4}
{"author": "wolfie379", "body": "A few more fun tidbits. Before the time of St. Paul, anyone wanting to convert to Christianity first had to convert to Judaism. He made a slight (but ultimately disastrous) simplification in the New Testament. He replaced a term meaning \"specific group within the hierarchy of the clergy\" (any Jew at the time would have understood what the term meant, but outsiders probably wouldn't) in the section describing who wanted to have Jesus executed with \"Jews\". So long as Christianity was a fringe sect within Judaism, it was pretty much harmless. The trouble started when Christians began to outnumber Jews. Also, under the law that existed at the time, only the Roman government could order an execution. Major religious festival with people coming from the surrounding region? That's got the potential for trouble. Clergy rent space on the temple grounds to vendors of supplies for the festival? No problem, they're the ones running the temple. Carpenter's kid starts knocking over the stalls? Gotta get that troublemaker locked up before he starts a riot. He spouts all sorts of religious jumbo-jumbo? Just another nut. He claims to be King of the Jews? Whoa! \"King\" is the guy sitting on a fancy chair telling people what to do, that guy is a threat to Caesar's rule.\n\nIn Communion, the wafer is symbolic of the Body of Christ and the wine is symbolic of the Blood of Christ - if you oversimplify it, you wind up with ritual cannibalism. Ironic that Christians are one of the groups spouting the Blood Libel. It's even worse when Moslems spout it.\n\nBit of background (for people not familiar with the Blood Libel). Purim is a festival celebrating a victory over the Persians, an event that happened before the time of Julius Caesar (well-known, secular figure so unlikely to be any controversy over whether or not he existed, makes a convenient time marker). The Blood Libel is a claim that one ingredient in the cakes made for this festival is the blood of Christian children (Moslems extend it to include the blood of Moslem children). Christians are followers of the teachings of Jesus, Moslems are the followers of the teachings of Allah, as written down by Mohammed. Before Jesus, there could be no Christians. Before Mohammed, there could be no Moslems. Both Jesus and Mohammed lived after the time of Julius Caesar, so at the time of the victory over the Persians (and when the rituals for the celebration of Purim were created), what those who spout the Blood Libel claim to be a key ingredient of the cakes did not exist.\n\nWhy is it worse when Moslems spout the Blood Libel? Their own holy book says that when travelling away from their people, \"You may eat food prepared by Jews\" (a lot of similarity between Kosher and Halal dietary laws - with the exception of alcohol, the only \"one way\" compatibility I know of is when Halal allows something but Kosher doesn't). The Purim cakes are \"food prepared by Jews\" (after all, they're edible, and they're intended for a Jewish religious festival). Note that the Moslem holy book doesn't say \"You may eat food prepared by Jews, except for the Purim cakes, which you must not touch under any circumstances\". Moslems spouting the Blood Libel either know that they're lying, or (if they truly believe it) they're acknowledging that their holy book explicitly allows them to practice cannibalism.", "score": 1, "send_replies": true, "subreddit": "entitledparents", "date_year_month": "2019-03", "created_utc_converted": "2019-03-29 22:05:38", "score_overall": 10, "words": "jew libel libel libel libel libel kosher kosher jewish libel", "shared_words": "jew libel kosher jewish", "socre_distint": 4}
{"author": "religiousreader", "body": "&gt;Post an example of a Jewish 'unfounded conspiracy theory' you can disprove.\n\nHolocaust denial is a big one. Considering in the 20th century alone the amount of deaths perpetuated by people's own governments it's no surprise that at the very least several million Jews were killed as a scapegoat by the Nazis. The real enemy was the French and British, for their Versailles Treaty that kept them eternally poor. The concentration camps were modelled after the British camps in South Africa and the Spanish internment camps in Cuba. It wasn't a new idea at the time, and Hitler brought the idea home. Considering the conditions in those camps, it is no surprise so many people died, and it would reflect pretty poorly on the Germans if the whole thing was simply an \"accident\".\n\n&gt;It can be proven very easily that Jews control the vast majority of news media, it can be proven they control almost the entire entertainment industry, it can be proven their lobby controls US foreign policy, a Jewish family are behind the opioid crisis that has killed hundreds of thousands of people and ruined the lives of millions more, they are massively over represented in Ivy League schools when compared to high school high achievers, how?\n\nI think that is all extremely worrying, and maybe it says something about the US' sympathy towards Jewish people that is unfounded. However, we can't ignore the fact that when they get into these high powered positions they generally succeed. Does that not also say something about the Jewish people? There is clearly a culture there of competitiveness and business savvy-ness that is pushed on them at a  young age. Not only that, but it's been well reported that Jewish families tend to stay together and that has a huge effect on if someone succeeds or not. As for the negative effects of the things these corporations do, like the opioid crisis... Maybe it's pure maliciousness, or maybe it's simply stupidity. I know one ethnic Jew in my personal life however she is Christian, and also a bank teller. That's just the role she was comfortable with. But from what I've seen in the media, American Jewish people can be summed up like this:\n\nOptimistic, intelligent, sheltered, competitive.\n\nIf it were my call, I'd say they just suffer from liberalism. They are not actively thinking \"Let's kill these goyim and also make a profit to help fund our genocide.\" Instead, they are thinking, \"With these institutions, we can spread wealth and prosperity to the best of our ability.\" Not realizing that they are causing another host of problems as a result of their supposed compassion. Liberalism is an active denial of reality where no consequences may occur, and since it seems these atheist/Jewish CEOs were probably very sheltered as kids, they have a warped view of how the world really works, and the corruption and messiness of business gets in the way of that original liberal ideal of helping others. See Facebook and their CEO for a solid example of this.\n\n&gt;They make up the majority of major party donours, [in the 2016 election 9/10 top democrat donours were Jewish and 4/10 top republicans](https://www.reddit.com/r/DebateFascism/comments/9afxo2/how_do_you_as_a_fascist_respond_to_the/e4vpewq/?context=3).\n\nThis also proves my point that most American Jews suffer from liberalism.\n\n&gt;You can go through and verify these facts for yourself, they aren't secrets.\n\nYep, and while I believe the more objective facts that you've presented I still interpret them differently because of my own perspective. Hopefully you can show me something about Jewish people that doesn't imply they are a monolith.\n\n&gt;I hate our political system, I hate the media, I hate the entertainment business, I hate big pharma, I hate banks, I hate insurance companies etc. All of these are dominated by Jews.\n\n&gt;Everything that is making our people depressed, high time preference, consumeristic, materialistic, less close to nature and spirituality etc are either completely or largely controlled by Jews. You can empirically prove this, there's no unfounded conspiracy theory there are things that are harming our people and they all happen to be run by Jews. If they weren't Jews and it was white people we would still hate those things, just like the 'alt lite' do, it's just that we explicitly point out the fact that these people all mysteriously happen to be Jewish.\n\nThis is the part that gets me worried about your intentions. Do you hate these institutions because they are inherently bad or because they are run by Jewish people? You, me, and many others have benefitted from these institutions one time or another and some were around even before Jewish  people got ahold of them. Insurance companies are very beneficial. So are pharma companies, especially when they are run correctly and not maliciously. Same goes for banks. The only one I can agree to see go away are the media and entertainment companies, because they don't add much social value. However, I think that the people who are attracted that industry are already bad and naive to begin with, Jewish or not.\n\n&gt;Check out 'Culture of Critique for normies' on Youtube, it's less than an hour long and will show you how many academic and social movements that are harmful to society have been run by Jews.\n\nI'm on limited data right now but in a couple days I'll look it up and watch it.", "score": 3, "send_replies": true, "subreddit": "DebateAltRight", "date_year_month": "2019-03", "created_utc_converted": "2019-03-29 14:47:54", "score_overall": 19, "words": "jewish conspiracy holocaust scapegoat jewish jewish jewish jewish jew jewish goyim jewish jewish jewish conspiracy jewish jewish jewish jewish", "shared_words": "jewish conspiracy holocaust scapegoat jew goyim", "socre_distint": 6}
{"author": "ProgressiveArchitect", "body": "Don’t misunderstand me. I’m not picking on Israel specifically here. I’m against all theocratic nations, not just Israel, All of them.\n\n“There's no BDS China, no BDS Syria, BDS Russia, etc.”\n\nYour right and there should be. We should have sanctions and boycotts against all of those countries. Especially China. If I’d have to choose, I’d rather see a BDS China than BDS Israel.\n\n“Uh oh another left-wing As a Jew - never Jewish except when it's useful for attacking Israel.”\n\nI don’t know what your trying to say but I’ve been Jewish my entire life. I was born into a conservative Jewish family. I keep kosher. Much of my extended family was killed in Poland during the holocaust for being Jewish. \n\n“Ok and? Unlike the Arabs the Jews BOUGHT their land.”\n\nNot sure how that’s relevant to this discussion but okay.\n\n“Pro Semitic. You are so full of shit, flaky and shady.  Ok you're pro Semitic. That's a totally normal thing to say.”\n\nWow, you really enjoy trying to insult people. Very mature of you. \n\n“Who cares what you think? I hope you don't have the nerve to visit and enjoy Israel. I hope you're boycotting Israel.”\n\nObviously you care what I think, otherwise you wouldn’t have taken time out of your day to give such a comprehensive written response. And yes, I have visited Israel a few times actually. Once on Birth Right, Once with family, and Once for IT business. \n\n“what Israel is. A country with total freedom of religion. Two million Muslim and Christian Arabs live in Israel with full civil rights, as do Druze, Bahai, etc. Meanwhile ZERO Jews live in Palestinian apartheid cities like Ramallah, Jenin, Rawabi, Nablus.”\n\nI have no complaints regarding Israel in terms of its diversity. Israel is a very diverse place with many religions and people. My complaint is regarding the treatment of Palestinians. Many Palestinians don’t have full civil rights. Many live under military law, not civil law. I understand that Jews are treated horribly in other middle eastern countries and I think that’s horrible. I am equally against the mistreatment of Jews, as I stated in my earlier comments.", "score": 1, "send_replies": true, "subreddit": "dsa", "date_year_month": "2019-03", "created_utc_converted": "2019-03-30 00:46:53", "score_overall": 7, "words": "jew jewish jewish jewish kosher holocaust jewish", "shared_words": "jew jewish kosher holocaust", "socre_distint": 4}
{"author": "Vallerius", "body": "Ford's antisemitism is well documented and there is another AskHistory thread with a decent answer to a similar [question](https://www.reddit.com/r/AskHistorians/comments/382xaf/was_henry_ford_an_antisemite_a_nazi_sympathizer/).\n\nI would argue that Ford's antisemitism and notorious belief in conspiracy theories are interrelated and fed each other. As for which came first? I don't think there is an answer for that particular question that I am aware of.\n\nAfter the publishing of some negative stories in the Chicago Tribune in 1919, Ford sued the paper for libel. In that court case he was deposed and his testimony is one the possible origination of his famous quote \"History is bunk.\" while the transcript never puts those words in that order, it does appear that Ford believed that history was less about the facts of the past and more about perceptions and power.\n\nAfter losing the case, he acquired the Dearborn Independent, a struggling newspaper local newspaper to his factories, he placed one of his lieutenants E.G. Liebold in charge of the paper and closely supervised the stories and reporting that it printed. One of the series the paper published was \"The International Jew\" which attempted to prove that a conspiracy theory that a international cabal of Jewish financiers and bankers controlled politics and history.  The publication of this series was influential in the dissemination of antisemitic ideologies throughout its time in print. The series would published the Protocols of Zion, which remain one of the most influential pieces of antisemitic writings, and other stories.\n\nFord was incredibly interested in proving his vision of history and printed many associated stories including some rather strange tales. Ford at one point picked a book called  *The Escape and Suicide of John Wilkes Booth* by Finis Bates (1907) which he found fascinating. Bates alleged he had met John Wilkes Booth in Texas long after his official death in 1865 shortly after the assassination of President Lincoln. Bates would eventually become the owner of a mummified corpse which he claimed proved Booth lived for years after the fact and would appear often at sideshows and carnivals around the country. Bates argued that Booth's survival was possible due to the fact that he was in league with Vice President Andrew Johnson who had \"conspired\" to kill Lincoln in order to become president himself and cover up the fact that Booth had survived.\n\nFord was intrigued with the story and believed that the conspiracy to kill Lincoln extended beyond Johnson and was done in part because Lincoln had implemented a monetary policy that had angered Jewish Canadian bankers. So Ford connected the dots. Needless to say, while the Booth conspiracy Bates  laid out, and the many other versions, were never proven or provide any reasonable evidence, Ford ended up printing the story in \"the International Jew\" as another example of how Jewish Bankers dominated history.\n\nThere have been many serious historical studies of antisemitic thought and its origins but in Ford's case, it appears that his antisemitism developed a long side his other conspiratorial ways of thinking. However there is very little about his antisemitism that is unique, Ford simply had the wealth and capabilities to spread his ideas but many others shared them. Other prominent figures shared similar view points. A few years after Ford shut down the Independent and made a public apology about his antisemitic politics a Catholic priest a few miles away in Royal Oak, MI at the National Shrine of the Little Flower began broadcasting a well-known radio show. Father Coughlin would deliver tirades against Jewish bankers throughout the 30s and became a vocal supporter of fascism. So Henry Ford cannot be considered the only figure participating in antisemitic propaganda  and both Ford and Coughlin hint at a larger supportive audience of Americans who shared their antisemitic views.\n\nSources:\n\nMax Wallace. *The American Axis: Henry Ford, Charles Lindbergh and the Rise of the Third Reich*. New York: St. Martin's Press, 2003.\n\nFord R. Bryan: *Henry's Lieutenants*. Detroit, Mich.: Wayne State University Press, 1993.\n\nEvans, C. Wyatt. *The Legend of John Wilkes Booth: Myth, Memory, and a Mummy.* University Press of Kansas, 2004.\n\nWarren, Donald. *Radio Priest: Charles Coughlin The Father of Hate Radio*. New York: The Free Press, 1996.\n\n&amp;#x200B;", "score": 120, "send_replies": true, "subreddit": "AskHistorians", "date_year_month": "2019-03", "created_utc_converted": "2019-03-30 18:47:47", "score_overall": 11, "words": "conspiracy libel jew conspiracy jewish conspiracy jewish conspiracy jew jewish jewish", "shared_words": "conspiracy libel jew jewish", "socre_distint": 4}
{"author": "RavenK9", "body": "Many saw the Jew as an evil capitalist who's sole goal was to exploit the workers for money. Karl Marx hated Jewry, he notably wrote *A World Without Jews* &amp; *On the Jewish Question*. He thought the Jews had to reject Judaism in order to emancipate themselves from money and greed. From what I understand, to him the religion was the problem, not the person in itself.  \n\nMarx said in [*On the Jewish Question*](https://www.marxists.org/archive/marx/works/download/pdf/On%20The%20Jewish%20Question.pdf): \n\n&gt; \"What is the worldly religion of the Jew? Huckstering. What is his worldly God? Money.…. Money is the jealous god of Israel, in face of which no other god may exist. [...] The bill of exchange is the real god of the Jew. His god is only an illusory bill of exchange…. The chimerical nationality of the Jew is the nationality of the merchant, of the man of money in general.\"\n\nAs others have said, Stalin and the USSR weren't friendly to Jews either. There's plenty of [Soviet anti-Semetic propaganda](https://forums.skadi.net/threads/17134-Soviet-Slavic-Anti-Jewish-Propaganda-Posters) on the web. I'm not aware of any mass killings of Jews in the USSR though.\n\n", "score": 4, "send_replies": true, "subreddit": "HistoryMemes", "date_year_month": "2019-03", "created_utc_converted": "2019-03-30 21:12:23", "score_overall": 9, "words": "jew jewish greed jewish jew jew jew merchant jewish", "shared_words": "jew jewish greed merchant", "socre_distint": 4}
{"author": "nidarus", "body": "&gt;In 1984 Syrian Defense Minister [Mustafa Tlass](https://en.wikipedia.org/wiki/Mustafa_Tlass) published a book called *The Matzah of Zion*, which claimed that Jews had killed Christian children in Damascus to make Matzas (see [Damascus affair](https://en.wikipedia.org/wiki/Damascus_affair)). His book inspired the Egyptian TV series [*Horseman Without a Horse*](https://en.wikipedia.org/wiki/Horseman_Without_a_Horse) (see below) and a spinoff, *The Diaspora*, which led to [Hezbollah](https://en.wikipedia.org/wiki/Hezbollah)'s al-Manar being banned in Europe for broadcasting it.[\\[48\\]](https://en.wikipedia.org/wiki/Antisemitism_in_the_Arab_world#cite_note-48)  \n&gt;  \n&gt;Former [Ku Klux Klan](https://en.wikipedia.org/wiki/Ku_Klux_Klan) leader [David Duke](https://en.wikipedia.org/wiki/David_Duke) visited Syria in November 2005 and made a speech that was broadcast live on Syrian television.[\\[49\\]](https://en.wikipedia.org/wiki/Antisemitism_in_the_Arab_world#cite_note-49)\n\nOr how about modern-day [Syrian schoolbooks](http://www.impact-se.org/wp-content/uploads/Syrian-National-Identity_IMPACT-se_July-2018-.pdf)?\n\n&gt;Regarding Jews living in the Arabian Peninsula during the rise of Islam and the battles of Muhammad, students are provided with a list of valuable lessons and admonitions, including: \"treason and deception are part of the Jew's attributes,\" as are \"violation of treaties and breaching promises.\" Syrian students are taught one single play written by Shakespeare during their studies: The Merchant of Venice. According to their Arabic language textbook, \"the play shamefully reveals the depths of a Jewish usurer, and the greed and avarice he pursues by every possible means.\" Adding insult to injury, a caricature of Shylock is presented as an illustration from the play, revealing a stereotypical medieval ugly Jewish image.\n\nHell, how about how they treated their own ancient Jewish community?\n\n&gt;The Aleppo Arab riot of 1947 killed dozens of Jews and destroyed hundreds of homes, shops, and shuls. This marked the beginning of mass Jewish emigration from Syria to Israel, despite the Syrian government’s willingness to put to death those who attempted to flee. Other repressive measures against Jews included barring them from government service, not allowing them to own telephones or driver’s licenses, and forbidding them to buy property. The anti-Semitic attitude of Syria’s government was displayed to the world when it provided shelter for Nazi war criminal [Alois Brunner](https://en.wikipedia.org/wiki/Alois_Brunner), an aide to [Adolf Eichmann](https://en.wikipedia.org/wiki/Adolf_Eichmann).  \n&gt;  \n&gt;In March 1964, a new decree banned Jews from traveling more than 5 kilometres (3 mi) from their hometowns.[\\[48\\]](https://en.wikipedia.org/wiki/History_of_the_Jews_in_Syria#cite_note-jsource2-48) Jews were not allowed to work for the government or banks, could not acquire drivers' licenses, and were banned from purchasing property. Although Jews were prohibited from leaving the country, they were sometimes allowed to travel abroad for commercial or medical reasons. Any Jew granted clearance to leave the country had to leave behind a bond of $300–$1,000 and family members to be used as hostages to ensure they returned. An airport road was paved over the Jewish cemetery in [Damascus](https://en.wikipedia.org/wiki/Damascus), and Jewish schools were closed and handed over to Muslims. The Jewish Quarter of Damascus was under constant surveillance by the secret police, who were present at synagogue services, weddings, [bar mitzvahs](https://en.wikipedia.org/wiki/Bar_mitzvah), and other Jewish gatherings. The secret police closely monitored contact between Syrian Jews and foreigners and kept a file on every member of the Jewish community. Jews also had their phones tapped and their mail read by the secret police.[\\[47\\]](https://en.wikipedia.org/wiki/History_of_the_Jews_in_Syria#cite_note-jsource-47)[\\[50\\]](https://en.wikipedia.org/wiki/History_of_the_Jews_in_Syria#cite_note-congressional_record-50)\n\nMaybe not the best time to trut out this particular cliche.", "score": 1, "send_replies": true, "subreddit": "nottheonion", "date_year_month": "2019-03", "created_utc_converted": "2019-03-31 21:31:46", "score_overall": 13, "words": "jew merchant jewish greed jewish jewish jewish jew jewish jewish jewish jewish jewish", "shared_words": "jew merchant jewish greed", "socre_distint": 4}
{"author": "nidarus", "body": "&gt;You do realize people in Lebanon, Syria, Palestine, etc are Semites, right?\n\nOMG, not this nonsense again. Antisemitism doesn't mean hatred of semites. It literally never meant that. It's simply not a phenomenon that exists, beyond a defense for Arab antisemitism.\n\n&gt;The root word [*Semite*](https://en.wiktionary.org/wiki/Semite) gives the [false impression](https://en.wikipedia.org/wiki/Misnomer) that antisemitism is directed against all [Semitic people](https://en.wikipedia.org/wiki/Semitic_people), *e.g.*, including [Arabs](https://en.wikipedia.org/wiki/Arabs) and [Assyrians](https://en.wikipedia.org/wiki/Assyrian_people). The compound word *antisemite* was popularized in Germany in 1879[\\[7\\]](https://en.wikipedia.org/wiki/Antisemitism#cite_note-FOOTNOTEBein1990595-7) as a scientific-sounding term for *Judenhass* (\"Jew-hatred\"),[\\[8\\]](https://en.wikipedia.org/wiki/Antisemitism#cite_note-FOOTNOTEChanes2004150-8)[\\[9\\]](https://en.wikipedia.org/wiki/Antisemitism#cite_note-FOOTNOTERattansi20074%E2%80%935-9)[\\[10\\]](https://en.wikipedia.org/wiki/Antisemitism#cite_note-FOOTNOTERoth200330-10)[\\[11\\]](https://en.wikipedia.org/wiki/Antisemitism#cite_note-FOOTNOTEJohnston198327-11)[\\[12\\]](https://en.wikipedia.org/wiki/Antisemitism#cite_note-laqueur1-12) and this has been its common use since then.[\\[13\\]](https://en.wikipedia.org/wiki/Antisemitism#cite_note-FOOTNOTEJohnson1987133-13)[\\[14\\]](https://en.wikipedia.org/wiki/Antisemitism#cite_note-JustJews-14)\n\nAnd just FYI, the Syrians aren't just \"criticizing a foreign government\". They're an openly antisemitic regime, who invited David Duke to make an antisemitic speech, and broadcast it on live state TV, teach their kids that \"treason and deception are part of the Jews attributes\" in the state-mandated schoolbooks, and only teach a single Shakespeare play in schools - the Merchant of Venice. And to make it clear, it's because \"the play shamefully reveals the depths of a Jewish usurer, and the greed and avarice he pursues by every possible means\".\n\nI should also note that Syria had a big and ancient Jewish community, but it's currently 100% Jew-free, since all the Jews ran for their lives after a series of pogroms in the 1940's, and a series of measures that forbid Jews from owning property, serving in the government, or even getting a driver's license. All while proudly granting asylum and a state pension to Alois Brunner, Adolf Eichmann's right-hand man, and a key architect of the Holocaust.\n\nSo yeah, the Syrian government is very antisemitic, in the fullest, most traditional sense of the word. And trying to reduce it to \"criticizing a foreign government\" is just excusing antisemitism.", "score": 0, "send_replies": true, "subreddit": "nottheonion", "date_year_month": "2019-03", "created_utc_converted": "2019-03-31 21:43:17", "score_overall": 7, "words": "jew merchant jewish greed jewish jew holocaust", "shared_words": "jew merchant jewish greed holocaust", "socre_distint": 5}
