{"author": "UnableFaithlessness", "body": "Hitchens is wrong. Antisemitism manifests as the projection of what any given society finds as hateful onto Jews, so the society can symbolically fight its own demons without actually disrupting the power structures that maintain those evils.\n\n[Antisemitism is the grand conspiracy theory](https://www.tabletmag.com/scroll/274001/anti-semitism-is-a-conspiracy-theory) deployed to \"explain\" why people suffer and redirect revolutionary activity away from real change.\nThis is how antisemitism has always functioned. \n\nAntisemitism is therefore always framed by antisemites as \"punching up.\" The core antisemitic belief is that Jews - one Jew, some Jews, all Jews, a secret cabal of Jews, the \"Synagogue of Satan,\" the \"Elders of Zion,\" religious Jews, Jewish converts to other religions, Jewish bankers, Jewish Bolsheviks, Jewish intellectuals, Jewish politicians, the international community of world Judaism, the Jewish state - are an omnimalevolent force that oppresses the world. \n\nFor more information on the general framework of projection and conspiracy, see [this article](http://www.jcpa.org/phas/phas-falk-s06.htm), [this book](https://www.amazon.com/Anti-Judaism-Western-Tradition-David-Nirenberg/dp/0393347915). For further reading from a variety of sources and perspectives, see [here](https://www.publicsource.org/history-anti-semitism-pittsburgh/?fbclid=IwAR1oKPccojHjhBgcmJTJcNgSO8hc4B3M9wkFhwkMks-2iCsfYPccBIBkiOA), [here](https://jfrej.org/wp-content/uploads/2018/04/JFREJ-Understanding-Antisemitism-November-2017-v1-3-2.pdf), and [here](https://archive.org/details/ThePastDidntGoAnywhere). \n\nSee [here](https://www.bibleodyssey.org/en/passages/related-articles/crucifixion-of-jesus-and-the-jews) for a brief explanation of this projection and blame-shifting functioned of the \"deicide\" charge in early Christian thought. See also [here](http://www.danielpipes.org/33/the-jew-as-ally-of-the-muslim-medieval-roots-of-anti) for an overview of how Christian fear &amp; opposition to Islam was used to justify medieval antisemitism.\n\n\nAfter looking at your post history I do not think I need to provide you links on how this functions within medieval or modern Islamic societies. \n\n(See [here](http://www.politicalresearch.org/2017/06/29/skin-in-the-game-how-antisemitism-animates-white-nationalism/#sthash.GMftfcRa.5oiHt2LZ.dpbs) for more information on how it fits into contemporary American white nationalism. See [here](https://newrepublic.com/article/144393/lefts-blind-spot-anti-semitism?utm_source=social&amp;utm_medium=facebook&amp;utm_campaign=sharebtn) for more information on why the modern left has a significant blind spot for antisemitism; please see [here](https://www.nytimes.com/2019/01/21/opinion/ilhan-omar-israel-jews.html), [here](https://www.haaretz.com/israel-news/.premium-why-western-liberals-so-easily-buy-into-anti-semitic-blood-libel-1.6157148) and [here](https://www.tabletmag.com/jewish-news-and-politics/260637/robert-faurisson-holocaust-denial) for specific case studies in how antisemitism infects the anti-Zionist left.)\n\n(I can provide more links about antisemitism if requested.)\n\n&gt;Jews dislike Christians and Muslims because they rejected Judaism, invented new prophets, and their new religions were significantly more successful than Judaism.\n\n***No.*** Those of us who dislike Christianity and Islam do so because its proponents have oppressed us pretty severely for the last couple thousand years. \n\nWe don't dislike Buddhism, even though that religion is also incorrect and was \"significantly more successful\" at spreading than Judaism.", "score": 7, "send_replies": true, "subreddit": "DebateReligion", "date_year_month": "2019-05", "created_utc_converted": "2019-05-01 09:10:05", "score_overall": 14, "words": "conspiracy conspiracy jew jewish jewish jewish jewish jewish jewish conspiracy jew libel jewish holocaust", "shared_words": "conspiracy jew jewish libel holocaust", "socre_distint": 5}
{"author": "darthhayek", "body": "I guess I'm a little bitter, since I was recently perma'd from /r/Conservative for \"anti-Semitism\" over this exact issue, because I expressed my confusion as to why a liberal newspaper making fun of an Israeli politician is any more \"racist\" than the liberal media doing the same thing on a 24/7 basis to white gentile races like the Russians. And I know I'm not an anti-Semite.\n\nhttps://duckduckgo.com/?q=putin+trump+dog&amp;atb=v111-6_b&amp;iax=images&amp;ia=images\n\nAnd if you don't think that \"antisemites\" are hated or dehumanized in this country, then may I introduce you to a little man named Donald Trump and a city called Charlottesville, where our \"greatest allies\" continue to condemn the former as a bad conservative to this day because he said the obvious truth that there were good ***and*** bad people on both sides of the rally held in the latter. Or how about a little place called the State of Germany, where innocent people are still hunted down and sent to concentration camps for things such as Holocaust denial to this day.\n\nhttps://carolynyeager.net/railroading-ursula-haverbeck\n\nAnd considering that the Israeli ambassador to the UN actually went so far as to call for *criminalizing antisemitism in the US*, only just yesterday, specifically in response to the *New York Times* cartoon, then I think that you'll forgive me if I'm willing to die on the hill of comparing the Israeli prime minister to a seeing-eye dog, even if that is somehow \"racist\" or \"antisemitic\". I cannot for the *life* of me understand how it is acceptable to tolerate the Trump-Putin rhetoric of the last 3 years, some of which borders on seditious, but then criminalize minor, *accurate* criticisms of the US president's relationship with Bibi Netanyahu. This is going to affect me and people I love if this becomes law, so it is important for me to talk about it.\n\n*The only way to stop antisemitism is to criminalize it, Israel’s Ambassador to the UN Danny Danon told reporters in New York on Monday.*\n \n*“The time for talking and having a conversation is over,” Danon said. “What Israel and the Jewish community around the world demand is action - and now.\"*\n\n*Danon, speaking on the sidelines of the United Nations Security Council meeting, said that those who engage in antisemitism \"must be punished. Whether it is here at the UN [or by] political leaders, editors, policy pundits or college professors, it does not matter.*\n \n*“Antisemitism should have no place in our society,\" he continued. \"Until it becomes criminal, this bigotry will persist; it will fester. It is only a matter of time until it erupts again in violence and bloodshed.\"*\n\nhttps://www.jpost.com/Diaspora/Antisemitism/Israeli-envoy-calls-for-criminalizing-antisemitism-after-NYT-cartoon-588234\n\nYou know how those evil far right white supremacists are supposedly so antisemitic because they think that \"da Jooz\" are plotting a \"w**** genocide\"? Well, you would *need* an actual w**** genocide to successfully bring every single person who has a happy merchant image on their hard drive or did the (parentheses) thing on YouTube once to justice. This is insane and radical shit and it is *not* Jew hatred to have a problem with it!\n\nOh, and I think it speaks volumes that I needed to bypass a word filter to even post this comment.", "score": -1, "send_replies": true, "subreddit": "Republican", "date_year_month": "2019-05", "created_utc_converted": "2019-05-01 15:11:02", "score_overall": 4, "words": "holocaust jewish merchant jew", "shared_words": "holocaust jewish merchant jew", "socre_distint": 4}
{"author": "maramoi", "body": "Jews have still not explained why it is that they demanded that we give them a country in the Middle East, if they were always planning on remaining inside of our countries and running our governments, banks, academia, media and industry.\n\nThey are the only race on earth that is allowed to actively promote themselves as an ethnically pure racial state. And they claim that they have the right to do this because they were made into lampshades and soap by Adolf Hitler during World War Two – that they have to have a racially pure state because they are a uniquely persecuted people. No one can explain why, but people all across the planet are constantly plotting to exterminate them.\n\nBut even though this unique state exists for the uniquely chosen people, they continue to complain that they are having trouble living in Europe.\n\nNote that of the 1,879 alleged incidents, 1,820 did not involve violence.\n\nAlso note that the reason that the 2018 numbers are lower than the 2017 numbers is that the latter included 245 prank phone calls from an Israeli Jew. Yes, they did indeed have the nerve to count prank calls by a Jew – clearly staged as a blood libel against white people – in their statistics of anti-Semitic crime.\n\nAnti-Semitism was mainstream in every single country hosting Jews all throughout history, up until the post-war period when Jews infiltrated and took over academia and the media and started brainwashing people into believing they are great.\nWhy should Jews continue life in Europe?\n\nThis seems like a very obvious question, given, again, that they are uniquely in possession of their own racially pure homeland – which is rapidly expanding, especially under the presidency of Donald Trump.\n\nAs far as the actual numbers here, there are four main factors to consider:\n\nJews continually hype up and exaggerate how much people abuse them in order to exploit the altruism and empathy of white people for their own material benefit\nJews often hoax hate crimes against themselves (as mentioned above, even when it is proven to be a hoax, the ADL and other Jewish groups still count it in their statistics; many of the “hate incidents” involve things that are not even crimes, which may or may not be hoaxes)\nThe number of Moslems in Europe is continually rising, and Moslems tend to dislike Jews\nThere is indeed a rising awareness of Jewish behavior amongst white people, which is leading to negative feelings toward Jews\nMost of the violent incidents will tend to be done by Moslems, who will often simply attack Jews on the street if they see them. Jews have tended to downplay this, and pretend as though these attacks are done by whites.\n\nHowever, in a type of self-fulfilling prophecy, after having waged a war against whites – which includes the blood libel of collectively blaming them for all of these crimes they didn’t commit – whites have now started killing Jews. I don’t really see that phenomenon slowing down any time soon. Just like with Islamic terrorism, it’s a difficult cat to get back into the bag once it is out.\n\nJews are using goyim newspapers to announce that they may have to leave white countries, as if they want us to all come out and say “oh no Jews, please, we want you to stay.” Such is the feminine nature of the Jew.", "score": 11, "send_replies": true, "subreddit": "conspiracy", "date_year_month": "2019-05", "created_utc_converted": "2019-05-01 21:14:25", "score_overall": 8, "words": "jew jew libel jewish jewish libel goyim jew", "shared_words": "jew libel jewish goyim", "socre_distint": 4}
{"author": "NiDonnaNaiz", "body": "I had the displeasure of finding out an acquaintance was a Holocaust denier.  It was insane. I told this person that my grandfather was a ( Catholic Basque) Holocaust survivor.  Imagine the mental gymnastics someone has to perform to argue with you that your non-Jewish Holocaust survivor relative, was in fact part of the Jewish conspiracy. Even people who aren't Holocaust deniers, often don't realize the scope.\n\nI wonder if these fools realize that of the approx. 11 million Holocaust victims , approx. 5 million weren't Jewish. The Holocaust isn't seem some \"Jew conspiracy\" , people from a myriad of ethnicities, faiths,  sexual orientations, political affiliations,  etc. were victims.  .  .how is it a bad thing that \"the controlling Jewish media\" doesn't want the world to forget something that wiped out entire families and entire towns/villages?  Even if it were \"just\" a \"Jewish thing\", it would be just as important to remember. Any society that is capable of targeting a given group,  is capable of targeting any other group. You know the whole \"First they came for . . .\" poem", "score": 29, "send_replies": true, "subreddit": "books", "date_year_month": "2019-05", "created_utc_converted": "2019-05-02 07:21:45", "score_overall": 14, "words": "holocaust holocaust jewish holocaust jewish conspiracy holocaust holocaust jewish holocaust jew conspiracy jewish jewish", "shared_words": "holocaust jewish conspiracy jew", "socre_distint": 4}
{"author": "ImmersingShadow", "body": "Religions and superstitions\n\npointless, illogical conspiracy theories (eg: Flat Earth, (possibly jewish) Illuminati rule the earth and all celebrities are working for them and their signs are everywhere, Holocaust deniers, GRD deniers (aka in German: \"Reichsbürger\")\n\nanti-vaxxers (or the diseases that they cause to return)\n\nbad educational systems in western countries (looking at USA where religion is often an argument to not discuss certain matters; or looking at Germany where the minister for education and science has stated that religion should be more important than education (yeah, that b\\*tch actually did that!)\n\nall kinds of issues that countries (once again mostly western/industrialized) could easily fix but choose not to because whatever...\n\nfascism and everything resembling it in any way (looking at sjws shutting every critic up like Nazis used to shut up critics).\n\nAny kind of discrimination\n\nand last but not least, but it will never be resolved anyway: famine", "score": 1, "send_replies": true, "subreddit": "AskReddit", "date_year_month": "2019-05", "created_utc_converted": "2019-05-02 13:17:58", "score_overall": 4, "words": "conspiracy jewish illuminati holocaust", "shared_words": "conspiracy jewish illuminati holocaust", "socre_distint": 4}
{"author": "ArbysMakesFries", "body": "Absolutely, I think a better way to frame it than \"A was inspired by B\" where A is Zionism and B is the Holocaust, would be \"A and B were both inspired by C\" where C is the longer tradition of Western settler-colonialism, especially the American \"frontier\" ideology whose champions often don't perceive themselves as supporting genocide at all. (Which makes it intriguing the way frontier-western \"cowboys and Injuns\" pop culture from the US was extremely popular in Germany for decades leading up to the Holocaust, to such an extent that Hitler himself even referred to the targets of the Holocaust as \"redskins\".)\n\nThat said, as a diaspora Jew I do find something unsettling and even anti-Semitic about the modern ideology of Holocaust exceptionalism, especially in relation to the Zionist concept of the \"negation of the diaspora\": this idea that anti-Semitism is some permanent irresistible force of nature, and any attempt to live as a Jew in the diaspora only makes it a matter of time until the goyim decide to do another Holocaust on us (for which one can hardly blame them since it's such a transhistorical force of nature and all) so the only way for us Jews to survive is to all run away to Israel where we can become proper European-style blood-and-soil ethnonationalists, which when you really think about it is the only proper way for human beings to live anyway. On that level I do think drawing a direct connection between Zionism and Nazi anti-Semitism is necessary and important, not because the IDF is literally about to start tossing Palestinians into gas chambers or whatever, but because an important strain of Zionist ideology interprets Nazi anti-Semitic ideology as fundamentally correct about the degeneracy of the Jewish diaspora, and instead of resisting Nazi anti-Semitism, seeks to respond by transforming Jews ourselves into the kinds of people a Nazi anti-Semite might find more agreeable.\n\nThis is also part of why I appreciate so strongly Till's choice of concentration camp badge in the Deutschland video: not just the yellow badge of a Jewish prisoner, which Zionists have since embraced as a symbol, but specifically the red and yellow badge of a Jewish leftist political prisoner, which Zionists generally shy away from since most of the Jews who died wearing it also hated Zionism for exactly the reasons I described.", "score": 0, "send_replies": true, "subreddit": "Rammstein", "date_year_month": "2019-05", "created_utc_converted": "2019-05-03 15:46:11", "score_overall": 11, "words": "holocaust holocaust holocaust jew holocaust jew goyim holocaust jewish jewish jewish", "shared_words": "holocaust jew goyim jewish", "socre_distint": 4}
{"author": "TrueJacksonVP", "body": "That’s the thing. They all move the goalposts so if you call them a holocaust denier, they will tell you they know “some parts” of the holocaust happened (because they can’t wholly ignore and erase documented history). \n\nThey say shit like “we know some bad stuff might possibly have happened but the ‘6 million’ deceased Jews is a myth — it wasn’t that many, no Jews were gassed — they all died of exposure and disease, and Anne Frank’s diary is a fabrication written by her father to promote sentimentalism towards Jews” \n\nThey look for any possible way to downplay the Jewish plight and the Nazi’s intent and involvement. They actively try to rewrite history and discredit the first hand accounts from people like Elie Wiesel. They’re antisemites who believe in globalist conspiracy theories. In short, they’re delusional, paranoid fuckwads who spend a majority of their time spreading blatant and intentional misinformation in places like the YouTube comment section in an attempt to sway other bigoted and impressionable people to their cause simply to discredit and demonize the Jewish people who is to them “the boogeyman”. \n\nYa know, rather than Adolf Hitler, who they always seem to have a strange affinity for...", "score": 4, "send_replies": true, "subreddit": "iamatotalpieceofshit", "date_year_month": "2019-05", "created_utc_converted": "2019-05-03 15:56:38", "score_overall": 6, "words": "holocaust holocaust jewish globalist conspiracy jewish", "shared_words": "holocaust jewish globalist conspiracy", "socre_distint": 4}
{"author": "Thy_Weapon_Of_War", "body": "It's not the state of Israel that is behind the NWO.  They are involved.  But obviously the conspiracy for the NWO goes back much futher than 1948, when the state of Israel came into existence.\n\nThe modern manifestation of the agenda for a globalist \"New World Order\" began in the mid/late 1700s with the House of Rothschild and other elite jewish bankers, who founded the \"Illuminati\" and used Freemasonry and their banking wealth/power to take over control of the governments of Europe.\n\nWith the astronomical wealth that these jewish bankers amassed, they have bought up and gained control over Hollywood, western Establishment press and media/television, and many other major companies/organizations.  And with all of this wealth and power, they have bought off and control virtually all western governments.", "score": 11, "send_replies": true, "subreddit": "conspiracy", "date_year_month": "2019-05", "created_utc_converted": "2019-05-03 17:59:53", "score_overall": 5, "words": "conspiracy globalist jewish illuminati jewish", "shared_words": "conspiracy globalist jewish illuminati", "socre_distint": 4}
{"author": "GingerJack76", "body": "&gt; You are calling me an authoritarian for questioning whether it's a bad idea to stop anti semetic conspiracy theories. \n\nApologizing isn't the same as questioning.\n\n&gt;but rather spread resentment against the jewish menace and inciting violence/stochastic terrorism.\n\n&gt;But sure, darth \"white genocide\" hayek is the good guy here.\n\nI literally said that he could be an authoritarian. I never claimed him to be a good guy. You're so wrapped up in yourself that you can't even get simple arguments straight.\n\n&gt;From wikipedia:\n\nI never said they were right, I've actually argued agaisnt them because I've done my research on the holocaust, I said that they are free to be as hyperbolic as they want. Anyway, if you can't understand that silencing people doesn't just stop at people who are wrong, then I don't know what to tell you. You're lost as far as I can tell, and you ain't coming back until the boot your propping up kicks you in your fat bottom.", "score": 2, "send_replies": true, "subreddit": "AskLibertarians", "date_year_month": "2019-05", "created_utc_converted": "2019-05-03 22:38:37", "score_overall": 4, "words": "conspiracy jewish holocaust silencing", "shared_words": "conspiracy jewish holocaust silencing", "socre_distint": 4}
{"author": "CarmellaS", "body": "This comment is absolutely disgusting. Comparing Jews to Nazis IS anti-semitic. So is this 'Chosen people' business - that's not part of Judaism, it's how certain (anti-semitic) Christians view Judaism. The simplified version of the Jewish story is that God asked all the nations of the Earth to follow Him. The Hebrew people chose to do so. The Hebrew phrase describes this translates to \"the people who choose \\[chose\\]\" - the inverse of \"chosen people\". There is also a story that G-d asked the Jewish people last because we were the most defiant.\n\nJudaism is anything but exclusive - anyone can become Jewish if they want to. In doing so, however, you will be subject to extra requirements (keep kosher, charity, etc.) which non-Jews are not obligated to do. This doesn't make Jews any better than non-Jews; it means that we chose to take certain obligations upon ourselves (note as well that the majority of Jews, including I, don't follow all of the obligations). As an example, a non-Jew can get into heaven (yes I know heaven isn't a Jewish concept, but this is how it was described to me in Hebrew school) or is considered a 'good person' if they follow the 7 Noahide laws (no adultery, murder, thieving, etc.). Jews have to follow a lot more laws to be considered a 'good person'.\n\nGetting back to the point.....saying '\"our card' will diminish with every generation' is just sick. You are saying that Jews are using the 6 million murdered in the Holocaust to justify our Nazi-like behavior. You are a sick, evil, perverse \"person\" and deserve nothing but misery.", "score": 5, "send_replies": true, "subreddit": "nottheonion", "date_year_month": "2019-05", "created_utc_converted": "2019-05-03 22:54:06", "score_overall": 7, "words": "jewish jewish jewish kosher jew jewish holocaust", "shared_words": "jewish kosher jew holocaust", "socre_distint": 4}
{"author": "The_Nunnster", "body": "Ban me then, I don’t give a crap. I found this sub and thought it would be a good way to vent my anger about unfair treatment of white people, but is instead rife with lowlifes like you that worship an ideology that should have died along with Hitler in 1945. And what’s with the anti-Semitic slurs? I’m Protestant, not Jewish so calling me a kike won’t do jack shit. And unless you can provide evidence about how evil Jews are, maybe they slaughtered 6 million Germans, then I will end this conversation. In the mean time here is a list of atrocities committed by your swastika waving heroes:\n\nGerman mistreatment of Soviet prisoners of war — at least 3.3 million Soviet POWs died in German custody, out of 5.7 million captured; this figure represents 57% POW casualty rate.\n\n\nLe Paradis massacre, May 1940, British soldiers of the Royal Norfolk Regiment, were captured by the SS and subsequently murdered. Fritz Knoechlein was tried, found guilty and hanged.\n\n\nWormhoudt massacre, May 1940, British and French soldiers captured by the SS and subsequently murdered. No one was found guilty of the crime.\n\n\nLidice massacre after assassination of Reinhard Heydrich in 1942, when the Czech village was utterly destroyed, and inhabitants murdered.\n\n\nArdenne Abbey massacre,[24] June 1944 Canadian soldiers captured by the SS and Murdered by 12th SS Panzer Division Hitlerjugend. SS General Kurt Meyer (Panzermeyer) sentenced to be shot 1946; sentence commuted; released 1954\n\n\nMalmedy massacre, December 1944, United States POWs captured by Kampfgruppe Peiper were murdered outside of Malmedy, Belgium.\n\n\nWereth massacre. 17 December 1944, soldiers from 3./SS-PzAA1 LSSAH captured eleven African-American soldiers from 333rd Artillery Battalion in the hamlet of Wereth, Belgium. Subsequently, the prisoners were shot and had their fingers cut off, legs broken, and at least one was shot while trying to bandage a comrade's wounds.\n\n\nGardelegen Massacre of April 1945 when Nazi concentration camp prisoners were herded into a barn, which was then set alight, killing all inside\n\n\nOradour-sur-Glane massacre\n\n\nMassacre of Kalavryta\n\n\nUnrestricted submarine warfare against merchant shipping.\n\n\nThe intentional destruction of major medieval churches of Novgorod, of monasteries in the Moscow region (e.g., of New Jerusalem Monastery) and of the imperial palaces around St. Petersburg (many of them were left by the post-war authorities in ruins or simply demolished).\n\n\nThe campaign of extermination of Slavic population in the occupied territories. Several thousand villages were burned with their entire population (e.g., Khatyn massacre in Belarus). A quarter of the inhabitants of Belarus did not survive the German occupation.\n\n\nCommando Order, the secret order issued by Hitler in October 1942 stating that Allied combatants encountered during commando operations were to be executed immediately without trial, even if they were properly uniformed, unarmed, or intending to surrender.\n\n\nCommissar Order, the order from Hitler to Wehrmacht troops before the invasion of the Soviet Union in 1941 to shoot Commissars immediately on capture\n\n\nNacht und Nebel decree of 1941 for disappearance of prisoners\n\nBombing of Wieluń, a town where no targets of military value were present\n\nNot to forget the supposed conspiracy known as the holocaust, where six million innocent Jews were taken from their families and slaughtered, but to you no Jew is innocent right? Just like, how to me, no Nazi is innocent but you would describe me as being a violent leftist, despite me being a conservative. Have a good day.", "score": 1, "send_replies": true, "subreddit": "SubforWhitePeopleOnly", "date_year_month": "2019-05", "created_utc_converted": "2019-05-04 09:10:21", "score_overall": 5, "words": "jewish merchant conspiracy holocaust jew", "shared_words": "jewish merchant conspiracy holocaust jew", "socre_distint": 5}
{"author": "gordo65", "body": "This article is simply anti-Semitic propaganda. There is not even a pro forma attempt to pretend that it is a defense of free speech or a criticism of Israel. A couple of highlights:\n\n* Jew-friendly law \n* \\[Jews are\\] a group so obnoxious that they need laws passed to stop any criticism\n* “Myths” about a Jewish world conspiracy are really “facts” and have been since the first time Henry Ford enumerated them in his 1920 book “The International Jew” (NOTE: Henry Ford was a Nazi. Hitler kept a portrait of Ford next to his desk, and awarded Ford the Grand Cross of the German Eagle, the highest honor that Nazi Germany bestowed on foreigners. Ford's book \"The International Jew\" was actually titled \"The International Jew: The World's Foremost Problem\". \n* Exaggerating the Holocaust by Jews is undeniable \n*  Jewish judges and their ideological allies control the U.S. court system \n*  Americans are being assiduously herded into a mental prison from which they will no longer be able to make capable decisions about their lives because of all the false information they have been surreptitiously force fed over the last one hundred years. All fed from the same source of Jew-controlled media \n*  Jew-sucking Florida legislature \n*  Facebook, YouTube, PayPal and other Jew-centric Internet carriers \n\nBy linking this article, [u/creature666](https://www.reddit.com/user/creature666), you reveal yourself to be an outright Nazi. Thanks for clearing up any doubts that people may have had.", "score": 1, "send_replies": true, "subreddit": "AmericanPolitics", "date_year_month": "2019-05", "created_utc_converted": "2019-05-04 22:44:00", "score_overall": 11, "words": "jew jewish conspiracy jew jew jew holocaust jewish jew jew jew", "shared_words": "jew jewish conspiracy holocaust", "socre_distint": 4}
{"author": "soundsliketoothaids", "body": "&gt;Bullshit, I have never heard of Jones saying or implying anything against Jews. One call-in tried to blame Jews for something and he pretty much shut that line of thinking down saying there are many kinds of Jews, Liberal, Conservative and that blaming them for anything is irrational.\n\nJones is absolutely a low-key white supremacist. He is just smart enough to build a career out of knowing he doesnt have to name the Jews explicitly, because his anti-semtic audience either picks up his code, or will eventually learn it and be on-roaded to full on white nationalism. He had a friendly, buddy-buddy interview with David Duke,  he quotes from None Dare Call it Conspiracy and the Protocols of the Elders of Zion, and re-uses bullshit conspiracy theories about adrenochrome to rehash accusations of Jewish blood libel. He tells people that the globalists want their children to kill them and rape them (more blood libel), refers to them as vampires that want the blood of their children (again, blood libel), and say that 'globalists' control the media and the Federal Reserve. Its the same old same old. \n\nHis two wives are Jewish, and his kids are Jewish by birth, but he his entire income is based on using old anti-semetic tropes with a word/replace of the word Jew with Globalist.   When his white supremacist callers say something that is openly anti-semetic, he shuts them down because they are blowing his cover and cutting into his sales; he has ground bone powder and boner pills to sell, after all.", "score": 1, "send_replies": true, "subreddit": "AskALiberal", "date_year_month": "2019-05", "created_utc_converted": "2019-05-05 11:14:58", "score_overall": 10, "words": "conspiracy conspiracy jewish libel libel libel jewish jewish jew globalist", "shared_words": "conspiracy jewish libel jew globalist", "socre_distint": 5}
{"author": "whatsawaffle", "body": "ESH. Oh boy.\n\nShe's an asshole for saying that it's okay to murder Palestinian civilians. It's a massive human rights violation and it's disgusting to justify the position because Jews have been historically persecuted.\n\nYou're an asshole for accusing her of playing the \"Jew card\" and gatekeeping. She's Jewish--she doesn't have to go to shul, she doesn't have to keep kosher, she doesn't have to be related to Holocaust survivors. You spend so much time in your post explaining that she's not Jewish enough, when that's not a thing.\n\nYou owe her a sincere apology for your comment, even though you don't have to acknowledge that her despicable position has any merit.", "score": 45, "send_replies": true, "subreddit": "AmItheAsshole", "date_year_month": "2019-05", "created_utc_converted": "2019-05-05 20:01:37", "score_overall": 5, "words": "jew jewish kosher holocaust jewish", "shared_words": "jew jewish kosher holocaust", "socre_distint": 4}
{"author": "summoneren", "body": "You don't have to answer everything, I wrote a shitton. If there is something you feel like you already rebutted properly, just fuck it. I am enjoying the discussion. Trying to learn as much a possible.\n\n&gt;You added some nonsense about power. I was then refuting that part.\n\nWrong. I used the google definition for conspiracy theory, conspiracy and conspire.\n\n&gt;Oh. How official and well read you are. lol\n\nYou don't like that Wikipedia has the same definition as the first google suggestion? Sorry about that.\n\n&gt;Just like using the term dogwhistling.\n\nI sent you the first pop-ups of the definitions, if you don't like them, that's all you.\n\n&gt;Conspiracy theories can one day be proven right like the NSA leaks show. Dogwhistles never can.\n\nWrong. Just because dogwhistling in of itself can't be evidence, there is several ways to give to get to the truth. For example, the person dogwhistling could admit it, purposely or on accident.\n\nNot sure if I should address everything you write here, since I already explained most of it, like:\n\n&gt;No evidence? Then there is no guilt. If there is no evidence of guilt, we presume innocence and that the one laying the charge without evidence is false. Our society has no place for garbage, I mean rapists, like you. ;)\n\nWe use inductive reasoning. We look at patterns and probable outcomes and behaviors. Something can be likely and more likely the more information we gather. If I keep posting pro-ish rapist posts, but never admit I am a rapist. We could still find it highly probable that the likelyhood of me being a rapist is high. Maybe even calling me out or setting me in the spotlight could prevent a rape. I would never support someone calling out dogwhistling without reasonable doubt. But there is indeed cases where it is obvious to one person, whilst the opposition would deny.\n\nFor example. Nick Fuentes denies the amount of Jews getting killed and/or gassed during the holocaust. However, he never stated that. He changed the word Jew with cookies, and the word killed/gasses with baked. Nevertheless, what could we blame him for? The denial of 6 million cookies getting baked?\n\nBtw, new to the reddit-game. How do I link with comments? For example making Nick Fuentes above clickable so I could show the video. Thanks in advance!\n\n&gt;We know there are rapists and pedos in powerful positions but that doesn't mean pizzagate itself is real.\n\nMaybe, this is news to me. Could you give me a source? Genuinely interested.\n\n&gt;No, I don't think you do. As I will show. Because if you did, you would have backpedaled much, much faster.  \n&gt;  \n&gt;You mean there was no evidence?\n\nNo reason for me to backpedal an inch.\n\nI discussed inductive reasoning. As we agreed on. We know dogwhistling is a thing. People use it so they won't be held accountable. I cover this in the next part of the response. If someone don't share views, positions or similar talking-points with a Nazi, that person is unlikely to ever use dogwhistling for nazism.\n\n&gt;It has the same probability for a alt-right (that are for white nationalism, Jews not being white in their theology) to contain a Jew, an avid cap wearing Jew. In fact, it is much, much more probable that you are a molester than a cap wearing Jew to be alt right, who hate Jews.\n\nThat's the great thing about america. We have black people, jewish people and other mixes of people admiring white nationalists. Someone like Nick Fuentes, which would not count as a \"white person\" a hundred years ago, consider himself white enough to fight for a white ethnostate that he himself, according to himself, barely would get into. The probability is not about how you look, it's about what you say and what ideas you bring.\n\nYou do agree that a black person can be racist against black people, and a white person can be racist against white people? Like several insane SJWs do.\n\n&gt;Sure you do.And you get yourself in a bit of a quandary here. What is the alt-right? My understanding: evil is the racist white nationalism that identifies as alt-right. They hate jews, like Shapiro. What exactly is the alt-right and what do they believe? Because if you are saying ANY ideas are shared, that is retarded, you are calling all right altright which makes the term useless.\n\nMaybe I do. But you would not know any of them. If you do, come with some examples.\n\nWhat quandary? The alt-right is (in the US) an ideological grouping associated with extreme conservative or reactionary viewpoints, characterized by a rejection of mainstream politics and by the use of online media to disseminate deliberately controversial content. The name itself derived from  american white nationalist Richard B. Spencer's *The Alternative Right,* who was influenced by earlier forms of American white nationalism.\n\nA Jew like Ben Shapiro still could hold at least borderline alt-right beliefs, and his work could reinforce the far-right spot in the US. For ex; normalising talking points.\n\n&gt;Frankly that is what all child molesters say.  \n&gt;  \n&gt;In fact, a child molster would want to dilute the term and not type the whole thing. They would want to abriviate it. ;)  \n&gt;  \n&gt;And yes this is all absurd. No less absurd than dogwhistling in general. I am just using the dogwhislting nonsense back on you, hopefully so you can reflect with that mirror.\n\nI don't follow your logic, and you seem to know an awful lot about CM. Btw, trying to make my sentences shorter. Sorry about that.\n\nDogwhistling nonsense? Have we not already established that it exists and is a real thing? We both agree that it's a shit thing to do, and it's a shit thing to call someone out for without reasonable doubt, signs or indications. I am saying there is cases where we use inductive reasoning, collect prior signs, information and clues to strengthen that position. Maybe one could stop a person from spreading more hatred and misinformation by calling them out when dogwhistling. Look at the example with Fuentes.\n\n&gt;Just like conspiracy theorists. They all have their patterns, their probable evidence. You are probably a child molester after all it seems. You are disgusting and should be a pariah.\n\nSucks to repeat myself, but most probable is what I have said repeatedly. We gather what we can and try to arrive at the most probable conclusion. Once again, trying to claim that I am a dogwhistler holds no merit, at least in my eyes, as you fail to include or show any prior/current indication of me might being one.\n\n&gt;Define support? Champion the CM cause? Or just talk to them about it?\n\nIf some of my friends were indirectly associated with CM groups, or some of them tried to remove the taboo from the topic etc, and I never tried to stop them or told them it was wrong and even dwelled into hearing their positions on why they don't disavowed it etc.\n\n&gt;Well you do. There are too many fo them accross society for you not to.  \n&gt;  \n&gt;You see, you need to attack the disgusting ideas themselves instead of using dogwhistles. Alt-right if you mean the neo-naxi/white supremists/white nationalists are disgusting on the racism the espouse. But I apple that same to black supremacist movement. Both sides are disgusting. There are feminists that have been exposed in PoundMeToo, are all feminists rapists? When disagreeing with a philosophy, instead of telling others they are in it through underhanded and retarded ad hominem arguments like dog whistling, just go after the arguments.\n\n\" But I apple that same standard to BLM as a black supremacist movement\", good. We all should. Though BLM has statistically been peaceful. Google it. But I agree.\n\nI mostly look at these cases as individuals. Not sure if it's ever a good decision to brand large groups as specific things, unless it is a supremacist movement etc, regardless of race ofc. Ad-hom is directed against a person rather than the position they are maintaining. I don't see how dogwhistling would fall under that, but sure. If we just throw out dogwhistling whenever we feel like it, it would lose value.", "score": 0, "send_replies": true, "subreddit": "LouderWithCrowder", "date_year_month": "2019-05", "created_utc_converted": "2019-05-06 19:23:29", "score_overall": 11, "words": "conspiracy conspiracy conspiracy holocaust jew jew jew jew jewish jew conspiracy", "shared_words": "conspiracy holocaust jew jewish", "socre_distint": 4}
{"author": "PosadismWillWin", "body": "&gt;&gt; Are the Kochs acting \"Jewish\" when they engage in nepotism and self interest? Would be odd for self-proclaimed libertarians and descendents of Nazis themselves.\n&gt;\n&gt;It's not quite the same behavior, as Jews are racial nepotists. I'm not aware of any Koch-funded pro-white lobbyist groups.  \n\nI mean, their agenda certainly doesn't conflict with the white nationalist agenda. They have their hands in every right wing and libertarian pot that exists. Their rhetoric is just as pro-white in the veiled, socially acceptable way that you could say Jews' efforts are anti-white. As in, not explicitly, but implicitly in the way it skews in favor of their own in-group. \n\n\n&gt;&gt;That is until the bigotry eventually comes out.\n&gt;\n&gt;Tomato, tomahto. Immigration and feminism only benefit corporations and financiers, er, \"rootless cosmopolitans.\"  \n\n\nThat's hysterical, how so?\n\n&gt;&gt;That's very different from the white supremacists who frown on mixed race marriage as a concept, denigrating people they don't even know for taking part in it.  \n&gt;\n&gt;In this video she's telling this to some German tourists - strangers. And in the Jewish mind, there are only two real races - Jew and goy. Someone who doesn't like to see black-white couples on the street might not give a damn about some labradoodle, and goyim are seen as dogs themselves. One particularly hateful Jew, Greg Lansky of BLACKED.com, produces interracial porn - at a loss - as a sort of racial humiliation.\n\n\nOne crazy Jew doesn't equal a conspiracy", "score": 1, "send_replies": true, "subreddit": "DebateAltRight", "date_year_month": "2019-05", "created_utc_converted": "2019-05-06 20:39:45", "score_overall": 7, "words": "jewish jewish jew goyim jew jew conspiracy", "shared_words": "jewish jew goyim conspiracy", "socre_distint": 4}
{"author": "Tanglefisk", "body": "You ain't kidding.  This one is called ['The Secret Holocaust'](https://www.amazon.com/Secret-Holocaust-34-pages/dp/B005KKIEHQ/ref=sr_1_41?m=A2S4QSON8UHVB4&amp;marketplaceID=ATVPDKIKX0DER&amp;qid=1557241323&amp;s=merchant-items&amp;sr=1-41) and it seems to be a combination of holocaust denial and standard Jews control the world crap.  \n\n&amp;#x200B;\n\nThe title says it all on this one: '[Satan's Kids: Fact every American Christian should know about the international Jewish conspiracy to control you and the world'](https://www.amazon.com/Satans-kids-Christian-international-conspiracy/dp/B00073CMP6/ref=sr_1_46?m=A2S4QSON8UHVB4&amp;marketplaceID=ATVPDKIKX0DER&amp;qid=1557241323&amp;s=merchant-items&amp;sr=1-46)\n\n&amp;#x200B;\n\nI mean, they've got 72 pages of books for sale.  If you've got that many, you'll probably include a couple of anti-Jewish conspiracy books just by probability alone, right?", "score": 3, "send_replies": true, "subreddit": "behindthebastards", "date_year_month": "2019-05", "created_utc_converted": "2019-05-07 15:14:18", "score_overall": 10, "words": "holocaust holocaust merchant holocaust jewish conspiracy conspiracy merchant jewish conspiracy", "shared_words": "holocaust merchant jewish conspiracy", "socre_distint": 4}
{"author": "RussianSkunk", "body": "&gt; Oh no! Holy shit!. Scary paths?? Terrifying.\n\nYeah, weeding out who is a \"real Jew\" and who isn't based on their support for a modern state seems pretty fucky. Do I really need to spell out why this isn't an okay thing to do? And for someone who was talking about biological Jewishness a few hours ago, that seems like a weird path to take.\n\n&gt; Not EVERY socialist is, but how are those that aren't different?\n\nSimple, those who aren't embrace their Jewish neighbors and support their right to exist. This doesn't mean they support their right to establish an ethnostate though, particularly at the expense of others who live there. \n\nIf someone opposes zionism but is perfectly accepting of Jews in any other context, then I'm sorry, but I just don't see the opposition stemming from their hatred of Jews. I imagine the core factor at play there must be something else. Is it possible that they were unknowingly influenced by people who do hate Jews, or that they have some unexamined subconscious biases? Certainly. After all, most forms of bigotry aren't as obvious as putting on a white hood or shouting slurs. But I don't think \"they're antisemitic\" is a good enough answer for confronting antizionism as a whole. \n\n&gt; BDS is so notoriously antisemitic - spend a few minutes perusing Canary Mission to see how frequently young BDS leaders (and old) praise Hitler, deny the holocaust, threaten Jews, praise Jew killers, etc etc.\n\nI haven't looked, but I'll take your word for it. Those things are terrible, and I do not support doing them.\n\n&gt;Antisemitism is integral to antizionism. Otherwise why is one always found with the other?\n\nNot always. It's much rarer than the \"kill em all\" types, but I do come across some open antisemites who support zionism because it gets Jewish people out of \"their\" country. Typically these are the \"nice\" ethnic cleansers who just want all the black people to go to Africa, Latinos to Latin America, and so on. This outlook isn't so common though, since they typically believe that there's some vast Jewish conspiracy and simply shipping Jewish folks elsewhere isn't enough.\n\n&gt; just as you can't strip the Judaism out of Israel or Zionism, you can't strip out antisemitism from antizionism\n\nA good test, I think, is to substitute in different ethnic groups and see if anything changes. Is it the right of every ethnic group to have a state of their own? You might say \"Yes, but only in their historic homeland.\" To that, I defer to another comment of yours:\n\n&gt; But if you go far back enough, who IS indigenous. Native Americans? Nope, they crossed the Bering. Swedish ppl? Nope, they were Syrian farmers that immigrated 8,000 years ago. But ppl's are considered indigenous where their whole creation ethos, which every culture has, took place.\n\nI agree with the first part of this statement, but disagree with the conclusion. No group is ever really indigenous to a region. Ethnic groups themselves are a social construct, and one's home is a fluid concept. \n\nAt any rate, I do not support *any* state built around the concepts of ethnicity or religion. White nationalists like to say \"Why is it everyone can have a state except for white people? You wouldn't tell Japan or Uganda that they have to be multicultural.\"\n\nIgnoring the fact that even countries like Japan aren't homogeneous, I would indeed tell those countries that they should to be multicultural. There's a difference between opposing colonialism and opposing integration. I support the concept of Indians overthrowing the Raj, but oppose Hindu nationalists who would deny citizenship to Brits. Similarly, I support the right of Jews to move to Palestine if they please, but using state powers to supplant the locals is a no no. And the idea of Palestinians barring Jews from entering their territory is horrid. So if you want to charge me with destroying all human culture and identity or something (which, ironically, is what white nationalists accuse all those globalist commie Jews of doing), I can roll with that. \n\nPreferably, I would like to see a one state solution in which people of all ethnicities and religions are given the same protections and opportunities. Obviously, that's a total pipe dream considering the animosity in the region. I'm under no pretenses that Palestinians would enter into peaceful coexistence with Israelis if given the opportunity. To be honest, it seems like this is a situation that cannot be unfucked anytime soon. \n\n&gt; I'm not exactly certain that that's my implication- maybe if you were more specific?\n\nImperialism, colonialism, and/or ethno-nationalism.\n\n&gt; Btw were you gonna acknowledge the links I mentioned between socialists like Corbyn and Tlaib and right-wing extremists, or were you just gonna ignore my question?\n\nI don't know enough about either of them to make a strong statement (I'd actually never even heard of Tlaib until now). However, it's hard to trust your judgement call on any of them, considering what your criteria are for concepts like \"antisemitism\", \"right-wing\", or \"Nazi\". I looked up the criticism of Tlaib though and strongly condemn Farrakhan’s comments about Jews. It seems like she still supports him(?) which is no good. Anyone who goes beyond criticizing zionism and attacks Jews as a whole is no comrade of mine. \n\nAt the same time though, heroes don't exist. I've yet to find a single person throughout history who I can unequivocally support. Everyone has something shitty about them that you aren't going to agree with, the challenge is figuring out exactly where you draw the line. You also have to figure out how much guilt by association is too much. Wouldn't it be silly to consider zionists intrinsically linked with terrorism because of attacks by Irgun? Or to call Hitler a Zionist because of the Haavara Agreement? Anyway, this isn't to say that I'm not willing to cancel Corbyn or Tlaib, just that I don't know enough yet to do so.\n\nTo change the subject just a tad, I read a book recently about the US's involvement with the creation of Israel. It's called *Against Our Better Judgement* by Alison Weir. The book made me pretty uncomfortable, as a lot of stuff discussed sounded like conspiracy theories. It makes some pretty extreme claims, and even though literally half of the book is footnotes with thorough sourcing, I understand that sources can be cherry picked or are otherwise unreliable. I'm planning on trying to find some critiques of the book, I was just curious to see if you've heard of it or the author to give me somewhere to start.\n\nEdit:\n\n&gt; As for early Israeli socialists - all the early racism in Israel was all socialists. All the shabby treatment of Mizrahi Jews... The Ethiopian babies... all that done under socialists. You ppl are intrinsically racist.\n\nMan, I wish I would have seen this comment before I bothered writing all this. Fucking hell.", "score": 3, "send_replies": true, "subreddit": "LateStageImperialism", "date_year_month": "2019-05", "created_utc_converted": "2019-05-08 09:11:22", "score_overall": 10, "words": "jew jewish holocaust jew jewish jewish conspiracy jewish globalist conspiracy", "shared_words": "jew jewish holocaust conspiracy globalist", "socre_distint": 5}
{"author": "CarrotAlacrity", "body": "&gt; This is such bullshit. First of all, how about you don't call defense Israel's shooting of children, women, elderly, targeting humanitarian centers, schools, hospitals, homes for disabled people, ambulances trying to save the injured\n\nThis is pure fantasy and slander. In other words, the usual. And as usual, these things are all things Palestinians regularly do, and naturally, you are totally unbothered by it. Killing kids, women and weekly? Not only are these all Palestinian [traditions](https://mideasthistory.tumblr.com/post/183282813800), whether it be [decapitating sleeping babies](https://www.ynetnews.com/articles/0,7340,L-4041237,00.html) or [machine gunning crowds of schoolgirls](https://en.m.wikipedia.org/wiki/Ma'alot_massacre) or the 80 year old man murdered this week, this type of wanton murder is a Palestinian specialty.\n\nOnly while Israel never targets civilians, Palestinians actually *reward* the \"heroes\" who do this with cash pensions and [other honors.](https://www.haaretz.com/amp/1.5177456). This type of glorification of murdering civilians is [central to Palestinian culture.](http://www.israelnationalnews.com/News/News.aspx/227563). Doesn't seem to bother you unless you can smear Jews as having done this. Care to explain this double standard? Palestinian Pay For Slay explicitly incentivizes and rewards these types of murders.\n\n &gt;all that explained by the UK parliament  and by Amnesty intenational-&gt; 1, 2,  3 or 4) \n\nNeither of which are even remotely credible. Amnesty openly hires BDS activists while fraudulently calling themselves \"independent observers\".  They literally sell Israel Bashing services to wealthy Gulf Arabs. That's how they make their money, by [selling antisemitic campaigns.](https://www.camera.org/article/amnesty-internationals-latest-anti-israel-campaign-targets-jewish-tourism/). They are a joke of an org, that spends time [teaming up with holocaust deniers](https://www.algemeiner.com/2019/02/21/amnesty-international-campus-group-torpedoing-creation-of-jewish-society-at-university-of-essex-students-say/)to protest new Jewish student groups, etc. \n\nAs for the Labour MP speaking to parliament [well...](https://m.huffingtonpost.co.uk/amp/entry/labour-antisemitism_uk_5a3a6b66e4b0df0de8b0612f/). \n\n&gt;Moreover when you occupy a country, \n\nWhat country does Israel occupy? None. Not one Jew in \"occupied\" Ramallah or \"occupied\" Nablus, \n\nMeanwhile the Palestinians have most of the west bank and Gaza despite openly stating they [never had a claim to these territories.](http://www.palwatch.org/main.aspx?fi=640&amp;doc_id=8210). They're occupiers by definition.  Plus Jordan illegally annexed the West Bank and East Jerusalem in 1950, then illegally gave it ti the [PLO in 1988](https://www.nytimes.com/1988/08/01/world/hussein-surrenders-claims-west-bank-plo-us-peace-plan-jeopardy-internal-tensions.html). How are the Palestinians NOT the occupiers?? They ethnically cleansed every single Jew out, just as occupiers do.\n\n&gt;violences and slaughter in order to maintain that occupation do not qualify to dictionnary's definition of \"defense\". \n\nOh good so you agree that decapitating sleeping babies and murdering innocent civilians isn't self defense... Again, [violence and slaughter](https://mideasthistory.tumblr.com/post/183504939710/in-august-1928-arabs-poured-into-jerusalem-in) are [Palestinian traditions.](https://mideasthistory.tumblr.com/post/183452343920/robbery-marauding-murder-and-rape-how-arabs)\n\n&gt;Thanks for keep talking about anti-semitism and Judaism, proving that defending Israel is impossible so you have zero argument and are left with saying \"anti-semite!\"\n\nSo you're ignoring all my detailed responses and pretending that all I do is scream antisemite? So in lieu of an actual defense, you lie compulsively.\n\nYou think we care that you're antisemites? It's not that bothers us. There are one billion antisemites on earth. One more is nothing new. Every Jew on earth is long resigned to your existence. It's more your compulsive lying, conspiracy theories and falsely accusing Jews of what the Palestinians openly do that we find so repulsive.  What you falsely accuse the Jews of, the Palestinians literally [brag about doing.](https://youtu.be/LVWL9VWdXc4).\n\nLet's return to the violence and murder thing you pretend not to support... I can do the demonization thing too...\n\n[89% of Palestinians oppose homosexuality.](https://ukmediawatch.org/2018/12/26/despite-media-narrative-palestinians-are-far-from-woke/)\n\nPalestinian [racism](https://businesstech.co.za/news/lifestyle/116644/the-most-racist-countries-in-the-world/amp/) and [Antisemitism](https://www.pewglobal.org/2010/02/04/chapter-3-views-of-religious-groups/) both sky-high. \n\n[Under the Ottomans the Jews were ethnically cleansed so often, most instances are totally unknown. This was how they keep the Jewish population low in number, isolated, poor and vulnerable.](https://mideasthistory.tumblr.com/post/183502162390/ethnic-cleansing-of-jews-was-so-common-in-ottoman)\n\n[Arabs murder 69 doctors, nurses and patients in Hadassah convoy massacre.](https://en.m.wikipedia.org/wiki/Hadassah_medical_convoy_massacre)\n\n[Fedayin raids in the 1950s kill thousands of Jewish civilians.](http://www.jewishagency.org/maps/content/35936)\n\n[Park Hotel Massacre- 30 ppl killed and 170 wounded when Palestinians blow up Seder at hotel.](https://en.m.wikipedia.org/wiki/Passover_massacre)\n\n[Hamas leader says that they use child soldiers bc it's win-win. Either they kill Jews, or they get killed and it's a PR victory.](https://www.palwatch.org/pages/news_archive.aspx?doc_id=25914)\n\nPalestinian television teaches racist hate that make israel's \"most notorious racists\" sound like Mr Rogers. Look at the quotes the poster I'm replying to posted then [watch this.](https://youtu.be/e2MMjc8ZXlI)\n\n[Palestinians very open about their plans to force all Jews out of Israel when they take over.](https://youtu.be/cJkxOF9QqEk)\n\n[Palestinian hero Ahlam Tamimi smiles widely upon learning she killed 8 children, not 3 as she previously thought.](https://youtu.be/xLXAwETtu0Q)\n\n\"Muslims and Jews lived peacefully before Zionism\".. [Pure fantasy.](https://mideasthistory.tumblr.com/post/183283972610/muslims-and-jews-coexisted-before-zionism)\n\n[Palestinian child](https://mideasthistory.tumblr.com/post/183284116930) during last year's stabbing Intifadah.\n\n[Unlike the Palestinians the Jews bought their land.](https://mideasthistory.tumblr.com/post/183332156395/while-the-british-were-handing-out-formerly-jewish)\n\nThere's never been an Arab Palestine. [Report from British Naval Intel re this issue.](https://mideasthistory.tumblr.com/post/183341994920/theres-never-been-an-arab-palestine-this-book)\n\n1886 - [Arab Palestinians openly allow their farm animals to graze on starving Jews' last crops,](https://mideasthistory.tumblr.com/post/183501185660/how-the-arabs-of-palestine-welcomed-jewish) assault them when they complain. \n\n[Ottomans frequently allowed the stands to attack Jews and steal all their property, incl land deeds. Jews were often taken as slaves.](https://mideasthistory.tumblr.com/post/183502250230/the-ottoman-bey-not-bae-in-palestine-created-a)\n\n[Every corner of Arab world sends Hitler congratulations upon his passing of Nuremburg Laws.](https://mideasthistory.tumblr.com/post/183506093200/upon-introducing-the-nuremberg-laws-in-1935-hitler)\n\n[May, 1937 - Arab Palestinians march carrying placards of Hitler and Mussolini.](https://mideasthistory.tumblr.com/post/183506985760/every-now-and-then-youll-hear-someone-like-red)\n\n[Anglo-American Committee member admits he's never seen a group as little affected by immigration as the Arabs of Palestine.](https://mideasthistory.tumblr.com/post/183507453190/just-this-week-ive-heard-bds-drones-say-things)\n\n[Arab response to mere proposal if partition - murder of hundreds of Jews.](https://mideasthistory.tumblr.com/post/183508068405/the-arab-response-to-the-mere-proposal-of)\n\n[Arab Liberation Army comprised of Nazi SS, Spanish Falangists, Polish Anders Army, etc..](https://mideasthistory.tumblr.com/post/183508139000/the-arab-liberation-army-was-made-up-of-volunteers)\n\n[Seven Arab armies attack Jewish forces that were pathetically low armed and under staffed, etc](https://mideasthistory.tumblr.com/post/183508478965/when-seven-arab-armies-including-the-only)\n\n[Arabs very open about intent to commit genocide in 1948.](https://mideasthistory.tumblr.com/post/183508898470/the-arabs-were-very-open-about-their-intent-to)\n\n[UN reports on Israel commonly knowingly present known Hamas militants as civilians.](https://legalinsurrection.com/2019/03/meet-some-of-the-people-the-un-calls-civilians-killed-in-gaza-border-clashes/amp/)\n\n[After 1948 war an armistice with Jordan was hammered out, but the Arabs immediate started up with arson violence and murder.](https://mideasthistory.tumblr.com/post/183574052515/after-the-war-israels-border-with-jordan-was)\n\n[1960 - Gamal Nasser gets up in front of UNGA and brags that he will \"annul Israel's existence\".](https://mideasthistory.tumblr.com/post/183574491425/in-1960-gamal-abdel-nasser-spoke-to-the-unga-and)\n\n[Syria tries to divert Jordan river to keep water away from Israel.](https://mideasthistory.tumblr.com/post/183574608245/syria-tried-to-prevent-israel-from-drawing-water)\n\n[What Gaza really looks like.](https://youtu.be/_cEXz06SV2k)\n\n[Palestinian textbook commemorates Coastal Road Massacre, in which around 30 Israelis were murdered, including 13 children.](https://www.ynetnews.com/articles/0,7340,L-5161024,00.html)\n\n[Palestinian murders Israeli teen, rapes her.](https://www.timesofisrael.com/palestinian-charged-with-rape-and-murder-of-israeli-teen-ori-ansbacher/amp/)\n\n[Just as today, Arabs inflate casualty numbers 2,000 years ago.](https://mideasthistory.tumblr.com/post/184062922355/exaggerating-casualty-numbers-throughout-history)", "score": 0, "send_replies": true, "subreddit": "worldpolitics", "date_year_month": "2019-05", "created_utc_converted": "2019-05-08 10:42:11", "score_overall": 13, "words": "jewish holocaust jewish jewish jew jew jew conspiracy jewish jewish jewish jewish jewish", "shared_words": "jewish holocaust jew conspiracy", "socre_distint": 4}
{"author": "family_of_trees", "body": "&gt;given how vastly over represented jews are do you think we live in a jew dominated society?\n\nIf you can provide actual (non-illuminati conspiracy theorists) evidence that our society is overwhelmingly controlled by the jews then of course I would.\n\nThough as far as I know, our government officials are overwhelmingly white, male, and Christian. So I would have to say we live in a Christian dominated society instead.\n\n&gt;If men being 49% of the population and 77% of congress makes men dominant in society, does jews being 1.5% of the population and 9% of congress make our society jew dominated?\n\nCongress, presidency, senate, the legislature, the house of representatives, governers, mayors, police officers, police chiefs, the military, all of the various federal law enforcement agencies.... \n\nBut like I said, if you can prove the majority of those positions are held by jews, I would concede. Because there is a scale of magnitude difference in the sheer number of Christian males in power than Jewish ones. The US government is more Christian than male even. So I would say it's *definitely* fair to consider Christians a dominate force.\n\nOr you know, you can just keep hammering away about your jew example because it's supposed to be so edgy and offensive. \n\n&gt;If men holding 2/3 of USSC justices is evidence a male dominated society, does 1/3 of the supreme court being Jewish evidence the US a jew dominated society?\n\nI don't know if you missed this part of math class, but 2/3 is larger than 1/3. \n\n2/3 is a majority. 1/3 is a minority. This isn't a very good way to prove your point. \n\nNot to mention that what you were saying would make sense of the majority of the entire government was Jewish. Your example is just a single (smaller) branch of government, and they aren't even the majority of that!", "score": 2, "send_replies": true, "subreddit": "changemyview", "date_year_month": "2019-05", "created_utc_converted": "2019-05-09 02:49:14", "score_overall": 9, "words": "jew illuminati conspiracy jew jewish jew jewish jew jewish", "shared_words": "jew illuminati conspiracy jewish", "socre_distint": 4}
{"author": "OliCoon", "body": "You're a white supremacist/potential Neo-Nazi conspiracy theorist who thinks that the Jewish Illuminati are orchestrating a genocide of white people. You want white people to \"have the right to exist\", despite the fact that they already do, and even though you argue about how you are not a white supremacist and constantly say you \"don't blame the Jews for everything lol\", your posts seem to concern them quite a bit, and even makes usage of vocabulary such as \"k\\*ked\", \"oy vey\", \"goyim\", \"6 gorillion\", \"(((bankers)))\", and even looks like you've got some Holocaust denial in there for good measure. Hell, your very first post concerns the Jewish and Marxism, which coincidentally, a lot of white supremacists are extremely concerned with, despite the fact that it's long dead. You have also made usage of terms regarding mocking of African-Americans, such as \"Ooga booga n shieeet\" and \"If we had a superhero movie about an all white United Europe we'd be called white supremacists and neon nahtzeez n shieeet niqqa\". You also are adamant on how you don't like to be described as a Nazi/Neo-Nazi, yet you do say that you are sympathetic to ideas of Nationalism Socialism, also known as the Nazi party. Judging from the content of the rest of your posts, take a wild guess what that would make you, even if you don't identify as it. And, to put the cherry on top, your name contains the popular white supremacist/Neo-Nazi phrase \"1488\". 14 is the Fourteen Words slogan said by white supremacist David Lane, who would later be jailed for involvement in the murder of a Jewish radio host, and 88 stands for \"Heil Hitler\", and everyone and their mother knows damn well it doesn't stand for any 88 precepts or what year you were born. You can sidestep the meaning of what you say all you like, but nobody here is buying it, because the dogwhistles are quite evident, pal. You're an Antisemitic white supremacist loon, and God fucking bless you if you think you're anything *close* to a patriot.  \n\n\nOr, if I'm wrong, please feel free to point out the posts you've made that don't represent your views.", "score": 3, "send_replies": true, "subreddit": "ChapoTrapHouse", "date_year_month": "2019-05", "created_utc_converted": "2019-05-09 06:30:34", "score_overall": 7, "words": "conspiracy jewish illuminati goyim holocaust jewish jewish", "shared_words": "conspiracy jewish illuminati goyim holocaust", "socre_distint": 5}
{"author": "JeffB1517", "body": "&gt; I was talking about BDS.\n\nThen answered.  I'm not worried at all on BDS' impact on Israel.  Anti-Zionism has a long history of failure with respect to Israel.  Where anti-Zionism has a long history of success however is in destroying domestic Jewish populations and clearing them out of most of the planet.  So I am worried about anti-Zionism being the political cover and arguably motivation for profound antisemitism.  \n\n&gt; They aren’t promoting anti-semitism. At worst they’re promoting anti-Israelism.\n\nRight when left wingers attack Jewish events iit is totally political.  When rightwingers do it even with a stated political objective then it is antisemitism.  You simply make no sense on this issue.\n\n&gt; The source of anti-semitism, particularly in its most violent form, comes from the right-wing. \n\nOnly because you define it that way.  Be objective and that isn't true. ''\n\n&gt;  This is well established. \n\nBy whom?  At this point it is well established among most Jewish groups that the primary source of antisemitism is the left. \n\n&gt;  You should be directing your outrage at people promoting conspiracy theories about George Soros \n\nYou mean totally unlike the left's obsession with Sheldon Adelson and the Mercer's?  Your side doesn't have clean hands their either.  \n\n&gt; Source?\n\nShe's on the foreign relations committee.  Saudi Arabia has come up multiple times.  She has no problem speaking when she wants to diverge from USA policy on a host of issues.\n\n&gt;  No one within the movement interprets it as calling for extermination or enslavement. \n\nThey don't use those words.  They do however create apologetics for genocide.  They argue passionately for racial genocide and then claim to just be a human rights group.  If you want to argue that \"colonizer\" is passed on by birth then it is racial.  If you want to argue that \"colonizers\" are illegitimate inhabitants then you are arguing for genetic evil.  It is nonsense to pretend that a theory of racial evil is anything other than what it is.  BDS rhetoric implemented is genocide.  \n\nNow if you want to argue that BDSers are genuinely too stupid to identify their rhetoric as genocidal I'd partially agree.  I also think a lot of that comes from moral cowardice and dishonesty.  Let's take a good sample:\n\n*You guys are in invadeders in Palestine. The thing that must be eliminated is precisely “Israeli patriotism”, if you want to rename Zionism. ... An illegitimate “foundation” on other people’s land invaded by millions and millions of unauthorized intruders, come to plant a colony and make indignant noises when their offspring, like your good self, are reminded that colonization is not erased by the magic of being born there. Sorry bud, you’re not a local unless explicitly recognized by the collective of all Palestinians. Who authorized the invader to assume as a given an “equality” with the invadee who owns the country and the sovereignty on it?*\n\n&gt;  There isn’t a universal agreement about how to apply BDS. Folks within the movement disagree.\n\nYes and they disagree in both directions.  The Muslim kids who murder Jews in France have one interpretation.  The simply boycotters have another.  If all interpretations are equally valid then BDS is equally both.  If on the other hand we want to argue that the kids in France are not part of BDS then there are BDS committees which set standards.  And those standards become the agreed upon minimum of what BDS advocates.  \n\n&gt; , I’m sure this stance of “Well you can’t blame anti-semitism for the mass murder of Jews in the US because we’re just a sick country” will change the second any link to BDS is discovered. \n\nBDS are layers of well organized groups.  The proper comparison to BDS is something like violence from the Albanian Mafia not individual lone wolf mentally disturbed shooters.  BTW there have been many anti-Zionists synagogue attacks like https://en.wikipedia.org/wiki/2014_Jerusalem_synagogue_attack and BDS did not get the blame.  \n\n&gt; You could just as easily say morally pro-Israel people have no problem with murdering someone like Ilhan Omar. \n\nIlhan Omar is your obsession.  Pro-Israel people (AIPAC, AJC...) are handling her the same way they regularly handle anti-Jewish congresspeople for decades.  She is going to face well funded primary opponents every two years for a few cycles to drive up her negatives and she loses the general or primary within a decade.  She is not the first Jew baiter in congress the Jewish community has had to deal with and with BDS won't be the last. \n\n&gt;  you’ve promoted the same deranged conspiracies about Rep. Omar as the president\n\nWhat conspiracy have I promoted about her?  \n\n&gt; Who did you vote for btw?\n\nHillary voted and donated.  \n\n&gt; Would you be surprised if someone saw you say that, took it to heart, and then to it’s logical conclusion that something should “done” about these wicked and evil people?\n\nYou have got to be kidding me!  You argue the rhetoric of BDSers has 0 impact and then say that the anti-BDS rhetoric is a threat.  \n\nYes I would be surprised.  But if someone does take the rhetoric that way maybe they will learn to moderate their rhetoric and cut the extremism out.  That words can lay the groundwork for policy.  That they should be carefully measuring their words and tone appropriately.  But I'm having a hard time given your rhetoric even in this post taking your concern about it seriously.  \n\nThere could be a civil and reasonable dialogue regarding I/P.  Were it not for anti-Zionism the problem of Israel could be handled much like Catalonia or Quebec.  The primary reason people are getting killed in such vast numbers in the I/P conflict is Palestinians expect the world to intervene and reverse the historical outcome if they can just keep themselves on the agenda. So rather than dealing with the actual government that exists they keep trying to dialogue with marginal players who make promises they can't deliver on.  \n\nThat nonsense was stopped 20 years ago.  Between the left and right there was a reasonable discussion of the I/P 20 years ago.  Palestine Solidarity, BDS's predecessor, destroyed that by demonizing Israel and reintroducing   UN 3379 style rhetoric back into the discourse.  But there is no Soviet Union anymore.  There is no country which can even plausibly claim to be willing to go to war for Palestine accept Iran and they clearly don't have the power to deliver.\n\nThe people who choose to escalate the rhetoric in the USA is the left.  The right gets none of the blame. \n\n&gt; The right wing has a history of this.\n\nStalin, Pol Pot, Mao, Kim Il-sung / Jong‑il, Ranavalona...  As for organized political terrorism that's almost always the left. I'd say both sides have a history of this.", "score": 0, "send_replies": true, "subreddit": "IsraelPalestine", "date_year_month": "2019-05", "created_utc_converted": "2019-05-09 12:27:29", "score_overall": 9, "words": "jewish jewish jewish conspiracy cowardice jewish jew jewish conspiracy", "shared_words": "jewish conspiracy cowardice jew", "socre_distint": 4}
{"author": "nulom", "body": "\"Anti-Semitism\" as a Political Weapon\nBy Lasse Wilhelmson\n \n  \t\nCriticising Israel´s mistakes is acceptable. But questioning whether Israel is a Jewish state with a racist apartheid system that renders non-Jews second rate citizens - that is not acceptable. It makes little difference whether the criticism is based on facts. Few people who cannot claim Jewish descent would dare to criticize publicly. They are afraid of being accused of \"anti-semitism\".\n\nThere is much talk of disarming countries with nuclear weapons. Not the US and its allies, but the so-called 'rogue states', especially Iran, which doesn´t yet have any weapons. Israel is hardly ever mentioned as a nuclear power although it has been for a long time. In spite of its advanced plans to bomb Iran, Israel is not seen as a threat to the surrounding world. The media regularly criticizes severely various religions, especially Islam, but never Judaism. Catholic pressure through lobbying, or the Pope´s speeches on political issues are discussed and criticized. The fight in South Africa against the Boers involved a whole world. Not because they were a \"race\" with undesirable characteristics, but because they were the social group who in their own interests formed and administrated a racist apartheid system. The same sort of criticism was aimed at the followers of Cecil Rhodes in Rhodesia.\n\nAll types of social, ethnic and religious groups defend their own special interests. It is considered quite legitimate for their spokesmen to do their best to promote these interests; just as it is quite legitimate to criticize the same. But the moment Jewish spokesmen and their organisations are criticised, the legitimacy vanishes into thin air. The mention of \"Jewish power\" makes most people´s blood run cold, but it is quite alright to discuss \"gypsy power\" or rather the lack of it. \"Jewishness\" has become taboo. This applies particularly to the combination of \"Jewish\" and of \"power\" . All kinds of power can be examined and discussed, questioned or rejected - but not the Jewish kind which is generally presented as non-existent.\n\nThere is growing anxiety in the Palestinian movement in Sweden about using \"Jewish\" as a prefix to the settlements, the state of Israel or the apartheid system, albeit the use is quite correct. The settlements for example are \"Jewish settlements\" simply because only Jews are allowed to live there. They are not Israeli because non-Jewish citizens are forbidden access to them. Neither are they Zionist as many Zionists are not Jews. It has now got to the stage where a leading spokesmen for the Palestinians in Sweden denies that Jews and Palestinians have disagreements, despite the law giving Jews all over the world the right to return to Israel, thus making them potential enemies of the Palestinians. Having a Jewish mother gives the right to live in the country taken from the Palestinians. One would be hard put to find a more fundamental disagreement. The issue of blood-relationship renders it, moreover, racist.\n\nA reluctance to discuss Judaism´s significance for Zionism in Israel of today makes it impossible to understand why Israel was not content with fifty per cent, later eighty per cent, of Palestine. Or why a social democratic prime minister ordered his soldiers to break the bones of children throwing stones? And how can one understand why Jews in Jerusalem throw their garbage onto the roads and back yards of their Palestinian neighbours, spit at them, or why masked Jewish settlers during the \"cease fire\" launched pogroms on unarmed Palestinian farmers, women and children? Or why the Israeli \"peace movement\" and \"left\" do not question the Jewish apartheid system? Just and lasting peace can never be achieved without its transformation. Few people think that all this is a result of the Jews being an \"evil race\". But if it cannot be explained by any other means, the few risk becoming too many. A racially-based hate of Jews is helped along by the label of \"anti-semitism\" pasted on nearly all criticism of Israel, not to mention criticism of Judaism.\n\nZionism, through its Jewish organisations, is the dominant interpretation of Judaism today. This is a renaissance of national Judaism of the Middle Ages and the judicial system Halakha with its extreme animosity towards non-jews who were seen rather as subhuman. This revival is seen as very beneficial by most Jewish organisations worldwide. They demand of their members positive commitment to the state of Israel. This is the context in which the behaviour mentioned above can be understood. Most Jews in the diaspora are, however, \"happily\" unaware of this and are being used by their Zionist leaders and rabbis.\n\nPolitics and religion have merged in the state of Israel today. A person speaking out for a secular democracy to replace the Jewish state, is accused of, in fact, wanting to \"drive the Jews into the sea\". Most Jews today identify themselves not with Israel but with Israel as a Jewish state. This creates a fundamental contradiction for many Jews: supporting the Jewish apartheid state while promoting democracy in the countries where they actually live. Denying or whitewashing Israel´s politics, becomes a way of keeping one´s identity intact. Violent, groundless attacks with \"anti-semitism\" as a weapon is the method used against any attempt to lay bare this contradiction. A well known example is how Israel´s former ambassador to Sweden vandalised the art installation Snow White last year.\n\nThe risk of being labelled \"anti-semitic\" if you are not a Jew or of \"self-hatred\" if you are, creates self-censorship among those who are critical of Israel´s policies or dislike the successful lobbying carried out by Jewish and Christian Zionists, influencing US foreign policy. The so- called Friends of Israel, most of them spokesmen for Jewish organisations, have taken it upon themselves to be the foremost interpreters of the term \"anti-semitism\". Few question this role as they run the risk of being tainted themselves if they do. The term \"anti-semitism\" is taking on new nuances all the time. Of late the slightest implication, as in \"almost anti-semitic\" or an \"anti-semitic point of interest\" has been enough to invoke self-censorship. The mention of these circumstances is often felt to be \"dangerous\" as it could lead to the growth of \"anti-semitism\". All this in a western world where islamophobia is a considerably greater problem.\n\nJews are rightly proud of their success in almost all corners of society. In art and science and, not least, the media and politics. Israeli newspapers tell of the successful \"likudification\" of the Bush administration and delight in the fact that the Israeli minister for the diaspora is Bush´s new favourite author and pet in the White House. Russian oligarchs with Israeli citizenship take breakfast there. There is a culture of boasting about this among Jews. But should a critic of Israel point to these exact same circumstances, he would immediately be accused of spreading \"anti-semite theories of conspiracy\" and thus be barred from any further discussion.\n\nThe Jews have for many years had total entrepreneurship of \"God´s chosen People\" with a \"biblical right\" to Palestine. Zionism has been politically successful in reducing the Holocaust to Nazi war crimes against Jews. By presenting themselves as the major (the only?) victims in the history of humanity they expect to claim special moral rights. The method is used favourably to justify and cover up the genocide of the Palestinians. \"Anti-semitism\" is being used to stop criticism of Israel´s way onwards to achieve the Zionist goal of a Jewish state in the whole of Palestine. Before this goal can be realised, \"peace\" must be reached with the creation of a few Palestinian reservations on ten per cent of what was originally Palestine, walled-in and gradually wasting away. We are almost there now.\n\n*****\nLasse Wilhelmson was born in 1941 in Sweden. Part of Wilhelmson's family fled to Sweden from the Czar's pogroms during the 1880s. Some members of the family immigrated further to America and Palestine. Wilhelmson lived in Israel for several years during the early 1960s. He also published the article \"Israel Must Choose the Path of Democracy\" the 16th of September 2003 and \"More Than Traditional Colonialism and Apartheid\" the Feb. 16, 2004 in The Palestine Chronicle. Today he considers himself to be a Swede as well as an atheist, and all his family is assimilated. He does not accept being defined as a \"religious Jew\" just because his mother was Jewish.", "score": 1, "send_replies": true, "subreddit": "researches", "date_year_month": "2019-05", "created_utc_converted": "2019-05-09 18:54:37", "score_overall": 25, "words": "jewish jewish jewish jewish jewish jewish jewish jewish jewish jewish jewish jewish jewish jewish jewish jewish jewish jew jewish jewish conspiracy holocaust jewish jew jewish", "shared_words": "jewish jew conspiracy holocaust", "socre_distint": 4}
{"author": "ThatsNotDemocratic", "body": "You know perfectly well the negative tone of saying \"A Jew\", \"The Jew\", especially when connected with something negative already. And you also know perfectly well that him being jewish had nothing to do with the thing you were talking about. We also don't know if that person was jewish or not. So stop playing dumb. Because you see, that last paragraph,\n\n&gt;You guys are the definition of professional victims. You adopt the victimhood mentality in diapers and carry it around your whole life, letting it define you in all walks of life till the day you cease to exist.\n\ntold me everything I needed to know about whether it was intentional or not. It's literally the type of thing I've heard from open antisemites and them only. It's like that paragraph is seething with hate. What an amazing specimen I've found today!\n\nIt's actually pretty amazing how right I was and how telling that single \"The Jew\" was. Speaking of which, you've used the words like \"The Jew\" a lot in this thread. \n\nBut fine, let's take a look,\n\n[Mhm, interesting.](https://www.reddit.com/r/todayilearned/comments/6ma2yd/til_in_1935_to_verify_whether_cocacola_was_kosher/dk0ayp1)\n\n[Ah yes cause jews are greedy right? It could be a funny joke but not after seeing the rest of what you've said](https://www.reddit.com/r/todayilearned/comments/6ma2yd/til_in_1935_to_verify_whether_cocacola_was_kosher/dk0c92y)\n\n[Ohoho](https://www.reddit.com/r/Fuckthealtright/comments/6kxcft/fuck_that_racist_sub_and_all_the_racists_that/djpyfrl)\n\n[Bringing jews up out of nowhere, pretending as if communist massacres are somehow less relevant because of them. That ticks a couple of boxes.](https://www.reddit.com/r/pics/comments/5sa1id/when_jews_fight_alongside_muslims/ddhb7z4)\n\n[Not even pretending](https://www.reddit.com/r/conspiracy/comments/5izaas/voltaire_to_learn_who_rules_over_you_simply_find/dbcgio3)\n\n[Apparently, you have a pretty strong opinion on \"interbreeding with jews\"](\nhttps://www.reddit.com/r/facepalm/comments/4db8e3/crazy_jewish_mom/d1pmo0b)\n\n[\"Them jews are taking away muh freeze peach\"](https://www.removeddit.com/r/news/comments/2yjvy7/_/cpalshm/)\n\nBy the way, I hope you do realise that that article above (posted on an antisemitic conspiratard website) was misleading and he wasn't arrested for that? There is an explanation in the [removed comments](https://www.removeddit.com/r/news/comments/2yjvy7/_/)\n\n[You were implying something with this?](https://www.reddit.com/r/gifs/comments/5vmmb3/vice_president_mike_pence_made_an_unannounced/de3q3uc) By the way, the shock therapy part was apparently just a meme, I thought it was real too.\n\n[What an interesting detail, was that necessary or do you have something against jewish women specifically?](https://www.reddit.com/r/RedPillWomen/comments/2h8yip/ladies_shave_your_face/ckwijhj)\n\nAnd to top everything off...[literal holocaust denial](https://www.reddit.com/r/funny/comments/4jebr2/shoutout_to_the_dude_who_left_immediately_after/d36qwd6). That should be enough for you, right?\n\nBasically, try tricking someone else. I've seen people like you enough already, I know what you sound like.", "score": 1, "send_replies": true, "subreddit": "gifs", "date_year_month": "2019-05", "created_utc_converted": "2019-05-09 23:57:18", "score_overall": 9, "words": "jew jew jewish jewish jew jew conspiracy jewish holocaust", "shared_words": "jew jewish conspiracy holocaust", "socre_distint": 4}
{"author": "[deleted]", "body": "I don't know if I'd say *Racial* hatred is 2000 years old. Early anti-jew attitudes were primarily driven by religion.\n\nIt wasn't until the 1800s, racial hygiene, and radical social changes did anti-semitism primarily become racial in nature.\n\nFor example, from the book suspicious minds:\n\n&gt; Superstition and prejudice toward Jews dates back to the earliest years of Christianity. Saint John Chrysostom, a fourth-century preacher widely admired for his eloquence, eloquently denounced Jews as baby-killing devil worshipers. In 1215, Pope Innocent III was concerned that Christians might find themselves unwittingly having relations with Jews. His solution was to make Jews wear distinguishing clothing, leading to the yellow “badge of shame” that many Jewish people around Europe were required to wear throughout the Dark Ages—and again under the Nazis. A couple of decades later, Pope Gregory IX established the Inquisition, a formalized effort to prosecute heresy against the Roman Catholic Church, which eventually led to mass executions of Jews, among other accused heretics, and mass burnings of their holy books.\n\n&gt; According to the pious logic of some medieval theologians, the Jewish Talmud was both blasphemous and, paradoxically, a testament to the truth of Christian teaching. Just as the Devil knows the truth of Christianity but is determined to deny it and destroy those who believe it, so too, Christian scholars argued, do the Jews. People came to see Jews as being in league with Satan, possessing arcane knowledge and black magic, and harboring an unquenchable hatred for Christianity. Allegations that Jewish people were plotting against Christians became commonplace.\n\n&gt; One popular theory had it that Jews were in the habit of poisoning Christian drinking wells. When the Black Plague ravaged fourteenth-century Europe, outbreaks were often blamed on the international Jewish well-poisoning conspiracy. In some cases, torturers coerced confessions from a handful of Jewish suspects, on the basis of which thousands more were burned alive. The worst of the pogroms was in Strasbourg. Fear-stricken locals, desperate to prevent the plague from reaching them, decided to preemptively slaughter the town’s Jews. (Some of the town’s nobility were also in debt to Jewish money-lenders, and may have seen an opportunity to clear their tab.) City authorities attempted to intervene but couldn’t hold the mob at bay. All told, around nine hundred Jewish people were burned alive, and the rest were baptized or banished. The plague soon swept through town regardless, leaving sixteen thousand people dead in its wake.\n\n&gt; There was also the “blood libel”—the allegation that Jewish people routinely murder Christians and drain them of their blood, which they allegedly used to make the Passover meal, to make medicine to heal their physical defects, or to perform unholy rituals. The myth was invented in the twelfth century, when a young Christian boy was found dead on the outskirts of Norwich, England, the day before Easter Sunday. Thomas of Monmouth, a Benedictine monk turned amateur detective, offered a convoluted explanation. Jewish teaching, he claimed, asserts that Jews must spill Christian blood in order to regain their homeland. Thus, a secret council of Jewish elites convenes once a year to select a sacrificial Christian child. Monmouth’s idea caught on. For centuries thereafter, whenever a Christian child went missing or turned up dead, local Jews were often the first suspects.\n\n&gt; These religiously motivated fears circulated for centuries. Meanwhile, Jews in many regions were denied citizenship and property rights, confined to ghettos, or banished from Christian society altogether. This began to change in the wake of the French Revolution, when many Jewish people were granted basic human rights and began to emerge from isolation. They naturally tended to favor liberal and democratic political policies that represented their best hope of increasing liberty. Still sidelined from traditional occupations, many migrated to the cities and pioneered inventive new ways of making a living. While most remained impoverished and out of sight, a few became extremely wealthy.\n\n&gt; This all led to new social tensions. A lot of people weren’t thrilled about the radical changes taking place around them. For some, the newly integrated Jews became a defining symbol of the modern world. The age-old prejudice that had given rise to the blood libel and well-poisoning myths was reinvigorated and updated to reflect modern anxieties and resentments. Jews were no longer enemies of God, but enemies of man. In 1879, a new word, antisemitism, was coined to reflect the fact that what was once a collection of primitive medieval superstitions had become a fully-fledged political ideology.", "score": 1, "send_replies": true, "subreddit": "philosophy", "date_year_month": "2019-05", "created_utc_converted": "2019-05-10 00:43:10", "score_overall": 15, "words": "jew jewish jewish jewish jewish conspiracy jewish jewish jewish libel jewish jewish jewish jewish libel", "shared_words": "jew jewish conspiracy libel", "socre_distint": 4}
{"author": "ooterbay", "body": "Hmm...let's see...you posted the same link to a video about how \"It's okay to criticize the Jews\" nine times in the last month and then defended the antisemitic caricatures of Jews contained in that video; you argued that Jews control the porn industry; in response to someone saying \"There are a ton of neo-Nazis right here on Reddit,\" you said \"Oy vey, the Hebrews know!\" (and you stated \"Oy vey, de goyim noticed us!\" in response to another comment); you claim that \"Antisemitism is a racial ideology first *imagined* in the late nineteenth century;\" you believe in \"the great replacement;\" you responded to someone stating that there were black Roman emperors by saying \"WE WUZ EMPERORS AND SHEIT\" (which is not indicative of hating Jews, but of just generally being a racist); in response to an anti-Trump smuggie with no indication of the poster's religion you said \"The Jew cries as he draws his smuggie;\" you think that \"“European” simply means “Christian.” Jews aren’t considered European, or “white” in common parlance,\" and therefore \"Bernie isn’t white;\" you claimed that we destroyed Syria at the Jews' urging; and then there was this gem: \"Hate crime hoaxes are lies perpetrated by minorities vying for control, Jews chief among them.\"    \nAnd your username is in reference to E. Michael Jones. I'm sure you don't believe anything that the ADL says because they're run by evil Jews or whatever, but please indicate to me where the lie is here (aside from the usual \"it's not antisemitism if it's the truth!!!\" bullshit.): \n&gt;E. Michael Jones is an anti-Semitic Catholic writer who promotes the view that Jews are dedicated to propagating and perpetrating attacks on the Catholic Church and moral standards, social stability, and political order throughout the world. He portrays the Jewish religion as inherently treacherous and belligerent towards Christianity. He describes Jews as “outlaws and subversives [who use] religion as a cover for social revolution,” and claims that Judaism possesses “a particularly malignant spirit.” Jones also imagines the contemporary world, with its social ills, as having been cast in the imprint of Judaism, characterizing 21st-century civilization as “a Jewish world run on commercial principles.” He also identifies this “Jewish modernity” as representing “blood, the law, calculation, and hate.” In the tradition of conspiracy theorists, Jones credits Jews with orchestrating occurrences as varied and disconnected from the Jewish experience as the Protestant Reformation and the French Revolution. He also blames Jews for Bolshevism, Freemasonry, and an alleged contemporary “Jewish takeover of American culture.” Jones reaches for tenuous connections to paint “the Jews” as inherently wicked and prone to colluding openly or secretly to threaten other populations around them. Jones argues that mass killings of Jews throughout history have been understandable reactions to Jewish beliefs and behavior. He goes so far as to justify Eastern European pogroms and even the Nazi Holocaust on these grounds. As he wrote in a 2003 Culture Wars article, “[T]he Nazi attempt to exterminate the Jews was a reaction to Jewish Messianism (in the form of Bolshevism) every bit as much as the Chmielnicki pogroms flowed from the excesses of the Jewish tax farmers in the Ukraine.”    \n    \nMaybe you'll get all mad and whiny if I call you a Nazi because bla bla bla libtard snowflakes bla, but you're a Nazi, my dude. The Nazis thought they were right, too. They thought they had all the evidence in the world that the Jews were evil scum. They thought they had figured out the conspiracy and everyone else just had the wool pulled over their eyes. Just like you. And you can just say \"well, I'm not saying Jews are bad because of their race - I'm saying they're bad because of their beliefs!\" but that makes much less difference than you seem to think. You hate Jews. Full stop.", "score": 8, "send_replies": true, "subreddit": "JordanPeterson", "date_year_month": "2019-05", "created_utc_converted": "2019-05-11 19:51:15", "score_overall": 13, "words": "goyim jew jewish jewish jewish conspiracy jewish jewish jewish holocaust jewish jewish conspiracy", "shared_words": "goyim jew jewish conspiracy holocaust", "socre_distint": 5}
{"author": "goodythedude", "body": "IT'S TIME FOR ‘ISRAEL EXPOSED’ TO ENDORSE THE INTERNATIONALLY RECOGNIZED ANTISEMITISM DEFINITION \n\nThe committee on Antisemitism and Holocaust Denial called the IHRA Plenary in Budapest 2015 to adopt the following working definition of antisemitism. In the spirit of the Stockholm Declaration that states: “With humanity still scarred by …antisemitism and xenophobia the international community shares a solemn responsibility to fight those evils” On 26 May 2016, the Plenary in Bucharest decided to:\n Working definition of antisemitism:\n\n“Antisemitism is a certain perception of Jews, which may be expressed as hatred toward Jews. Rhetorical and physical manifestations of antisemitism are directed toward Jewish or non-Jewish individuals and/or their property, toward Jewish community institutions and religious facilities.”\n\nAntisemitic discrimination is the denial to Jews of opportunities or services available to others and is illegal in many countries.\n\nTo guide IHRA in its work, the following examples may serve as illustrations:\nManifestations might include the targeting of the state of Israel, conceived as a Jewish collectivity. However, criticism of Israel similar to that leveled against any other country cannot be regarded as antisemitic. \n\nAntisemitism frequently charges Jews with conspiring to harm humanity, and it is often used to blame Jews for “why things go wrong.” It is expressed in speech, writing, visual forms and action, and employs sinister stereotypes and negative character traits.\n\nContemporary examples of antisemitism in public life, the media, schools, the workplace, and in the religious sphere could, taking into account the overall context, include, but are not limited to:\nCalling for, aiding, or justifying the killing or harming of Jews in the name of a radical ideology or an extremist view of religion.\nMaking mendacious, dehumanizing, demonizing, or stereotypical allegations about Jews as such or the power of Jews as collective — such as, especially but not exclusively, the myth about a world Jewish conspiracy or of Jews controlling the media, economy, government or other societal institutions.\nAccusing Jews as a people of being responsible for real or imagined wrongdoing committed by a single Jewish person or group, or even for acts committed by non-Jews.\nDenying the fact, scope, mechanisms (e.g. gas chambers) or intentionality of the genocide of the Jewish people at the hands of National Socialist Germany and its supporters and accomplices during World War II (the Holocaust).\nAccusing the Jews as a people, or Israel as a state, of inventing or exaggerating the Holocaust.\nAccusing Jewish citizens of being more loyal to Israel, or to the alleged priorities of Jews worldwide, than to the interests of their own nations.\nDenying the Jewish people their right to self-determination, e.g., by claiming that the existence of a State of Israel is a racist endeavor. \nApplying double standards by requiring of it a behavior not expected or demanded of any other democratic nation.\nUsing the symbols and images associated with classic antisemitism (e.g., claims of Jews killing Jesus or blood libel) to characterize Israel or Israelis.\nDrawing comparisons of contemporary Israeli policy to that of the Nazis.\nHolding Jews collectively responsible for actions of the state of Israel.\nAntisemitic acts are criminal when they are so defined by law (for example, denial of the Holocaust or distribution of antisemitic materials in some countries).\nCriminal acts are antisemitic when the targets of attacks, whether they are people or property – such as buildings, schools, places of worship and cemeteries – are selected because they are, or are perceived to be, Jewish or linked to Jews.", "score": -6, "send_replies": true, "subreddit": "israelexposed", "date_year_month": "2019-05", "created_utc_converted": "2019-05-12 11:19:54", "score_overall": 16, "words": "holocaust jewish jewish jewish jewish jewish conspiracy jewish jewish holocaust holocaust jewish jewish libel holocaust jewish", "shared_words": "holocaust jewish conspiracy libel", "socre_distint": 4}
{"author": "UtredRagnarsson", "body": "To the extent of my own feelings on the matter, the Holocaust has become an identity and calling card for when we want something.\n\nWhen people identify as Jewish because their family went to the camps, and not because of Judaism, it is a sullying of Jewish identity. When people don't learn from the events surrounding the Holocaust, it is stagnation. When religious people use the Holocaust for fire-n-brimstone talk that certain European rabbis loved to engage in during the Maskilim period to try to \"scare people straight\", it's an abuse of the memory of the Holocaust.\n\n&amp;#x200B;\n\nInstead of learning to defend ourselves, our liberal members insist that we must have some strange westernized concept of \"moral high ground\" and march like sheep to the slaughter and other pacifist nonsense.\n\nInstead of learning to defend ourselves, our more conservative members insist that we must pray to God not to smite us for whatever sins we and others do...and that if only the skirt length, or talking in tefilah or cellphones were to become non-issue we'd avoid a 2nd Holocaust.\n\nInstead of learning to read the signs in society, our more liberal members insist that we should join forces even with our critics because in their paradise society once we join hands it'll all go good and racism will magically disappear (rather than it being the clusterfuck victim olympics it currently is). They also insist that if we just \"modernize\" and assimilate, it'll be OK.....in absolute ignorance that the first victims of the Holocaust were those Jews that felt more German than Jew.\n\nInstead of learning to read the signs in society, our more conservative members insist that we should hide behind conspiracy theories and borrow more fringe right-wing views on race and race relations....in absolute ignorance that if one actively treats goyim bad, it only furthers stereotypes and exacerbates whatever existing situations. They insist that the goyim will always screw us and we have no allies and should just burn them before we get burnt.\n\nInstead of learning about our faith, and why it bothers others so much, our more liberal members insist that we must purge it of anything that might not be the latest and greatest trend. In their ignorance it's the only way to avoid punishment from the goyim for being different. We just gotta outgoy the goyim and we're good.\n\nInstead of being intellectually honest about our faith, our more conservative elements start adopting magical thinking and say ridiculous bullshit like \"The Lubavitcher Rebbe killed Stalin during a farbrengen with his spiritual powers\" (heard it myself) and \"Rebbe Nahman saved Uman by coming back to kill a few nazis near his grave\" (yet ironically the community was killed/dispersed and wouldn't you know it, RN didn't follow through with saving all 6 million from a grisly death...). They talk about how spiritual the Kaliver Rebbe must be because he endured torture under Mengele, and, they ascribe the power to bless others on Holocaust survivors as if they're all great tzaddikim that magically walked out of there and have the power to influence God's decision in spite of the very real helplessness they had.\n\n&amp;#x200B;\n\nOne of our newest idols has become the Holocaust...because rather than learn from it, we'd rather turn it into a medium of worship that was unwarranted and unbeckoned for.\n\n&amp;#x200B;\n\n\\*mic drop\\*", "score": -6, "send_replies": true, "subreddit": "Judaism", "date_year_month": "2019-05", "created_utc_converted": "2019-05-12 14:40:45", "score_overall": 16, "words": "holocaust jewish jewish holocaust holocaust holocaust holocaust holocaust jew conspiracy goyim goyim goyim goyim holocaust holocaust", "shared_words": "holocaust jewish jew conspiracy goyim", "socre_distint": 5}
{"author": "UtredRagnarsson", "body": "\\&gt; Detached relationship\n\nWtf. The Inquisition, random pogroms, the Roman occupation era, and more are all recorded as being that whole annihilation thing. All took place over multiple countries. The Almohads chased us from Spain through the Maghreb. The Romans persecuted us across the Levant and Egypt and then shipped us to all sorts of colonies where they persecuted us some more. Etc. etc. etc.  It isn't unique to history. That is why I can be detached in a sense by recognizing that the only thing that makes this event of history different is the scale and industrialization which was new to history-- but guess what-- the machine gun and bombardment tactics and gases did the same thing in WW1. We don't talk about that anymore because it was superceded by the nuke and biochemical warfare as an advanced science. In the days of the Mongols raining diseased corpses and flaming birds on cities, those things were also devastating...and then it got surpassed. Such is history. The Persians aren't rambling about how 3/4 their population was wiped out by the Mongols even though they like us have good cause.\n\nThere are all sorts of genocides, wars, and massive kill-offs in history. The Holocaust wasn't as unique as people make it out to be. FFS Hitler is quoted as saying he got the idea from the Turkish massacres of the Armenian genocide a mere 15-20 years prior.\n\nToday we are obsessed with it as a unique thing-- it's not. It never was unique for us, with all our terrible history, and it never was unique in the world..because the goyim still do it to this day to one another.\n\n\\&gt;Amaleq\n\nwas a specific tribe from a specific time...and while it symbolically fits, we now have people running around calling each other the term. FFS we have people abusing the terms \"nazi\" and \"fascist\" to the point where it simply means \"person that is different than me whose opinion devalues them so much I would rather physically harm or kill them\".\n\nWhat is this world coming to when some lady with a shaved head can chase a guy in Alameda,CA because of a Trump hat and call him a nazi when he's in fact a Jewish guy who leans conservative? Half the people posting on reddit do the same thing. All the posters against Israel invoke nazis as if we're burning through bullets and smoking up bodies. Wtf?! Building a wall around Beit Lehem because suicide bombers were coming from there and Beit Jala means that we're systematically deporting people to camps and gunning them in the streets??! Really?!\n\n\\&gt;Never again\n\nThe black empowerment movement was a singular case...and now people are trying to extend it to all sorts of directions it doesn't belong (like illegal immigrants, which is a political issue dealing with political borders).\n\n\\&gt;Reminds us where we come from, basic judaism, etc. etc.\n\nOK...so then stop saying we \"moved on\". We haven't. Moving on would imply we no longer need to remember and we no longer need to learn. Our whole system is set up so that we learn redundantly.\n\n\\&gt; Lets be real about this for a second.\n\nYou  live in a state built to protect the Jewish people from harm. You are  taking advantage of all of the perks of Jewish existence while  criticizing that existence. You somehow think that living in Israel  gives you an inherent understanding about the deeper implications of  what it means to be a Jew and how Israel relates to the Jewish  experience.\n\nYou're angry. You're  probably angry because you're a secular Jew (assuming that considering  your hate towards the religious Jews) living in Israel.\n\nI'm  sorry Judaism isn't for you. I'm sorry you never felt the connection.  I'm sorry that you don't feel pride in where you come from and for the  people who are a part of.\n\nThat doesn't  change the fact that just because you are blind to something doesn't  mean that thing isn't special. Red exists even if you're colorblind.  It's not our job to restore the magic for you.\n\n&amp;#x200B;\n\nYou're missing my point.  We have a state for a reason.  There are plenty of nations that do not. There are plenty that don't even care to. But we do. Why? Because we live in the past.  Our past is that of Tanach. Our past is a religious system passed down. Our past is our collective abuse. Our past is our attachment to various diasporas.\n\nAnd that is precisely why even the most secular people didn't just run off to some other place.....In their era, they had a basic education and it still influenced them even if they threw out the rest.\n\nI'm religious...and I'm making the point that we are Jewish 100% because we live in the past...because our culture is our past and we still live in it. So again, we haven't moved on. If we had, we'd be something else...\n\n&amp;#x200B;\n\n\\&gt;Projection projection projection\n\nHow about instead of projecting on me you hear the message for what it is: Am Yisrael is still living in the past because we:  \na.) have a systematic religious experience that dictates remembering it and living it\n\nb.) we have a social structure designed to remind us\n\nc.) our culture is largely based on the past...\n\nWe have not moved on. If we did....we'd either have the Messianic era of Godly revelation and all that or we'd all be assimilated to the Nth degree where it would cease to be part of our lives.", "score": -12, "send_replies": true, "subreddit": "Judaism", "date_year_month": "2019-05", "created_utc_converted": "2019-05-12 17:12:27", "score_overall": 9, "words": "holocaust goyim jewish jewish jewish jew jewish jew jewish", "shared_words": "holocaust goyim jewish jew", "socre_distint": 4}
{"author": "TheZabini", "body": "&gt; One of the consistent arguments that anti-Semites use is that Jews are so disproportionately represented in positions of wealth and power\n\nThis really isn't the mainstream antisemitic perspective at all. You have no clue what you're talking about. It's not that they're powerful, it's that they use that power to engineer social issues to gather more power and influence, which is historically verifiable. Jews have been expelled from 109 countries, but go on and keep pretending it's for no reason at all. \n\n&gt; The reality is that there is no crazy Jewish conspiracy\n\nThis is possibly true. It's most likely a genetic predisposition along with a cultural one. Their religion classifies non-jewish people as basically cattle. People like Hitler rose to power for a reason, and the Jews weren't a \"convenient scapegoat\", no matter how much people want to pretend that's the case. They strangled the middle class and treated people like shit. \n\n&gt; And it's not race realism (in the genetic sense), either.\n\nYou have no way to back this claim up. \n\n&gt; Think of how badly Jews have been treated in history\n\nYes, take your own advice and actually critically consider WHY. \n\n&gt; tl;dr race/IQ correlation is the best response to the main Nazi talking point\n\nNo it isn't, you just fundamentally misunderstand the entire perspective you're arguing against. \n\n&gt; but people are scared of race/IQ correlation being used against blacks so it's never used to debunk Nazis.\n\nNobody has ever claimed jews are dumb lmao, and furthermore Nazis are not inherently \"anti-jew\", not that they even truly fucking exist in the first place. The people who actually ARE anti-jew are nationalist ethnocentrists who want a white ethnostate, and that also discludes any other non-white race. \n\ntl;dr - you really need to stop talking about stuff you have zero education on.", "score": -9, "send_replies": true, "subreddit": "TumblrInAction", "date_year_month": "2019-05", "created_utc_converted": "2019-05-12 17:34:18", "score_overall": 6, "words": "jewish conspiracy jewish scapegoat jew jew", "shared_words": "jewish conspiracy scapegoat jew", "socre_distint": 4}
{"author": "UnableFaithlessness", "body": "&gt; Yes it is. Jews are oppressed in Europe and in the Middle East. They are not oppressed in Africa or the Far East. Why?\n\nBecause there aren't many Jews there to be oppressed. If there were more than a handful of Jews in e.g. Pakistan, China, Japan, Sudan, Zimbabwe, etc. - we would be oppressed pretty severely. And the ones that are there do their damned best to keep under the radar and not attract the attention of bigots. In some of places where there currently are no Jews (e.x. Ethiopia, Iraq) there were plenty of oppressed Jews who fled as refugees.\n\n&gt;People like to pretend it's all about money and the terrible Jew who is a banker who will steal all your money but that's not where the threat is. The threat, to governments at least, is in the educated classes. . . . People like to dress it up in different ways, but at the end of the day, if you are a minority and you do well and are successful in a country that's not your homeland, people will go after you.\n\nExcept uneducated and poor Jews who live in antisemitic areas are also oppressed by that antisemitism. Most Jews murdered by the Nazis were poor and religious, not wealthy and educated. \n\nYour entire schema for understanding antisemitism is misguided. Antisemitism is not a cover for top-down hatred of allegedly subversive intellectuals by autocratic states.\n\nAntisemitism as the projection of what any given society finds as hateful onto Jews so that society can symbolically fight its own demons without actually disrupting the power structures that maintain those evils. \nGovernments can use antisemitism [as a grand conspiracy theory](https://www.tabletmag.com/scroll/274001/anti-semitism-is-a-conspiracy-theory) to \"explain\" why people suffer and redirect revolutionary activity away from real change. But it's *also* a bottom-up expression of anger by people who feel as if they are oppressed and genuinely, incorrectly believe that \"the Jew is our misfortune,\" i.e. \"antisemitism is the socialism of fools.\"\n\nThis is how antisemitism has always functioned. \n\nAntisemitism is therefore always framed by antisemites as \"punching up.\" The core antisemitic belief is that Jews - one Jew, some Jews, all Jews, a secret cabal of Jews, the \"Synagogue of Satan,\" the \"Elders of Zion,\" religious Jews, Jewish converts to other religions, Jewish bankers, Jewish Bolsheviks, Jewish intellectuals, Jewish politicians, the international community of world Judaism, the Jewish state - are an omnimalevolent force that oppresses the world. \n\nFor more information on the general framework of projection and conspiracy, see [this article](http://www.jcpa.org/phas/phas-falk-s06.htm), [this book](https://www.amazon.com/Anti-Judaism-Western-Tradition-David-Nirenberg/dp/0393347915). For further reading from a variety of sources and perspectives, see [here](https://www.publicsource.org/history-anti-semitism-pittsburgh/?fbclid=IwAR1oKPccojHjhBgcmJTJcNgSO8hc4B3M9wkFhwkMks-2iCsfYPccBIBkiOA), [here](https://jfrej.org/wp-content/uploads/2018/04/JFREJ-Understanding-Antisemitism-November-2017-v1-3-2.pdf), and [here](https://archive.org/details/ThePastDidntGoAnywhere). \n\nSee [here](https://www.bibleodyssey.org/en/passages/related-articles/crucifixion-of-jesus-and-the-jews) for a brief explanation of this projection and blame-shifting functioned of the \"deicide\" charge in early Christian thought. See also [here](http://www.danielpipes.org/33/the-jew-as-ally-of-the-muslim-medieval-roots-of-anti) for an overview of how Christian fear &amp; opposition to Islam was used to justify medieval antisemitism.\n\nSee [here](http://www.politicalresearch.org/2017/06/29/skin-in-the-game-how-antisemitism-animates-white-nationalism/#sthash.GMftfcRa.5oiHt2LZ.dpbs) for more information on how it fits into contemporary American white nationalism. See [here](https://newrepublic.com/article/144393/lefts-blind-spot-anti-semitism?utm_source=social&amp;utm_medium=facebook&amp;utm_campaign=sharebtn) for more information on why the modern left has a significant blind spot for antisemitism; please see [here](https://www.nytimes.com/2019/01/21/opinion/ilhan-omar-israel-jews.html), [here](https://www.haaretz.com/israel-news/.premium-why-western-liberals-so-easily-buy-into-anti-semitic-blood-libel-1.6157148) and [here](https://www.tabletmag.com/jewish-news-and-politics/260637/robert-faurisson-holocaust-denial) for specific case studies in how antisemitism infects the anti-Zionist left.\n\nI can provide more links about antisemitism if you'd like. Ask me about medieval or modern Islamic societies, the USSR and Soviet \"Zionology,\" the proto-racist dynamics of Iberian antisemitism during the Inquisition (and the subsequent \"crypto-Jews\" in Latin America), etc. etc.", "score": 2, "send_replies": true, "subreddit": "DebateReligion", "date_year_month": "2019-05", "created_utc_converted": "2019-05-12 22:27:35", "score_overall": 16, "words": "jew conspiracy conspiracy jew jew jewish jewish jewish jewish jewish jewish conspiracy jew libel jewish holocaust", "shared_words": "jew conspiracy jewish libel holocaust", "socre_distint": 5}
{"author": "Roscoe_Conkling", "body": "Judaism is more than faith. People who hate Jews, as my great grandfather said, do not care whether or not you have ever set foot in a Synagogue. I never went to services, was not Bar Mitzvah'ed, did not keep kosher, and pretty much looked the same as any other little white boy. There's no getting around my last name though and none of those facts stopped classmates from calling me a kike. From throwing pennies at me in the cafeteria. From telling me that the Holocaust was OK because the Jews killed Jesus. All of this around middle school. Around the same age as this woman's son. \n\nYes, everyone should visit the Holocaust Museum and yes, it is important to acknowledge and remember the millions of non-Jewish victims as well. Yet I do believe that there is a unique aspect to visiting as a Jew, even secular or non-practicing. And there is a special responsibility that all people have to confront and counter evil, especially as they become an adult with the actual ability to do so. If learning about an example of such evil is not a good metaphor for coming of age, then I wouldn't know what is.", "score": 18, "send_replies": true, "subreddit": "washingtondc", "date_year_month": "2019-05", "created_utc_converted": "2019-05-13 22:46:30", "score_overall": 5, "words": "kosher holocaust holocaust jewish jew", "shared_words": "kosher holocaust jewish jew", "socre_distint": 4}
{"author": "slyweazal", "body": "**The President is creating a government shutdown crisis predicated on lies and racist rhetoric about illegal immigration.**\n\nAccording to the right wing think tank the CATO Institute, President Trump's administration has provided an incredibly misleading narrative about illegal immigration and crime.^[[1]](https://www.cato.org/blog/white-houses-misleading-error-ridden-narrative-immigrants-crime)\n\n&gt;But we should not tolerate the peddling of misleading statistics without context. What matters is how dangerous these subpopulations are relative to each other so the government can allocate resources to prevent the greatest number of murders possible. Thus, enforcing immigration law more harshly is an ineffective way to punish a population that is less likely to murder or commit crimes than native-born Americans. Illegal immigrants, non-citizens, and legal immigrants are less likely to be incarcerated, convicted, or arrested for crimes than native-born Americans are. \n\nThe Washington Post compiled statistical charts that indicate the Trump administration is lying when they claim illegal immigration is a crisis. They disprove Trump's lies including immigrants flooding the border (they're not), that they bring crime (they don't), and that they're a drain on the economy (they aren't).^[[2]](https://www.washingtonpost.com/news/wonk/wp/2018/06/21/theres-no-immigration-crisis-and-these-charts-prove-it/?utm_term=.5a93c2cb02fa)\n\n&gt;The administration has said that the country is in danger of being “overwhelmed” by “massive increases in illegal crossings” that will bring “horrible crime,” “unbelievably great taxpayer expense” and the loss of American jobs.\n\n&gt;None of those claims are true.\n\n&gt;...Here's what we can say in conclusion. Current rates of illegal immigration remain extremely low by historic standards. Legal and undocumented immigrants are significantly less likely to commit most crimes than native-born citizens, making them a net benefit to public safety. The research shows that immigrants are not taking jobs away from U.S. natives, and their impact on wages appears to be small to nonexistent, particularly across the long term.\n\n**President Trump's rhetoric is incredibly dangerous and is reminiscent of authoritarian leaders who have committed crimes against humanity.**\n\nThe President's rhetoric - his referral to undocumented immigrants as *\"infesting\"* the United States is incredibly dangerous and it is not the first time he has alluded to white nationalist talking points. First he tweeted it^[[3]](http://www.foxnews.com/politics/2018/06/19/republican-pressure-intensifies-to-end-family-separations-at-border.html) followed by him saying this as a statement during a speech later in the day.^[[4]](http://fox2now.com/2018/06/19/trump-ramps-up-rhetoric-dems-want-illegal-immigrants-to-infest-our-country/) Moreover, former Trump Campaign Chairman Cory Lewandowski went on national television and dehumanized a child with Down Syndrome who had been separated from their family.^[[5]](https://www.washingtonpost.com/news/morning-mix/wp/2018/06/20/womp-womp-outrage-after-corey-lewandowski-mocks-story-of-child-with-down-syndrome-separated-from-parents/?noredirect=on&amp;utm_term=.18f884832b12) President Trump has peddled anti-semetic conspiracies including the conspiracy that a prominent Jew is behind the migrant caravans^[[6]](https://thehill.com/homenews/administration/414171-trump-i-wouldnt-be-surprised-if-soros-were-paying-for-migrant-caravan) that he claims are *\"invading\"* the country.^[[7]](https://www.pbs.org/newshour/politics/watch-trump-defends-calling-migrant-caravan-an-invasion-ahead-of-midterm-elections) And Fox News has repeated extremely dangerous xenophobic rhetoric that these migrants are bringing diseases with them, they're not.^[[8]](https://www.vox.com/science-and-health/2018/11/1/18048332/migrant-caravan-fox-news-disease-smallpox-outbreaks-vaccines-xenophobia)\n\nSome experts have compared the President's statements to Nazi propaganda.^[[9]](https://www.timesofisrael.com/critics-say-trumps-description-of-immigrants-recalls-nazi-propaganda/)\n\n&gt;Social commentators pointed out that history has shown, particularly before and during the Holocaust, that “infest” — a term almost exclusively used to describe vermin — dehumanizes a population and is often a precursor to murder or genocide.\n\n&gt;“Democrats are the problem. They don’t care about crime and want illegal immigrants, no matter how bad they may be, to pour into and infest our Country, like MS-13,” the president tweeted. “They can’t win on their terrible policies, so they view them as potential voters!”\n\n&gt;One of the most notorious anti-Semitic films produced by Nazi Germany’s Ministry of Propaganda was “Der ewige Jude” (“The Eternal Jew”), with input from propaganda minister Joseph Goebbels.\n\n&gt;The US Holocaust Memorial Museum says that “One of the film’s most notorious sequences compares Jews to rats that carry contagion, flood the continent, and devour precious resources.”\n\n**These xenophobic conspiracy theories are incredibly dangerous. Recently a far right conspiracist murdered 11 people in a Synagogue.^[[10]](https://www.nbcnews.com/news/crime-courts/pittsburgh-synagogue-shooting-suspect-threatened-jewish-groups-pushed-migrant-caravan-n925256) The murderer believed in the same xenophobic, racist conspiracies that were being peddled by members of the GOP, President Trump and the American rightwing media sphere.^[[11]](https://www.washingtonpost.com/politics/2018/10/29/how-trumps-conservative-media-helped-mainstream-conspiracy-theory-now-tied-tragedy/?utm_term=.005def0fb638)**\n\n________\n\n1) [CATO Institute - The White House’s Misleading &amp; Error Ridden Narrative on Immigrants and Crime](https://www.cato.org/blog/white-houses-misleading-error-ridden-narrative-immigrants-crime)\n\n2) [Washington Post - There’s no immigration crisis, and these charts prove it](https://www.washingtonpost.com/news/wonk/wp/2018/06/21/theres-no-immigration-crisis-and-these-charts-prove-it/?utm_term=.5a93c2cb02fa)\n\n3) [Fox News - Republican pressure intensifies to end family separations at border](http://www.foxnews.com/politics/2018/06/19/republican-pressure-intensifies-to-end-family-separations-at-border.html)\n\n4) [Fox St. Louis - Trump ramps up rhetoric: Dems want ‘illegal immigrants’ to ‘infest our country’](http://fox2now.com/2018/06/19/trump-ramps-up-rhetoric-dems-want-illegal-immigrants-to-infest-our-country/)\n\n5) [Washington Post - ‘Womp womp’: Corey Lewandowski mocks story of child with Down syndrome separated from parents](https://www.washingtonpost.com/news/morning-mix/wp/2018/06/20/womp-womp-outrage-after-corey-lewandowski-mocks-story-of-child-with-down-syndrome-separated-from-parents/?noredirect=on&amp;utm_term=.18f884832b12)\n\n6) [The Hill - Trump: 'I wouldn't be surprised' if Soros were paying for migrant caravan](https://thehill.com/homenews/administration/414171-trump-i-wouldnt-be-surprised-if-soros-were-paying-for-migrant-caravan)\n\n7) [PBS - WATCH: Trump defends calling migrant caravan an ‘invasion’ ahead of midterm elections](https://www.pbs.org/newshour/politics/watch-trump-defends-calling-migrant-caravan-an-invasion-ahead-of-midterm-elections)\n\n8) [Vox - Fox News says the migrant caravan will bring disease outbreaks. That’s xenophobic nonsense.](https://www.vox.com/science-and-health/2018/11/1/18048332/migrant-caravan-fox-news-disease-smallpox-outbreaks-vaccines-xenophobia)\n\n9) [Times of Israel - Critics say Trump’s talk of immigrants ‘infesting’ US recalls Nazi propaganda](https://www.timesofisrael.com/critics-say-trumps-description-of-immigrants-recalls-nazi-propaganda/)\n\n10) [NBC - Pittsburgh synagogue shooting suspect threatened Jewish groups, pushed migrant caravan conspiracies](https://www.nbcnews.com/news/crime-courts/pittsburgh-synagogue-shooting-suspect-threatened-jewish-groups-pushed-migrant-caravan-n925256)\n\n11) [Washington Post - How the Trumps and conservative media helped mainstream a conspiracy theory now tied to tragedy](https://www.washingtonpost.com/politics/2018/10/29/how-trumps-conservative-media-helped-mainstream-conspiracy-theory-now-tied-tragedy/?utm_term=.005def0fb638)", "score": 1, "send_replies": true, "subreddit": "instantkarma", "date_year_month": "2019-05", "created_utc_converted": "2019-05-14 05:18:11", "score_overall": 12, "words": "conspiracy jew holocaust jew holocaust conspiracy jewish conspiracy jewish jewish conspiracy conspiracy", "shared_words": "conspiracy jew holocaust jewish", "socre_distint": 4}
{"author": "MarioThePumer", "body": "The rampant racism in this thread is astonishing.\n\nAnd before you ask “well, why *were* they kicked out so often?” let’s start from the beginning. The first few times jews were kicked out were due to religious hatred, as Jews were blamed for killing Jesus. After a few centuries (and a major change in how Christians viewed Jews in regards to Jesus’s death) said hatred settled down, but the Jewish life was already majorly changed. Since Jews were kicked out left and right, (and somewhat due to religious beliefs,) they learnt to not work the land they live in, leading them to work primarily in non-farming related jobs. Additionally, since they had  to learn a new language in every country they settled in, they became multilingual, which was very useful for merchant-work.\n\nThis is where the “greedy Jew” stereotype originally comes from - many Jews worked in trading due to their multilingualism, and while that stereotype was only accurate in the.. let’s say, 16th century, people often needed a scapegoat for their issues. Herein come blood libels and antisemitism, which were rampant in Europe since the 1500s, and really reached their peak in the 1910-1940s.\n\nTL;DR - Jews were first kicked out for killing Jesus, and then were kicked out because everyone already hated them (for killing Jesus) and so were an easy scapegoat.", "score": 21, "send_replies": true, "subreddit": "HistoryMemes", "date_year_month": "2019-05", "created_utc_converted": "2019-05-15 11:20:30", "score_overall": 5, "words": "jewish merchant jew scapegoat scapegoat", "shared_words": "jewish merchant jew scapegoat", "socre_distint": 4}
{"author": "Rabsus", "body": "You can write volumes and volumes on this topic, it incorporates thousands and thousands of years of cultural and religious history.  I don't really study theological history but I can give a very brief overview.  Every single instance of persecution of Jewish can have an entire book written on it.\n\nJewish communities have long since been rather insular, you can see this culturally and in scripture.  They've long since inhabited a historically contentious area of history alongside faiths that vary in their attitudes towards them, either politically or religiously (Islam or Christianity). A good overview of how Jews have been historically viewed would be through Qur'anic or Biblical criticisms on Jews. \n\nFor instance, Jewish law did not forbid usury which was outlawed in these other Abrahamic religions which allowed Jewish populations to dominate financial aspects of heavily religious societies, because a lack of competition.  Another aspect is the \"christ killer\" and sense of betrayal that compounds with this whole \"secret control of finances\" conspiracy that uses religious dogma to incite popular connotions of betrayal, duplicity, and greed.  Conspiracies arise from these connotations and a cycle of persecution persists, hygenic habits of Jews along with isolated communities mean they are less liable to be hit by plagues as local communities are, fueling conspiracy theories that are in turn fueled by these conceptions. Jews poisioning wells to kill Christendom sounds archaic and crazy, right?  Well its no coincidence that this argument made back in the middle ages to massacre groups of Jews is fundamentally the same argument that was used in WW2 and that was used today.  Anti-semites will have you think these are all independent events as populations \"learned the truth\" but under close scrutiny it is obvious that there exists a popular overarching theme and commonality between the persecution and *who* is doing it.\n\nIn the Islamic world you have a similarly tense relationship with Judaism.  Common Qur'anic verses include themes such as distorting and corrupting God's will (Islam believes Jews and Christians received divine words, but corrupted them), breaking the covenant (duplicity, greed, lack of conviction, cowardly), ridiculing Muslims, among many other criticisms that were very prevalent in theology at the time.  At the same time however, the Qur'an and Bible have similarly relatively \"complimentary\" passages on Judaism, so its a mixed bag here.  Judaism is also the smallest of all the Abrahamic religions which is worth noting, over half of the world is following an Abrahamic religion while Jews are .2% of the world's population.  Making them easy targets for persecution that has historically been fueled on religious grounds. Think about how many times Muslims and Christians have quarreled and continue to do so to present day, Judaism is part of that fold and is integral to the doctrine and cultural development of both religions.\n\nThese stereotypes stick around **a very long time**, which is why anti-semites try to phrase the \"109 countries\" thing as if they are all isolated incidents, which they are not even close to being and the \"kicking out\" varies heavily in scope and context but are portrayed to be a universal constant following a simple rule.  Kicking out could be reduced to even just a few thousand being forced out by occupational forces of a small country, putting this country on par with something like Russia or the United States, much less random medieval fiefdoms or whatever.  Anti-semitism is by design marketed in reductionist tactics, because fear mongering works best when you break things down to reduced and inaccurate terms. Even so being run out of somewhere isn't indicitive of anything, African-Americans have probably been run out of every single US state since the inception of the United States.  Native Americans have as well, though it would be stupid to say that \"Native Americans have been run out of everywhere in the United States, coincidence?\" without examining the historical picture.\n\nAs for the whole \"109 countries\" thing, there is a reason why anti-semities will ask a rhetorical quesiton and not answer it.  Because its more convincing for them not to, it leaves you to stew on these \"questions\" without them having to defend their views.  Its the same reason they will often be ambiguous about holocaust denial views, often using memes or phrasing questions in a certain light to arise suspicion so they can dash off somewhere else. This is why you always see the common \"I'm just asking questions, is that illegal?\" type rhetoric coming from these communities to fuel the narrative of ideas being \"supressed\" and the concept of \"brainwashing\".  It is all very deliberately planned rhetoric in the way this information is laid out to people.\n \nAnti-semites also prey on the inherent Western centric views of their audience.  Acting as if Judaism has faced widespread persecution whereever it has gone.  China accepted many Jewish refugees (Seriously, and the founding father of modern China, Sun Yat Sen, likened Jewish persecution with the humiliation of China by the West) and you see little persecution of Jews in areas outside of Western Christian/Islamic influence, possibly because these long grained stereotypes and scapegoating doesn't exist in large quantities there.", "score": 3, "send_replies": true, "subreddit": "HistoryMemes", "date_year_month": "2019-05", "created_utc_converted": "2019-05-15 11:47:09", "score_overall": 11, "words": "jewish jewish jewish jewish conspiracy greed conspiracy greed holocaust jewish jewish", "shared_words": "jewish conspiracy greed holocaust", "socre_distint": 4}
{"author": "nidarus", "body": "&gt;If he was not a Nazi then he'd be persecuted like everyone else. Ethnic Jews that fought with Germany during the WWI were granted immunity as were Jews who fought with the Nazis.\n\nSimply not true. According to the [Nuremberg Laws](https://upload.wikimedia.org/wikipedia/commons/8/85/Nurembergracechart.jpg), Judaism only extended to the grandparents. Someone with merely a Jewish great-grandfather wouldn't even be considered a Mischling (mixed Jew-Aryans, who were allowed to serve in the Nazi army), but a full Aryan. Again, even freaking Hitler thought this guy's heritage was sufficiently Aryan. But I guess not you.\n\n&gt;I think you don't understand the difference between ethnicity and nationality. There were (and still are) many ethnic Germans in Poland with a Polish name (ski, cki,etc) Due to centuries of mixes marriages a lot of surnames were passed on through generations. But calling them Polish is like calling a German with a Jewish sounding surname Jewish.\n\nI mean... you literally just called someone with a single Jewish great-grandfather \"Jewish\". Someone who's neither ethnically, religious nor nationally \"Jewish\", nor had a Jewish last name. I'd say considering actual ethnic Poles as part of the \"ethnic Poles\" (your qualification, not mine) who supposedly served in far lesser numbers in the SS than Jews, is more than justified.\n\n&gt;And like you said. The Poles working in Camps were forced into it. The Jews working in ghettos were being paid and they gladly handed over the names and addresses of other Jews (as well as Poles.)\n\nYeah, I'd really like to see evidence of that. As far as I know, there were both collaborators, and forced workers on both sides.\n\nI'm still waiting for the evidence for how \"fare more Jews serving in the SS than ethnic Poles\".\n\n&gt;And the last part is just denial. Even your Prime Minister defended Hitler and said that not the Germans but the Arabs wanted to kill all the Jews. In my book that's Holocaust denial.\n\nIt's thoroughly documented, mainstream history. You're more than free to look it up in Wikipedia - if you don't considered a tainted Jew-source of course.\n\nAs for Netanyahu, what he said is fucked up, but it's not that \"the Germans didn't want to kill the Jews\". He was repeating a fringe theory that the Mufti of Jerusalem, an avid fan and participant of the holocaust, was the one who brought up the idea of killing the Jews, back when Hitler was merely considering the Madagascar \"solution\". And he was lambasted by the entire Israeli society, including Yad Vashem. But I'm not sure how it's even remotely related to anything I said.\n\nEither way, I do find it particularly amusing to see someone who tries to prove the Jews fully collaborated with holocaust, participated in SS in great numbers, and did so out of greed, complaining about \"holocaust denial\".", "score": 14, "send_replies": true, "subreddit": "worldnews", "date_year_month": "2019-05", "created_utc_converted": "2019-05-15 17:17:27", "score_overall": 14, "words": "jewish jew jewish jewish jewish jewish jewish jewish holocaust jew holocaust holocaust greed holocaust", "shared_words": "jewish jew holocaust greed", "socre_distint": 4}
{"author": "TawahRifuht", "body": "**Yes, the change is dramatic actually**. Apart from russian-polish lingo differences. I'm someone with jewish-polish heritage and the situation changed dramatically in last 2 years.\n\nBefore that I would describe polish attitude towards jewish people as 'complicated'. A lot of people had 'jewish sentiment' but there was also a big conspiracy-theory fan group and they were thinking every second PM is jewish. A lot of people had however a pro-israelic stance, even if they didn't like the Jew from their conspiracy theory paper. A lot (really a lot) of people were interested in jewish culture in a good way too. Jewish cuisine started to be thing and for most people the first thing they had in mind when thinking 'Israel' was 'tourist destination'. At least when they weren't reading their conspiracy paper.\n\nIt started with the 'polish death camps' fuss which provoked the ruling party to write the controversial holocaust bill. After that row things started to calm down, but Katz remarks made a huge blow and this is happening alongside with the whole holocaust restitution topic is in the media right now causing really enormous damage. Antisemites became louder and many Poles, also those who aren't antisemitic are likely to think that 'Israelis in general hate us'. Also, more and more people think that 'Jews want to rob us' because of the heirless property restitution claims. And this is sadly going mainstream. There's a new far-right party that builds their entire support on the jewish restitution topic, however they are at 1-5%. The damage is huge and nobody seems to react or notice the change.\n\nI don't think it's too late now, I don't suppose anyone wearing a kippah should be afraid, but I'm not sure if I'm going to say the same thing in two next years if these things will go down this road.", "score": 3, "send_replies": true, "subreddit": "Israel", "date_year_month": "2019-05", "created_utc_converted": "2019-05-15 17:24:37", "score_overall": 13, "words": "jewish jewish jewish conspiracy jewish jew conspiracy jewish jewish conspiracy holocaust holocaust jewish", "shared_words": "jewish conspiracy jew holocaust", "socre_distint": 4}
{"author": "LordQuagga", "body": "&gt;Are you actually trying to say that Jews are behind globalism?\n\nNo. In fact, quite the opposite—I'm letting those reading this thread know what the dog whistles are. This was never for convincing you. By your logic, if I pointed out that \"That school bus is yellow\", I would be at fault for all school buses being yellow. \n\n**Here's varying sources on the Globalist Slur:**\n\nhttps://www.theatlantic.com/politics/archive/2018/03/the-origins-of-the-globalist-slur/555479/\n\nhttps://www.forbes.com/sites/toddessig/2018/10/31/how-trumps-use-of-nationalist-and-anti-globalist-speech-fueled-the-pittsburgh-massacre/#68f0894c4aba\n\nhttps://en.wikipedia.org/wiki/Globalism#Other_uses\n\nhttps://www.newsweek.com/donald-trump-anti-semitic-globalist-koch-1052375\n\nand for fun:\nhttps://www.urbandictionary.com/define.php?term=Globalist \n\nIf you're currently in college, I'm sure if you contacted a librarian and asked for some books on the Holocaust, studies on the \"Jewish Conspiracy\", and the social engineering the Nazi party took to normalize hate, I'm sure they will find you plenty of well researched articles and books on the matter from someone way smarter than either of us.\n\nI don't expect you to read the thread, but I'll TL;DR this for your clapemoji-ridden brain: I casually mentioned up-thread how someone may have picked up a term from TD *that didn't originate there*—one that seems pretty benign, but, is in fact a sort of fish in the sand (or ((())) if you don't understand what I mean) for white supremacy. Then, after linking to a thread using memes in the title, which were dog whistles for \"global Jewry\", someone called me out or was curious if I could find more from TD. \n\nI'm not linking to the places where these meme's originated because they don't need the exposure. Sorry if this hurts you in anyway—I'd remind you that none of my responses have been for anyone but those reading causally, who may happen to be on the fence about these political stances.\n\nThat first link was an error; I linked to the entire thread when I meant to link to the comment. You are correct though that the thread was in support of Israel—but, if you had read what I said, TD cleans shop pretty well on blatant anti-semitism, and there are some deleted messages that got a rise out of posters. I can only speculate what those were.\n\nI'll take the time to quote these for the record, and restate that **all links I've shared are from the last 10 days**, there's obviously many thousands more comments I could go through, but I've got better shit to do than that, and I believe you'd probably feel the same way:\n\nAnd again, if you disagree with my label of dog whistle having anti-semetic roots, that's okay, you're just wrong. So, with that in mind here's the quote:\n&gt;We were in Syria because the globalist plan was to cut Russia off from their energy profits by creating a pipeline from Qatar to the Balkans to supply Europe with Natural gas. The pipeline had to travel through Syria and Assad (an ally of Russia) said no. Who would of thought, another middle eastern conflict based around energy profits. Color me surprised.\n\nAnd, yes, although the man whose tweet was definitely in the wrong, we find in TD a comment like this:\n&gt;That's the motive behind his tweet though. He thinks he can mask inciting hatred against whites as self criticism. Happens all the time from Jews on Twitter\n\nA clear blanket statement thinking that one terroristic statement from a man should immediately damn all Jews on Twitter to the same level.\n\nIf you had read what I said, I stated that TD is split on the Jewish people. There are those who see Orthodox Jews as conservative allies, and in the same sentence damn Zionists. I do believe that most on TD are either supportive or indifferent of the Jewish people. However, it would be pants on head to say that it was %100 one way. As I said before, my point was not initially about TD, but here we are, right?\n\nAgain, I'm sorry if this hurts your world view and/or feefee's, but I'm just pointing out facts. \n\nLast response from me, feel free to PM if you want an honest discussion. I'm always open for actual discussion.", "score": 1, "send_replies": true, "subreddit": "HistoryMemes", "date_year_month": "2019-05", "created_utc_converted": "2019-05-16 02:07:56", "score_overall": 11, "words": "globalist globalist globalist globalist globalist holocaust jewish conspiracy globalist jewish jewish", "shared_words": "globalist holocaust jewish conspiracy", "socre_distint": 4}
{"author": "WrecksMundi", "body": "&gt; By your logic, if I pointed out that \"That school bus is yellow\", I would be at fault for all school buses being yellow.\n\nI'm sorry, what? That's not at all my logic.\n\nThe school bus ***is*** yellow. You aren't an \"Anti-Busimite\" for pointing that out. Which is the logic you're operating with.\n\nEither Jews *are* globalists, in which case it isn't anti-semitism, because it's the truth, or they aren't globalists, and you're just trying to stiffle all criticism of globalism by using a useful cudgel. \n\nNeither of which is a good look.\n\n&gt;I'm letting those reading this thread know what the dog whistles are\n\nOnly dogs hear dogwhistles. \n\nYou can't just declare that everyone using an incredibly common word is an anti-semite, and then smugly use your bullshit declaration like it's proof of your victory. \n\n[Unless you're telling me that Obama is a white supremacist.](https://compote.slate.com/images/5e297143-f1a9-4f95-ad26-2349eada8bf0.jpg)\n\n[A really virulent one.](https://secure.i.telegraph.co.uk/multimedia/archive/01822/obama_1822024c.jpg)\n\n[Always flashing that hate symbol](https://i.imgur.com/WtECP2r.jpg)\n\n[And so is Hillary Clinton](https://i.imgur.com/nzYv3qG.jpg)\n\n[And Bill Clinton](https://i.imgur.com/0EdFtJb.jpg)\n\n[And Nancy Pelosi](https://i.imgur.com/NlOG1Wg.jpg)\n\n[And Jackie Chan](https://i.imgur.com/rKUaPnh.jpg) \n\nAnd etc. etc. etc. etc.\n\n&gt;but I'll TL;DR this for your clapemoji-ridden brain\n\nThe clap emojis were for your benefit. \n\nPeople like you who think that absolutely everything is hateful bigotry seem to be physically incapable of understanding basic concepts if they aren't sandwiched between clap emojis.\n\nYou were literally using people not being happy with someone making racially motivated calls to violence as if it was proof of anything, while completely ignoring that he had made calls to violence, and is in the process of harassing a 14 year old girl.\n\nAs a grown man. \n\nWho has made calls to violence.\n\n&gt;That first link was an error\n\nBecause everything about it contradicted your initial assertion...\n\n&gt;And again, if you disagree with my label of dog whistle having anti-semetic roots, that's okay, you're just wrong\n\nAnd you're an insane conspiracy theorist peddling complete bullshit if you think the person talking about being against globalism because American manufacturing got outsourced to China is somehow \"anti-semitic\". \n\nGlobalism is a real issue, affecting billions of people every day, and attempting to shut down all opposition to it by labeling it all \"anti-semitic\" is some of the most bullshit censorious thought controlling authoritarianism I've ever seen\n\n&gt;We were in Syria because the globalist plan was to cut Russia off from their energy profits by creating a pipeline from Qatar to the Balkans to supply Europe with Natural gas. The pipeline had to travel through Syria and Assad (an ally of Russia) said no. Who would of thought, another middle eastern conflict based around energy profits. Color me surprised.\n\nNotice how that has absolutely nothing to do with Jews? \n\nNotice how it has nothing to do with Israel? \n\nNotice how he's condemning acts of war in the name of profit, and didn't say anything that could even possibly make you think that he was talking about jews, unless you wholeheartedly believe that the jews are in fact behind globalism and are pulling the strings behind the curtain? \n\nMaybe if ***you*** backed the fuck up and cooled it with your obsession with jews being globalists, you'd finally figure out that people almost never mean \"jew\" when the say \"globalist\". Just like the \"Ok\" hand sign doesn't actually mean \"White Power\" to 99.99999% of people who do it. \n\nSo either he's not a anti-semite and Barrack Obama isn't a white supremacist, or they both are. Pick ***one*** and stick to it.\n\n&gt;A clear blanket statement thinking that one terroristic statement from a man should immediately damn all Jews on Twitter to the same level.\n\nThat's not at all what's happening. \n\nHe's pointing out that there's a clear and observable pattern of behavior where Jewish people on twitter will make racist remarks about white people while claiming to be white, only to say that they aren't white but Jewish later. \n\nOnce again, you don't get to play the victim when you're spouting hateful racist rhetoric against another racial group and get called out for it.\n\nJust like it isn't \"anti-semitism\" to point out an observable and verifiable fact. \n\nYou wouldn't be defending people pretending to be Jewish to shit on Jews, so why are you doing it for the opposite direction? \n\n&gt;If you had read what I said, I stated that TD is split on the Jewish people. There are those who see Orthodox Jews as conservative allies, and in the same sentence damn Zionists\n\nZionism and Judaism are completely different things, once again. \n\nAnd trying to conflate the two is only slightly less bullshit that trying to say that Globalist=Jews. And actually leads directly to anti-semitism. You're fueling the very thing you claim to want to combat.\n\nBecause you can't try use the religion as a magical shield to protect a nation that has committed a litany of literal war crimes, and at least 1 genocide, from perfectly valid criticism, and then be surprised that people begin to resent that religion. \n\nIf you can't criticize Israel for firing on lifeboats [a literal war crime] after they attacked the USS Liberty because the people who did it are Jewish, you'll just start to resent jews. \n\nIf you can't criticize Israel for being racist bigots and forcibly sterilizing Ethiopians who utilized the right of return, because the people who did it are Jewish, you're just going to make more people resent Jews. \n\nUsing the religion itself as a blanket defence against all backlash to anything done by members of that religion is fucking asinine.\n\nStop trying to kill valid and needed criticism of a racist apartheid state.\n\n&gt;Again, I'm sorry if this hurts your world view and/or feefee's, but I'm just pointing out facts.\n\nYou really aren't. \n\nYou're spouting a bunch off nonsense", "score": 1, "send_replies": true, "subreddit": "HistoryMemes", "date_year_month": "2019-05", "created_utc_converted": "2019-05-16 03:33:13", "score_overall": 11, "words": "conspiracy globalist jew globalist jewish jewish jewish jewish globalist jewish jewish", "shared_words": "conspiracy globalist jew jewish", "socre_distint": 4}
{"author": "skykingdarel", "body": "Sorry started writing and got carried away\n\nWell they went after him on Twitter, so it wouldnt suprise me if it wasn't on the news. Twitter journalists flaming a celebrity isnt really a headline story. This is the first I heard of it. \n\nBesides that if I was one of those big players I wouldn't go out of the way to blast him, I'd just keep my mouth shut. Straight up trying to use media control to smear Elon as an antisemite would be a little ham fisted for this kind of thing, especially because he didn't specifically mention the Jewish faith. These people are smarter than that. Better to ignore him and let the little journalists do what they do best.\n\nThe keys to a controlled media are silence, distraction, and repetition. With the whole question of why every media company is owned by Jews, for a start they simply never mention it or anything even remotely close to the topic. When you and a few buddies control 90% of the media production in the country, you can erase entire outlooks from the country simply by never airing them. \n\nWhat they do repetitively show to their audience is the jew as a victim, and often as the most helpless sort. The holocaust is used as a cugel to label \"antisemites\" as the most vile form of racists, the absolute worst of humanity. If an antisemitic crime is committed somewhere in the country, it is given a glowing spotlight. Sometimes they drag out stories about gathering neo-Nazis just to drive it home that the Jews are innocent victims and utterly unthreatening to anyone. That way when people hear anything that even hints to something seriously weird about the Jews in power, they will immediately shut themselves off and label that person as one of those evil antisemites on the news. If someone were to mention something like that despite making up 1.4% of Americans, thirty of the one hundred richest people in this country are Jewish, most people will react angrily, sometimes even violently. All because of programming repeated for our entire life and drilled deep into the mind. \n\nThey do a similar thing for conspiracy theorists in general. The term was coined by the FBI, who created the trope of the crazy gross conspiracy theorist in the first place. This has been perpetuated by the media and is now most peoples default image for the conspiracy theorist. That way when someone starts telling you that monolithic media corporations are programming your behavioral patterns, morals, and loyalty through the media and that you should seriously be concerned, there is already a modeled response. Its kind of like a vaccine. They hear these things, identify them as \"conspiracy talk\" and file it away with the flat earth theory as some weirdos delusion just like the news said to. Ten years ago how would people have reacted if you insisted that the government collects and stores every phone call, text and email in the country? You'd be called a loony. But you would have been right.\n\nOccasionally someone important will slip up and say something questioning the Jews, and on these occasions we are reminded the punishment for not responding to the priming. Usually the loss of jobs, friends, family, as well as harassment from strangers,  and just a general wave of hatred and social rejection. Anyone who questions these things is treated like a monster and compared to the cartoonish nazis the media has prepared as basically the embodiment of pure evil. This is for all intents and purposes a pointed warning to anyone who starts questioning the programming. Don't say a word, or there will be serious social consequences. When people do begin to notice things about the Jews, they know they need to say nothing unless with someone who is trusted completely. \n\nThese people are very, very good at this stuff.  A lot of work has been done in the field of mass psychology in the last fifty years. From early psychological experiments to the rise of mass data collection services, the people in power have amassed a wealth of data and a system of tools which allow the subtle control of the masses. How many of your values or opinions have been taken from movies, tv, or the internet? Try to identify the ones that seem forced or just odd. Some of these might not be your own. You will find the conditioning is buried deep, but even just awareness of it is an important step. The goal of these organizations is to shape your thoughts, but to do it in a manner that makes you believe they are your own. For example, a choice between two political parties which are functionally similar but depicted as hated opposites which let you decide such key issues as what bathroom people should use or whether we should smoking weed is chill. Meanwhile the real players hash out issues we couldn't understand well enough to vote on in the first place, ones that actually matter.\n\nEh what started as a comment grew into as essay but whatever. The point is those who control the media control how we perceive the world outside our home. This is a power that they very deliberately use, and have gotten very good at with. And yes, the owners of the six major media conglomerates in America are all Jewish. There is a similar trend in the banking industry though that is a slightly different topic. Its not just Jews though, our government itself uses similar tactics, as well as any other major first world government", "score": 3, "send_replies": true, "subreddit": "conspiracy", "date_year_month": "2019-05", "created_utc_converted": "2019-05-16 17:19:23", "score_overall": 9, "words": "jewish jew holocaust jewish conspiracy conspiracy conspiracy conspiracy jewish", "shared_words": "jewish jew holocaust conspiracy", "socre_distint": 4}
{"author": "thinkcontrol", "body": "&gt;Why is this Anti-semitic belief shared by so many on the far-right?\n\nNot all forms of antisemitism are equal. You may hate Jews, because of how they treated you, or behaved towards your kind, but the extent to which you do varies. A far-right European man and an Islamic Arab man would have separate reasons, as you can see from the host of crimes or actions the manifesto mentions. \n\n&gt;Why is that?\n\nThis is an apt scenario for many casual observers to analyze. Both manifestos reacts to Jewry. Brenton is reacting to Islamic invasion of the West. Earnests is reacting to a wider picture of Jewry. How is the anti-Islamic sentiment associated with Jewry? If you dig into a bit of history, between the Abrahamic faiths and its peoples, a Muslim conquest would be afforded by Jewish aid. Muslim invaders would leave control of a region or city to Jews, Moors, etc. while Christians died defending. Jewish encyclopedia states \"It remains a fact that the Jews either directly or through their co-religionists in Africa, encouraged the Mohammedans to conquer Spain.\" In other words, Jews and Muslims work in tandem to sever the ties of a nation from its Christianhood.\n\n&gt;As far as I could tell its some \"white genocide conspiracy theory\" but who are these jews in power carrying this out?\n\nI'm not entirely sure where they base the theory from, but I've recollected the Kalergi plan and Hootan plan as possible foundations, as well as the book You Gentiles. The Talmud could be one of the inspirations, as much as an atheist would refer the Bible, its nitpicked quotes for example, as one of their reasons to oppose Christianity. Oddly enough, my pathway to atheism came from a Jewish author who argued against Christianity. \n\nI think some time ago, when Communists, widely regarded as Jewish revolutionaries in letters and correspondence, from Soviet Russia, came to America as spies, politicians, etc. their economics was not welcome with open arms. They had to pressure, buy, kill, whatever means necessary to take hold of U.S. politics. AIPAC, an unregistered foreign agent of Israel, is on par with the influence of the Military Industrial Complex. These Communists infiltrated both major parties and subverted them to meet one goal: serve Israeli interests. Communists on the right shifted into Neocons, Communists on the left had very few changes to mold into Democrats of today. They only had to dial up the Liberalism every decade or so. Because the left holds Individualism with high regard, it is simple for strangers, foreigners, immigrants, LGBT, minorities, etc. to ease into that ideology and way of life. \n\nDemocracy is determined by demographics. If you invite and flood en masse immigrants of every walk of life, you can undermine the traditions and culture of America very quickly with a new population. The emphasis on minorities and LGBT was not as strong until women could vote. Hence the cries of patriarchy and clarion calls for social justice. Egalitarianism is considered 'common sense' in this day and age, because of how slowly politics transformed from within by foreign actors of influence. The far right believes that this creeping common sense interpretations works on the average Conservative because it evokes their sense of equality despite its insidious effects on the nation. On a related note, Earnest could have mentioned that the Hart-Cellar Act was pushed by a Russian Jew. \n\nBut who are these Jews? Before I understood social identity theories, Jews, to me, were nothing but a religious group. I noticed, even when I wasn't trying to notice, that people, of MSM and entertainment positions, many would consider White or Anglo, were in fact Jews. I thought why is there an emphasis on skin. There is a better form of categorization, which is agenda. Lots of leftist talking points had a clear agenda, as you might yourself be aware. But it took me some time to notice how right wingers and religionists were subverted by Jews. The only form of ethnostate or nationalism afforded by the right were Zionist in nature. White nationalism was quickly snuffed out, even more so on the right. However, opposition to Islamic culture or Muslim peoples was just fine. Then pieces started to fall in place. The strength of the American military and MIC would be able to defend Israel. American interests were co-opted by Israeli interests. Muslim nations were destabilized at the expense of American blood and money with Jewish leadership. If you look at the Neocons who push the Iraq war, you might see the aims of foreign policy. \n\nThe far right is anti semitic for their own perceived reasons if they prioritize their own nation, blood, soil, culture, over foreign actors, allies, etc. As far as I can tell, accusations of antisemitism is a means to prevent their return to tradition, by extension retake control. There is a recoil to being labeled an antisemite, they way liberals act choked should bigotry from their past surfaces. It is not a coincidence either. ADL is a Jewish organization that has power over social media networks and have the capacity to censor and most importantly define wrongthink. \n\nBut what about non-Jewish, Christian, atheist politicians? I fear it's the same scenario in social sciences. To prevent any visible Jewish influence from showing, they give outward facing positions to gentiles. This helps to cover their tracks should the science community divert from a disinterested pursuit to a political one. I'm not giving the explanation any justice here, so I have to point you to The Culture of Critique by Macdonald. If you can follow this train of thought, Ilhan Omar serves a purpose with her antisemitism, so that right wingers as a whole naturally rebel not just against Muslims, but antisemites. You cannot be a politician, at least a successful one, without towing the line of Jewish interests, even if it means play dead or decoy. \n\n&gt;So islamists and extreme right-wingers (whatever you wanna call John Earnest idk what label to give him) share the same hate and contempt for jews?\n\nThey hate Jewish behavior for different reasons the way someone tackles a perceived problem from different angles. \n\n&gt;And is it jews as in the ethnicity, the people of Israel? Or is it just jews, believers of judaism?\n\nEarnests implies both. Tarrant implies Jews who misbehave. Earnests has some insight that Jews with power will destroy gentile structure. Tarrant believes Israel is acting on its own interests the way America should act on its own interests. In any case, they both seem to recognize the fact that Jews as a whole act as a unit, as if to say there is a Semitic agenda, and that there is a gentile agenda. \n\n&gt;Why are jews considered a bigger threat than islamists?\n\nWell, the Abrahamic faiths have lots in common. Diaspora is not exclusive to Jewish people. Islam also functions as a diaspora and can use this form and status as a means of attack and conquest. If Muslims cannot go ideologically, they spread racially, and where they cannot go as a race, they go as ideas. Islam cycles between being a race, religion, philosophy, body politic, culture, and means of law. Adopting as many traits as it can, at any given moment, in whatever combination will most enable it fly beneath the radar. In Earnests point of view, Jews have done the same within U.S. politics, as an ally and an oppressed minority. It's quite possible that Earnests believes that Russia is a bastion of Christianity, and this modern opposition to Russia, using America as a political war machine, is a form of Jewry that is more dangerous than Islamists overseas. White Americans have died serving for Israeli interests, according to Earnests; in fact, I believe he would recall that the Talmud refers goyim, or non-Jews, to be slaves.", "score": 1, "send_replies": true, "subreddit": "AskTrumpSupporters", "date_year_month": "2019-05", "created_utc_converted": "2019-05-17 22:44:20", "score_overall": 14, "words": "jewish jewish conspiracy jewish jewish jew jewish jewish jewish jewish jewish jewish jewish goyim", "shared_words": "jewish conspiracy jew goyim", "socre_distint": 4}
{"author": "insaniak89", "body": "&gt;\tlike for example the claims that Nazis used some bizarre masturbation machines to collect jewish semen (for some reason?), that Nazis made lampshades out of jewish skin (lol; debunked even by Holocaust museums), the Holocoaster (a roller coaster that took prisoners from stops and at the final stop rolled them all into a big fire pit \n\nNo one says any of this stuff... I mean, maybe the history channel nowadays between episodes of pawn stars and ancient aliens but they be making history up now and no one takes them seriously, like wrestling fun to watch but no one thought our man died in that limo explosion. maybe some assholes - but I don’t think anyone is taking this kinda stuff seriously. Show me a legit history book that mentions your roller coaster.\n\nNo one cares if anyone questions any part of WWII history. It’s when someone makes assertions like “the number has been inflated to serve the mysterious Jewish cabal.”\n\nBut there’s no more a Jew cabal than there is a black cabal or Islamist cabal. (I almost said white cabal but there kinda is.)\n\nPointing to these kinds of conspiracy theories is comforting because it makes the world look a lot simpler than it is. The worlds a scary complicated place and it’s very nice to believe there’s some shady org behind all the things that you find upsetting. Some group that’s making people complacent. But if, in reality anything is making people complacent it’s insane conspiracy theories. This, anti-Vax, and 9/11 truthers are destroying any legitimacy conspiracy theorists had, and that’s a shame, since we had legit things like the CIA spreading crack around black communities and MKultra. Those aren’t theories anymore, but nowadays if you question the government people think of things like anti-vax bullshit.\n\nIt’s a shame", "score": 1, "send_replies": true, "subreddit": "forwardsfromhitler", "date_year_month": "2019-05", "created_utc_converted": "2019-05-18 22:40:31", "score_overall": 8, "words": "jewish jewish holocaust jewish jew conspiracy conspiracy conspiracy", "shared_words": "jewish holocaust jew conspiracy", "socre_distint": 4}
{"author": "mrhouse1101", "body": "I think that, in the long run, we will have to have a one state solution. If you look at israeli policy thus far, they are using the settlements as a way of increasing their power and influence over the region and expanding the territorial control. The difference between pro-Israel and pro-palestine is really the moral interpretation of these actions. pro-Israel says that israel is doing this to preserve itself (defensive) pro-palistine is saying that they are doing this to expand their power and influence (offensive). But, in the end, the result is the same. The expulsion of the Palestinian people from the area.\n\nI think that the long term (meaning several decades) goal of the international community will be trying to find a way to integrate arabs into israel and convert israel from a jewish state into a secular cosmopolitan democracy. Like the US. But Zionists dont want this because this would mean that israel would no longer be a jewish majority state. Arabs would have significant impact on the elections results. I think future generation will be more open to this idea as society becomes more secular and multiculturalism becomes the norm. The rise in a nationalism accross the world is simply a \"last hurrah\" of a bygone era where people were divided into ethnic or religious identities. But in the words of Heath Ledger's joke *\"These mob fools [aka nationalists] want you [other identites] gone so they can go back to the way things were. But I know the truth. There is no going back. You've changed things. Forever.\"*\n\nLiberalism and globalism are a Pandora's box. We've opened this can of worms and now there is no going back. The only way is forward. We should be trying to find ways of improving the economic conditions of Palestine, giving them aid, improving their education. Once they are economically viable for mass global trade, more countries, including Israel, will start viewing them as a potential ally rather than an enemy or a burden. \n\nRemember, in a globalist capitalist system, the only forces more powerful than hate and fear are greed and lust. By integrating the palestinians into the world economy, we will be able to bring them peace and prosperity in the long run. \n\nAlso, poverty makes people more desperate and leads to increased radicalism. Just look at 1930s Germany. Their economic crisis paved the way for fascism. Helping people economically will do the opposite. Lowering inequality and increasing prosperity will inevitably help stabilize the region. Otherwise, people who have nothing to loose will resort to violence and will rely on religiouse zealots to empower their anti-imperialist revolutions. That's why I support BDS. Because it gives palestinians an option B. Rather than resorting to violence, they can resort to boycotts and occasional riots/prostests. It channels their anger in the right direction (as in, away from guns and artilary shells). Like this movement or not, silencing it will only result in more palestinians viewing option A as more viable.\n\nI also think palestine would greatly benefit from more international students coming to learn there. It will cause their economy to boom. I think having an program where israeli student and palestinian students visit both nations are good. On one hand, its risky because this can he leveraged by terrorist organizations who can use this as an opportunity to kidnap Israeli students. But this is also why it can be so effective. Because it will show the world who the true enemies of Israel and Palestine are (the ethnic nationalists, zealots and terrorists). Also, it's a lot harder to keep a territory closed off and occupied when people from your country want to trade freely with that territory. This will inevitably result in more people in israel and in the west becoming sympathetic to palestine and will also result in economic prosperity and growth.\n\nIt will also deter more terrorist attacks because war and terrorism are bad for business. And as I've stated before, in our global economic and geopolitical system, love for money trumps hate for other people. That's why in the United states, so many companies are going liberal/left. Because it's more profitable when everyone is buying into your brand, not just one subset of the population.", "score": 1, "send_replies": true, "subreddit": "IsraelPalestine", "date_year_month": "2019-05", "created_utc_converted": "2019-05-18 23:56:26", "score_overall": 5, "words": "jewish jewish globalist greed silencing", "shared_words": "jewish globalist greed silencing", "socre_distint": 4}
{"author": "mattrbchi", "body": "&gt;  Your Hasbara points are, well, a little rusty.\n\nNot as rusty as your fake history claims. \n\n&gt; Since you obviously support ethnic cleansing\n\n&gt; Since you obviously support .... genocide\n\nPalestinians have 4x times increased in population since Israel's inception. That's the opposite of ethnic cleansing or aggressive behavior of carnage as you might claim. Palestinians are ethnically Arab. Arabs are over half a billIon. Jews are only 25 million.\n\n&gt; Since you obviously support ... apartheid\n\nUnder SA apartheid or Jim Crow: blacks had no voice in government or in the courts; they couldn't be part of mainstream society in politics, professions, the army or police.\n\nIn Israel: Arabs vote, work in any profession anywhere, including the army or the police, as lawyers and judges; non-Jewish judges were in the courts that sent a former president of Israel and a former prime minister to prison in Israel! Arabs serve in the Israeli parliament, the Knesset. Arabs can visit any park, beach or public facility. They can buy property almost anywhere if they chose to do so. Visit Israeli hospitals and you'll see Arab and Jewish doctors and nurses working side by side, on Arab and Jewish patients in the same wards and rooms.\n\nThe official language of Israel is Hebrew… and Arabic. All the street signs are in Hebrew, Arabic and English.\n\nWhere does the apartheid \"second class citizen\" myth come from? From the same source that the medieval blood libel against Jews came from: ignorance, prejudice, jealousy, pre-conceived stereotypical racist stigma, and from political or religious indoctrination that give an excuse to hate Jews.\n\n&gt; Since you obviously support ... oppression\n\nIsraeli Arabs have full equal rights and as Arabs, live better in Israel than in any Arab countries. They don’t only have equal rights, they have more rights, as non-Jews have a right Jews do not, the right to refuse to do military service. They can also go on the Temple Mount without being escorted by security.\n\nIsraelis, especially if they are in IDF uniform, get punished severely by Israeli law for committing any kind of hate crime or discriminatory act against an Israeli minority. In contrast, the Palestinian Authority rewards those and the families of those who commit crimes against Israelis, from throwing rocks to suicide bombings, with money, fame, and prestige.\n\nA Palestinian [died](https://www.timesofisrael.com/palestinian-shunned-for-selling-land-to-jews-to-be-buried-in-jewish-cemetery/) in a car crash last month and was told he could not be buried in a Muslim cemetery because he did business with Jews. Israeli Jews buried him a Jewish cemetery anyway. So oppressive.\n\n&gt; Since you obviously support ... torture\n\nIsrael does not torture. I dont know where you are getting this info. Palestinians are known to be [horrific animal abusers.](https://www.haaretz.com/amp/gaza-cattle-torture-worst-ever-1.5298966). They even [torture cats](https://www.americanthinker.com/blog/2007/08/torturing_cats_on_hamas_tv_for.html) on their [kids shows.](https://youtu.be/e2MMjc8ZXlI).\n\n&gt; Since I am, as people around here know, originally from israel\n\nYour Israeli identity does not shield you from claims that your ancestors were not doing anything for holocaust victims. \n\n&gt; you evidently don't speak Hebrew \n\nI took Modern Hebrew classes for 3 years in public high school and 3 years in public college.\n\n&gt; holey land\n\nWhat the hell is Holey land?\n\n&gt; More reading for you - Shlomo Sand, the famed israeli historian\n\nShlomo Sand, the fake historian who claims that there is no such thing as the Jewish people and that the Land of Israel is a myth. If It's not the Jewish homeland then neither is it his and therefore he should leave. This guy spews out junk history that Palestians are just converted Jews.\n\n&gt; How about starting something different like r/hasbara?\n\nYour fellow Progressive Jews like IfNotNow are actually being [praised](https://archive.fo/9C43M) by Neo-Nazi's for hating on mainstream Jewish organizations.\n\nBy the Leftist tradition of saying anything bigoted around your circle makes you bigoted. That means IFF is complicit in neo-Nazi hate as well by their logic.\n\nIfNotNow protested outside of Chabad houses like the one that was shot up.\n\nYour fellow Progressive Jews like Jewish Voice for Peace protest outside synogogues and Jewish businesses just like Nazi's did to Jews in the 30's. Jewish Voice for Peace also prays for the souls of attempted Jew killers on the Gaza border. This is a cult.", "score": 0, "send_replies": true, "subreddit": "WayOfTheBern", "date_year_month": "2019-05", "created_utc_converted": "2019-05-20 19:38:21", "score_overall": 14, "words": "jewish jewish jewish libel jewish jewish holocaust jewish jewish jewish jewish jewish jewish jew", "shared_words": "jewish libel holocaust jew", "socre_distint": 4}
{"author": "jambocombo", "body": "The alt-right/right-wing argument is that said 20% is only really conservative to take advantage of certain pro-military elements of the right (which tend not to be the same elements of the right complaining about Jews, as the alt-right itself tends to be anti-interventionist) for pro-Israel reasons, that is, basically fifth columnists.\n\nWhat percentage of Jews can you find that are both conservative and concerned about the possibility of Jews having an outsized influence on America/the world in the same way non-Jewish right-wingers tend to be?\n\n&gt;If we're positing a worldwide jewish conspiracy, you have to include all the jews. \n\nThis is another strawman. Can you find a credible alt-right source that claims 100% earnestly that literally ever single Jew ever is involved in a conspiracy and that there are no internal divisions among Jews whatsoever?\n\nAlt-rightists tend to acknowledge the divisions between \"right-wing\" (generally in favor of social conservatism, at least for Israel) Jews and more left-wing/cosmopolitan/globalist ones, but they're still against both because neither group seems to have much internal concern about things like Jewish overrepresentation in academia, etc. \n\nAs for the main difference between the two, they interpret the left-wing Jews as either being too rich (too ensconced in their gated neighborhoods and other enclaves of wealth) to care about the socially degenerative effects of leftism, too \"high on their own supply\", or pursuing a strategy of \"sound family morals and ethnic nationalism for me, social degeneration and multiculturalism for thee\" (and indeed many of those who decry \"white nationalism\" and \"patriarchal values\" are often in dedicated, monogamous relationships and much less concerned about Jewish nationalism).\n\nThe above may not be completely accurate, but it's far more reasonable than the incredibly thin strawmen of right-wing/alt-right concerns about Jews that I'm seeing all up and down this thread. It's a whole lot of sloppy thinking, accepting the basic binary division between \"conservative\" and \"liberal\" at face value without acknowledging any differing interpretations of them and focusing entirely on the political elements of the issue even though anything involving Jews obviously has an element of ethnic tribalism involved too.", "score": 7, "send_replies": true, "subreddit": "TheMotte", "date_year_month": "2019-05", "created_utc_converted": "2019-05-20 19:44:03", "score_overall": 8, "words": "jewish jewish conspiracy jew conspiracy globalist jewish jewish", "shared_words": "jewish conspiracy jew globalist", "socre_distint": 4}
{"author": "JeweledEdge", "body": "I'll try not to repeat things others have said regarding the factually wrong claims about Judaism from your post.\n\nFirst off, let me introduce myself a bit.  I grew up very secular, only to go down a dark path in my teenage years, getting involved with real satanism.  I'm not talking about the white middle class teenage rebel badass atheism satanism to annoy our parents but the actual occult, animal sacrifice, cover ourselves in blood, seance, conjurings, low to mid level crime satanism.  After some drama that I'm not going to get in to, I came to explore my Jewish roots as I was exposed to a lot of kaballah as a result of my past so the curiosity and search for clarity and truth was there.  Now, about a decade later, I'm a frum, hassidic woman living in Jerusalem.  I do consider myself a feminist but not in the modern political man hating sense but the classic equal opportunity sense.\n\n&gt;Unlike Christianity, Judaism has never had a serous reform movement that has appealed to all Jews.\n\nYou realize the Reformation also didn't appeal to all Christians?  That's why there are Catholics AND Protestants.  They went to a terribly bloody war with each other over it.  What makes reformation \"real\" if some people change and reform while some remain in the classic tradition?\n\n&gt;Instead, we've fractured into distinct sects--Orthodox, Conservative, and Reform--which seldom even recognize one another as \"Jewish\" (everybody recognizes Orthodox Jews as Jewish, but Orthodox Jews seldom recognize Reform Jews as Jews). \n\nRealize, before the haskala, there were only Jews.  Afterwards, the Reform Jews labeled themselves \"Reform\", as that's what they claimed to do.  They labeled the frum Jews \"Orthodox\" since they clung to the traditional roots of the religion.  Conservative came about some decades later as a middle ground between the two because the Reform was too antithetical for some people but they were sympathetic to the intention of the attempt to do such a reformation.\n\n&gt;Without a Temple, we can't burn people alive, stone them to death, strangle them, or cut off their heads, it just wouldn't be kosher.\n\nNo, without a sanhedrin, a Jewish court, we cannot do such a thing.  But I implore you to read how jurisprudence works in the rabbinic context because you would see how difficult it actually is to put someone to death.\n\nhttps://en.wikipedia.org/wiki/Capital_and_corporal_punishment_in_Judaism#In_Rabbinic_Judaism\n\n&gt;Should the Third Temple ever be built, and there are some very active Orthodox groups in Israel trying to make this a reality, you should expect so see Israel descend into an ISIS like blood state almost over night\n\nAnd who would this Jewish ISIS target?  You use really harsh language but you've already demonstrated your lack of Jewish history and your lack of understanding Jewish law, so why should we accept your view regarding a messianic goal?\n\n&gt;Reform Judaism has undoubtedly done much to promote women's rights and gender equality. \n\nAt what expense?\n\n&gt;You can argue that it might not have done enough or that there's more that Reform and Conservative Judaism could do to promote gender equality\n\nSuch as what?  They (reform) already allow women to do any role a male rabbi can do. They allow same sex marriage, intermarriage, bar/bat mitzvah for non jews, bark mitzvah for dogs, and probably more I'm unaware of.  The conservative at least keeps some decorum and don't completely turn Judaism into a money making scheme for themselves.\n \n&gt;but there's really no denying that Reform Judaism at least is ahead of the game when it comes to women's rights .I'm not Reform (I'm an atheist), but I think Reform, and even Conservative, is deserving of some praise for their recognition of women as intrinsically human and as being deserving of the same rights as men.\n\nIs it actually praiseworthy when an organization uses women to push a political agenda with the intention of being contrary?  Aren't they more like an object when people go \"look at that woman!  She's a rabbi and she's doing that politically liberal (leftist) thing we really like!\"  Women are used as objects to sell things like cars and food.  Why not use them to sell something sexy like a \"progressive\" religion that appeals to your political leanings?\n\n&gt;Compare this, however, with Orthodox Judaism. For example, in all Orthodox synagogues men pray separately from women, and in many women are relegated to an upstairs gallery.\n\nYes, we pray separately.  No, not necessarily upstairs.  It all depends on the architecture of the building.  Most places I've entered are side by side, sometimes men in front of the women, but rarely are they the balcony style.  That isn't to say those don't exist, they certainly do.  But there are many layouts so you should be more honest about that.\n\nBut you also need to explain why men and women praying separately is a bad thing.\n\n&gt;Gender hierarchies are entrenched in ~~Jewish~~ thought:\n\nFTFY.  Hierarchies are everywhere pal.\n\n&gt;a blessing Orthodox Jewish men are required to say everyday thanks a God \"who has not made me a woman\".\n\nThat is correct.  Why do the men say such a blessing?  What does it actually mean?  Surely you have an answer since you're so passionate about this topic.  I imagine you did your research.\n\nBTW, whether or not in the context of a bracha, if I say, \"I'm glad I'm not a man,\" is that a mysandric statement?\n\n&gt;This contempt of women was perhaps made most glaring early last year when the Israeli Orthodox Mishpacha magazine published an article on the Holocaust, only to have digitally blurred any images containing women\n\nContext matters here.  There are many views on modesty in Judaism, many leniencies and stringencies.  Unfortunately, you can't please all the people all the time no matter what you do.  My guess is that the magazine assumed that, when it comes to their audience, this was the wise decision.  I imagine a secular person like you has no interest in subscribing to the magazine, so they won't consider your feelings on the matter.  A more liberal, orthodox Jew may be a subscriber and not like the decision, but they would at least be understanding and sympathetic to the editors decision since they live the lifestyle.  To feign anger at this is silly.  It's like if I got mad at a similar editorial choice in a Christian or Islamic publication.  I'm not their audience so while I can have feelings about their editorial choices, I'm not their target audience.\n\n&gt;So where is the #MeToo of Jewish women?\n\n#metoo has a specific context and I don't agree with using it outside of the sexual abuse context or else it'll render it meaningless.\n\n&gt;Why is there nothing but deafening silence about this systematic silencing and even erasure of Jewish women in the Orthodox world?\n\nI mean, this is patently false.  There is much in the orthodox world of powerful, influential women.  While I'm not personally a fan, Women of the Wall plays a role in bringing women closer to Torah Judaism, learning sources, praying, and having a love of Torah.  It's unfortunate that some of what they do draws such ire, but that's going to happen with any group pushing the boundaries like that.\n\n&gt;Because you cannot say anything if you don't have a mouth and Orthodox Jewish women don't have the right to speak out about this oppression.\n\nThere are those that do speak of the oppression.  You can find numerous op-eds on most Jewish blogs or newspapers out there.\n\n&gt;And for those of us who are not Orthodox, we know we're not supposed to speak about these issues because if we paint the Orthodox badly, we're guilty of treason, of bringing the nation of Judaism into shame.\n\nYou're not the first nor the last to do this.  Stop acting like such a martyr.  It's silly.\n\n&gt;So in the end, we're as guilty of perpetuating this abuse of women as the Orthodox themselves are.\n\nSo stop abusing women.\n\nMy thoughts:\n\nThere are a number of fascinating Orthodox Jewish women you clearly aren't aware of.  Rebbizen Heller was a dear mentor of mine once upon a time.  The late wife of Rabbi Machlis ran the most giving home in Jerusalem, hosting over 100 people, Jewish, non Jewish, etc - every shabbat for countless years.  Penina Taylor who works on anti missionary programs.  Rebbizen Brodt who still caters to her late husbands following of us Chibakuk-niks.  I'm sure there are many other women I'm unaware of as I can only network so far by myself.  Plus, there are plenty of male rabbeium who are infleuntial and matter to women, but I guess they only matter if you care what women think.\n\nAdditionally, https://www.facebook.com/ravaaron/posts/10157467053776995 \n\nRabbi Aaron Lebowitz who is an influential figure in the Jerusalem community has come out in favor of giving women smicha.  While he is doing something progressive that'll rustle a lot of feathers of more traditional people, I support what he's doing for various reasons.  So your claims against the orthodox world lose and merit they may have had once they're put in context.  \n\nNote: not all my uses of \"you/your\" are aimed directly at you.  It's just the voice I write in so please read it as a universal second person. It is not specifically you in all instances, but it is in some.  For instance, I don't know your political leanings, but I do know your knowledge of Jewish history, so that should begin to give you an idea of how to take my response.", "score": 0, "send_replies": true, "subreddit": "DebateReligion", "date_year_month": "2019-05", "created_utc_converted": "2019-05-20 21:43:06", "score_overall": 21, "words": "jewish jewish jewish kosher jewish jewish jewish jewish jewish jewish holocaust jew jewish silencing jewish jewish jewish jewish jewish jewish jewish", "shared_words": "jewish kosher holocaust jew silencing", "socre_distint": 5}
{"author": "cisxuzuul", "body": "I know about it, I stomached enough conspiracy theory to shit a red hat. Honestly, I'm pro-palestinian and I'm pro-jew, what I am against is the extermination of people on their own land. My great-grandparents didn't survive the Japanese, so I'm a smidge bias about that. A Holocaust happened, numbers could be higher or lower but that does not diminish that a Holocaust happened to the Jewish people. \n\nNor does it diminish what happened in the Armenian genocide, the Bosnian genocide or how we abandoned the Kurds or whatever the fuck has happened in the Middle East over the past 30ish years and what we're trying to do on our southern borders.", "score": 1, "send_replies": true, "subreddit": "WatchRedditDie", "date_year_month": "2019-05", "created_utc_converted": "2019-05-21 00:22:23", "score_overall": 5, "words": "conspiracy jew holocaust holocaust jewish", "shared_words": "conspiracy jew holocaust jewish", "socre_distint": 4}
{"author": "pussy_seizure", "body": "By James Angelos\nMay 21, 2019\n\nOne of Wenzel Michalski’s early recollections of growing up in southern Germany in the 1970s was of his father, Franz, giving him some advice: “Don’t tell anyone that you’re Jewish.” Franz and his mother and his little brother had survived the Holocaust by traveling across swaths of Eastern and Central Europe to hide from the Gestapo, and after the war, his experiences back in Germany suggested that, though the Nazis had been defeated, the anti-Semitism that was intrinsic to their ideology had not. This became clear to Franz when his teachers in Berlin cast stealthily malicious glances at him when Jewish characters — such as Shylock in “The Merchant of Venice” — came up in literature. “Eh, Michalski, this exactly pertains to you,” he recalls one teacher telling him through a clenched smile. Many years later, when he worked as an animal-feed trader in Hamburg, he didn’t tell friends that he was Jewish and held his tongue when he heard them make anti-Semitic comments. And so Franz told his son Wenzel that things would go easier for him if he remained quiet about being Jewish. “The moment you say it, things will become very awkward.”\n\nAs a teenager, Wenzel defied his father’s advice and told a close friend. That friend quickly told his mother, and the next time Wenzel saw her, she reacted quite strongly, hugging him and kissing his face: “Wenzel! Oh, my Wenzel!” Now a stocky, bearded 56-year-old, Wenzel recalled the moment to me on a recent Saturday afternoon. He raised the pitch of his voice as he continued to mimic her: “You people! You are the most intelligent! The most sensitive! You are the best pianists in the world! And the best poets!” In his normal voice again, he added, “Then I understood what my father meant.”\n\nWenzel Michalski is now the director of Human Rights Watch for Germany. He and his wife, Gemma, an outgoing British expat, live in a cavernous apartment building in the west of Berlin. In their kitchen, Gemma told me that after arriving in Germany in 1989, she often got a strangely defensive reaction when she told people she was Jewish; they would tell her they didn’t feel responsible for the Holocaust or would defend their grandparents as not having perpetrated it. And so, to avoid conversations like these, she, too, stayed quiet about being Jewish.\n\nRecently, the Michalskis’ youngest son became the third generation of the family to learn that telling people he is Jewish could cause problems. The boy — whose parents asked that he be called by one of his middle names, Solomon, to protect his privacy — had attended a Jewish primary school in Berlin. But he didn’t want to stay in such a homogeneous school for good, so just before he turned 14, he transferred to a public school that was representative of Germany’s new diversity — a place, as Gemma described it, where he “could have friends with names like Hassan and Ahmed.”\n\nThe first few days there seemed to go well. Solomon, an affable kid with an easy smile, bonded with one classmate over their common affection for rap music. That classmate introduced him to a German-Turkish rapper who would rap about “Allah and stuff,” Solomon told me. In return, he introduced the classmate to American and British rap. Solomon had a feeling they would end up being best friends. On the fourth day, when Solomon was in ethics class, the teachers asked the students what houses of worship they had been to. One student mentioned a mosque. Another mentioned a church. Solomon raised his hand and said he’d been to a synagogue. There was a strange silence, Solomon later recalled. One teacher asked how he had encountered a synagogue.\n\n“Everyone was shocked, especially the teachers,” Solomon later told me about this moment. After class, a teacher told Solomon that he was “very brave.” Solomon was perplexed. As Gemma explained: “He didn’t know that you’re not meant to tell anyone.”\n\nThe following day, Solomon brought brownies to school for his birthday. He was giving them out during lunch when the boy he had hoped would be his best friend informed him that there were a lot of Muslim students at the school who used the word “Jew” as an insult. Solomon wondered whether his friend included himself in this category, and so after school, he asked for clarification. The boy put his arm around Solomon’s shoulders and told him that, though he was a “real babo” — Kurdish slang for “boss” — they couldn’t be friends, because Jews and Muslims could not be friends. The classmate then rattled off a series of anti-Semitic comments, according to Solomon: that Jews were murderers, only interested in money.\n\nOver the next few months, Solomon was bullied in an increasingly aggressive fashion. One day, he returned home with a large bruise from a punch on the back. On another occasion, Solomon was walking home and stopped into a bakery. When he emerged, he found one of his tormentors pointing what looked like a handgun at him. Solomon’s heart raced. The boy pulled the trigger. Click. The gun turned out to be a fake. But it gave Solomon the scare of his life.\n\nWhen Solomon first told his parents about the bullying, they resolved to turn it into a teaching moment. They arranged to have Wenzel’s father visit the school to share his story about escaping the Gestapo. But the bullying worsened, Gemma told me, and they felt the school did not do nearly enough to confront the problem. The Michalskis went public with their story in 2017, sharing it with media outlets in order to spark what they viewed as a much-needed discussion about anti-Semitism in German schools. Since then, dozens of cases of anti-Semitic bullying in schools have come to light, including one case last year at the German-American school where my own son attends first grade, in which, according to local news reports, students tormented a ninth grader, for months, chanting things like “Off to Auschwitz in a freight train.” Under criticism for its handling of the case, the administration released a statement saying it regretted the school’s initial response but was taking action and having “intensive talks” with the educational staff.\n\nThe principal of Solomon’s school, in an interview with the German newspaper Die Welt, also said his school had made a concerted effort to resolve the problem. When the reporter asked him if the bullying illustrated the “unreflective behavior of pubescent youths” or “rooted anti-Semitism,” the principal paused to say this was a “very dangerous” question but then answered: “It’s very possible that anti-Semitism is the motive. But we can’t look inside the heads of these students.” (When asked for comment, a representative for the Berlin Senate Department for Education, Youth and Families, which oversees Berlin’s public schools, said it had put into place anti-discrimination measures such as training courses and workshops for students and faculty.)\n\nFor the Michalskis, all this was evidence that German society never truly reckoned with anti-Semitism after the war. Germany had restored synagogues and built memorials to the victims of the Holocaust, Wenzel said: “So for a lot of mainstream, middle-class people, that means: ‘We’ve done it. We dealt with anti-Semitism.’ But nobody really dealt with it within the families. The big, the hard, the painful questions were never asked.” In Wenzel’s view, the Muslim students who tormented his child were acting in an environment that was already suffused with native anti-Semitism. “A lot of conservative politicians now say, ‘Oh, the Muslims are importing their anti-Semitism to our wonderful, anti-anti-Semitic culture,’ ” he said. “That’s bull. They’re trying to politicize this.”\n\nJewish life in Germany was never fully extinguished. After the Nazi genocide of six million Jews, some 20,000 Jewish displaced persons from Eastern Europe ended up settling permanently in West Germany, joining an unknown number of the roughly 15,000 surviving German Jews who still remained in the country after the war. The new German political class rejected, in speeches and in the law, the rabid anti-Semitism that had been foundational to Nazism — measures considered not only to be morally imperative but necessary to re-establish German legitimacy on the international stage. This change, however, did not necessarily reflect an immediate conversion in longstanding anti-Semitic attitudes on the ground. In the decades that followed, a desire among many Germans to deflect or repress guilt for the Holocaust led to a new form of antipathy toward Jews — a phenomenon that came to be known as “secondary anti-Semitism,” in which Germans resent Jews for reminding them of their guilt, reversing the victim and perpetrator roles. “It seems the Germans will never forgive us Auschwitz,” Hilde Walter, a German-Jewish journalist, was quoted as saying in 1968.", "score": 7, "send_replies": true, "subreddit": "TrueReddit", "date_year_month": "2019-05", "created_utc_converted": "2019-05-21 15:27:20", "score_overall": 17, "words": "jewish holocaust jewish merchant jewish jewish jewish holocaust jewish jewish jewish jew holocaust jewish jewish holocaust jewish", "shared_words": "jewish holocaust merchant jew", "socre_distint": 4}
{"author": "melechshelyat", "body": "&gt; We can see that in the ties modern politicians / groups / movements have to well documented anti-semitic views. The most recent examples are the Unite the Right rally in Charlottesville, VA where protestors chanted \"Jews Will Not Replace Us\", Rep. Steve King's ties to the Austrian Freedom Party, or Former Deputy Assistant to the President and Strategist Sebastian Gorka, who has ties to Vitézi Reend and the neo-nazi Hungarian Guard.\n\nThis is the US, sure enough. What you've left out is that leaders of the Women's March [have ties to and defend Louis Farrakhan, who called Jews termites](https://www.washingtonpost.com/local/anger-over-farrakhan-ties-prompts-calls-for-womens-march-leaders-to-resign/2018/11/21/6d925942-edb4-11e8-8679-934a2b33be52_story.html). You've left out that Rep. Keith Ellison, who until recently was a Rep. and now is Minnesota's AG, [had dinner with Iran's President and Louis Farrkhan together](https://www.timesofisrael.com/senior-democrat-keith-ellison-dined-with-iranian-president-louis-farrakhan/). Two other Democratic Congresspeople were at the same dinner.\n\n&gt; Left wing movements have often been criticized for their critiques of Israeli policy, most notably in regards to Israeli policy towards Palestine. The majority of these claims against the left come from the Labour Party (UK) mishandling a situation that was seen as some as being anti-semitic\n\nIt's not mishandling \"a situation\". It's a long, serious pattern of antisemitism, not something \"seen as some as being antisemitic\".\n\nPlenty of Labour members have outright left the party over antisemitism. [51% of Brits](https://news.sky.com/story/more-than-half-of-britons-think-labour-has-serious-antisemitism-problem-poll-reveals-11696752) think Labour has a \"serious antisemitism problem\" (I bet it's higher if \"serious\" was left out). Only 18% disagreed. Painting it as \"some\" is disingenuous at best.\n\nMore than [85% of British Jews](https://www.thejc.com/news/uk-news/more-than-85-per-cent-of-british-jews-think-jeremy-corbyn-is-antisemitic-1.469654), the people paying the most attention, think the head of Labour is antisemitic.\n\nAmong the things Labour has done or failed to do, and Corbyn personally has done:\n\n* Praised Raed Salah as an \"honourable citizen\", after Salah was convicted for hate speech for claiming Jews steal Christian babies and use their blood for Passover matzoh. That includes praise *after Salah was convicted again on appeal in UK courts*.\n\n* Said a mural depicting antisemitic themes (Rothschilds running the world alongside other wealthy figures) shouldn't be taken down.\n\n* Was part of multiple Facebook groups with regular antisemitic content posted.\n\n* Labour's antisemitism training is being [run by a Labour activist](https://www.thejc.com/news/uk-news/labour-activist-behind-antisemitic-rant-is-to-deliver-training-on-jew-hate-to-party-members-1.484235) who claimed Jews were making up claims of antisemitism, called Jewish leaders \"part of the problem\" for allegedly making this up, and based on false statements that a Jewish group had allied with an extremist far-right group, said \"What on earth are Jews doing in the gutter with these rats?\", as though one Jewish group (even if it had allied with the group, which it hadn't) represents all Jews.\n\n* Went to meetings for and praised Deir Yassin Remembered (as well as donated to it), even after the leader of the group was revealed to be a Holocaust denier.\n\n* Claimed that Stephen Sizer, who has posited numerous conspiracy theories and antisemitic claims, including 9/11 trutherism, was being criticized for being anti-Israel, despite his blatant and open antisemitism (they're not the same thing, obviously).\n\n* Laid a wreath for the planners of the Munich Massacre where 12 Israeli Olympians were killed at the Munich Olympics in 1972, then denied he was at that particular ceremony (claiming it was for different dead Palestinians), then photos and evidence confirmed he was in front of it, then he said he was there but \"didn't think he was involved\" in laying the wreath for those antisemitic terrorists, then filed a complaint with the British regulator for media accuracy claiming it was all a smear, then withdrew the complaint quietly when no one was looking.\n\nI could go on, and on, and on. It's not one small thing. There are reports of tens of thousands of instances of antisemitism all throughout the Labour party, all being ignored. Seriously, a [15,000 page report](https://www.timesofisrael.com/jewish-group-releases-report-with-15000-instances-of-labour-party-anti-semitism/) was recently released by the Labour Against Antisemitism group, showing hundreds of members and officials making antisemitic comments and posts online.\n\n&gt; statements made by Ilhan Omar which many believe taken out of context\n\n\"Many\". Look, she apologized herself for at least two of them, which pretty much everyone said were antisemitic because they *were*.\n\n&gt; Many on the right have also tried to paint the BDS movement as anti-semetic (it's not)\n\nThe BDS movement has its goal as the destruction of Israel, according to its leaders. You can disagree with Israeli policies, you can criticize it, but calling to destroy Israel is antisemitic. That's not just my opinion, that's the opinion of the EU, US, and even the [head of the UN](https://www.jpost.com/Israel-News/UN-Chief-Guterres-UN-will-treat-Israel-with-impartiality-503600).\n\nCalling to destroy Israel, as the BDS movement calls to do, is a call to deny Jews the internationally guaranteed right of self-determination. Denying Jews a right is antisemitism, plain and simple.\n\n&gt; If you were to try to make an argument as to who is more anti-semitic, its undoubtedly the right wing in the context of contemporary western politics.\n\nI don't think there's a way to reliably measure or compare the two. Both have strong antisemitic tendencies right now.\n\n&gt; However, I don't think its particularly productive to assert that Israel can't be criticized at all and anyone who is critical is automatically anti-semitic.\n\nNo one even said this here and it's completely disjointed from everything else we're discussing. This is just you trying to plant some kind of weird argument that no one is talking about.\n\nThere is a long history of antisemitism on the left. Heck, look at Ford himself. He was happy to hire black workers and was a staunch supporter of President Wilson (Democrat). But he was a virulent antisemite, as you've noted.\n\nOn university campuses today, the most left-wing students are happy to espouse [antisemitic views](https://blogs.timesofisrael.com/brother-where-art-thou-a-call-to-join-the-defense-of-israels-right-to-exist/). The author there writes about how he went to a campus to talk about Israel and provide a counterpoint to the anti-Israel views there, and found students:\n\n&gt; But before I could get a response out of my mouth, the student would answer their own question with a blunt yet shocking answer, and it would always begin with, “A a Jew, I hope you don’t get offended but…” And that’s when the Protocols of the Elders of Zion would come rushing out of the gates: the Jews control the media; the Jews control politics; the Jews own all the money; and the Jews band together for complete world domination.\n\n&gt; This did not happen once, twice or three times, but occurred on five separate occasions.\n\nThere are plenty of examples of other universities with the same problem. Remember Rachel Beyda, the Jewish student who [said a Jewish student couldn't be unbiased](https://www.cnn.com/2015/03/10/opinions/kosmin-anti-semitism-campus/index.html) (dual loyalty accusations have a long history of use against Jews, and no other student was asked a similar question ever for another background). There's plenty of university professors who say similarly antisemitic things, though sometimes they substitute \"Israel\" for \"Jews\". One Columbia professor [said Israel is responsible for most of the world's problems](https://www.timesofisrael.com/columbia-u-alums-call-for-professor-to-be-suspended-over-anti-zionist-posts/), and calls \"Zionists\" a \"Fifth column\" (sound familiar? Nazi rhetoric, replacing \"Jews\" with \"Israel\" and \"Zionists\").\n\nOver at Williams College just now, [students](https://www.tabletmag.com/jewish-news-and-politics/284998/separate-and-unequal-on-campus) on the left tried to hold pro-Israel student groups to a separate standard. That's not antisemitic in and of itself, but then they hid the video of the student government meeting, and tried to keep the transcript private. A reporter got ahold of it, and among the things said were:\n\n&gt; The student who made the assertions about World War II assured the council, “I have a lot of Jewish friends.” Another dismissed anti-Semitism as a possible motive, since “the Arabs are actually Semites, so the term anti-Semitic is not very accurate to describe whatever people use it to describe.” In a revealing admission, however, the council’s note taker excluded “clearly anti-Semitic things” from his minutes of the April 23 council meeting.\n\nSo not only did they *exclude clearly anti-Semitic things* from being written down, they *still left in* common antisemitic tropes. This is how they described the Holocaust:\n\n&gt; Unlike the seemingly unending Israeli occupation of the West Bank, “the purpose of these [World War II] ghettos were basically to control, segregate, and separate the Jewish people for short periods of time.”\n\nIf you're talking about right-wing and left-wing, they take different forms and hide in different ways, and different segments of society follow each. It's impossible to compare, but allowing it to slide on one side or the other as your post does is really just partisanship hiding behind arguments.", "score": 1, "send_replies": true, "subreddit": "Ask_Politics", "date_year_month": "2019-05", "created_utc_converted": "2019-05-21 17:15:49", "score_overall": 14, "words": "jew jewish jewish jewish holocaust conspiracy jewish jew jewish jewish jewish jewish holocaust jewish", "shared_words": "jew jewish holocaust conspiracy", "socre_distint": 4}
{"author": "DangerousCyclone", "body": "&gt;lol in what world is Zionism separate of Judaism and only about Israel.\n\n[The real world?](https://www.google.com/search?q=zionism)\n\n\" a movement for (originally) the re-establishment and (now) the development and protection of a Jewish nation in what is now Israel. It was established as a political organization in 1897 under Theodor Herzl, and was later led by Chaim Weizmann. \"\n\n&gt;If we are allowed to criticize Christianity and other religions, why not Judaism?\n\nWhat? Nothing in this entire thread has been criticizing Judaism. If you criticize the Bible, criticize the Talmud or religious traditions like Kosher food, then you'd be criticizing Judaism. But criticizing Zionism isn't the same thing as criticizing Judaism, nor is it the same thing as anti-semitism.\n\n&gt;Especially considering the vast majority of Jews in Israel are Zionist?\n\nBut this isn't criticizing Israel, this is claiming that their political opponent is a Jewish puppet. This is echoing antisemitic propaganda like the Protocols of Zion which are the basis of a ton of conspiracy theories, namely that the Jews control world politics. Just like what this piece of shit in question is trying to say. Not all Jews are Israeli, not all Israelis are Jews, and not all Jews are Zionist.\n\n&gt;It is believed that you are a self-hating Jew if you are Jewish and do not support Zionism, you are also an anti-semite if you are not Jewish and criticize Zionism, it has become part of the religion.\n\nUm this is just the more far right and far left voices. The average person thinks you can be Jewish and criticize Zionism without being self hating, likewise you can be non-Jewish and criticize Israel.", "score": 0, "send_replies": true, "subreddit": "europe", "date_year_month": "2019-05", "created_utc_converted": "2019-05-21 23:27:44", "score_overall": 9, "words": "jewish kosher jewish conspiracy jew jewish jewish jewish jewish", "shared_words": "jewish kosher conspiracy jew", "socre_distint": 4}
{"author": "akashisenpai", "body": "Well, that was a long read.\n\nAnd I too appreciate the calm nature of this discussion; an exchange that more people should have more often, rather than either migrating into echo-chambers to receive cheap confirmation of even the weirdest worldview, or just screaming and hurling insults against one another.\n\nBy all likelyhood, you probably won't be surprised that I remain unconvinced. A conspiracy of this magnitude - capable of rewriting history and manipulating school curriculums on a global scale - would require an unrealistic amount of cohesion and secrecy with no room for leaks throughout a scope of centuries, not to mention resources. I had a sinking feeling this would be about Jews the very moment you mentioned \"ethnicity\".\n\nBut don't you find it strange, then, that this ominous threat that has control over *all* the media (you know, the world is a bit bigger than just the US) and the way we write our history did not manage to erase the most obvious weak spot -- proof of their mere existence? Yet it is this allegedly manipulated history that, apart from the cherrypicked pieces you consider falsified, is at the same time your evidence for the wickedness of this ethnicity, whose evil ways are apparently passed on as a matter of blood, completely contradicting everything we know about human social dynamics.\n\nLikewise, don't you consider it strangely fruitous that this global genetic conspiracy did not manage to take control of the internet itself? The technical means to keep track of everything a person does on the web already exist, yet random people on the world wide web can apparently freely converse about this grand terrible secret. It *should* be easy to put a stop to such rumors and remove those dangerous activists who threaten to expose the conspiracy, no?\n\nTo say nothing of the internal inconsistencies of this theory, such as an inherently religious culture allegedly promoting atheism (or is the Jewish faith also just part of some cover?), or feminism being a Jewish plot (pretty sure some ultraorthodox Jew got a heart attack just about now purely because of the thought being mentioned). You also seem to be unaware that homosexuality was a thing that existed in other cultures before they even had contact with a European civilization, such as the concept of wakashudo among samurai, unless you'd assume that this, too, was just made up by Jews who would have full control over xenophobic Japan as well. And let's not even get started about the alleged link between Jews and communists, in spite of \n\nI don't even know where to start. Your perception seems to be based on the idea that it is simply impossible for people to come up with ideals of equality and tolerance by themselves; everything is connected to terrorism, there is no room for human beings simply trying to create a better world. I suppose this must mean that I, too, am a terrorist in your eyes, and I now find myself a bit creeped out by what might happen to me if things would go your way. You talk calmly and polite now, yet you justify wars of aggression (WW2), violent oppression of political opponents (COINTELPRO) and even leave open the question of whether the holocaust has actually happened, not even being able to admit that much of history may be true.\n\nYou actually go as far back as the Revolt of Judea, citing it as \"Zionists getting kicked out of a country\" and apparently missing the little detail that it was *their own homeland* that had been under Roman military occupation, and declare anti-taxation protests a \"political and ideological agenda\", seemingly missing out on the similarity to the US' own history in terms of gaining independence from the British Empire. I guess this part of history might just be not true for you as well, but then why would you link it as proof for your argument?\n\nIf *you* have read this far, my respect. I can only assume it must be frustrating to be presented with what must almost sound like a rant, and you probably believe me to be indoctrinated and another victim of this global conspiracy (which didn't even manage to prevent the fall of the USSR in spite of having all that power).\n\nI'm afraid if we can't even agree on basic history, and independent media as a reliable source of information, we really don't have much of a basis for a debate.\n\nThis may not mean much to you, but I hope that at some point you'll reconsider your perspective and begin to see people as individuals, rather than pre-programmed representatives of some stereotype, and the world to be far more diverse and complicated than this simple distinction into Good vs Evil, with many complex questions requiring complex answers, rather than a boogeyman whose destruction promises deliverance from everything that is bad. The world is far too wonderful and fascinating a place to dismiss in favor of isolationist ultraconservatism.", "score": 1, "send_replies": true, "subreddit": "europe", "date_year_month": "2019-05", "created_utc_converted": "2019-05-23 03:05:02", "score_overall": 8, "words": "conspiracy conspiracy conspiracy jewish jewish jew holocaust conspiracy", "shared_words": "conspiracy jewish jew holocaust", "socre_distint": 4}
{"author": "ValuableJackfruit", "body": "All minority groups advocate for multiculturalism, open borders etc, this is not specific to Jews. If you are an immigrant or a descendent of immigrants in a country you are way more likely to approve of further immigration etc based on emotional reasons, group interest etc. The difference is that Jews have a high social status while most other immigrant groups do not, so Jews have more power to actively influence politics, etc. Of course whites also do this, it's not specifically a Jewish thing but the liberal US Jews are very prominent in this sort of thing. It's also an economic issue, the multiculturalism/open borders/'strong empowered women must have careers' etc all of these things are essentially just propaganda by neoliberal capitalists  to get more workers, more cheap labour. It's all about money. And Jews are prominent in the field of 'money'. This is why Jews have always been disliked, they have high social status, influence over society, and work toward anti-nationalist goals. Other groups don't get the same hate because they simply never had the same amount of power. Add to this the fact that all of the Frankfurt School were Jewish, communism was invented by a Jew, communism in the Soviet Union was very Jewish dominated.\n\n Basically Jews have always had a large influence in all aspects of society in whatever country they lived in, and the objectives of these ruling classes are very often not in line with what the native population of these countries wanted which is why they have been thrown out of or exterminated in every country they have ever lived in. This is just an objective fact. Where people take it too far with the Jewish thing is the conspiracy thing IMO, the belief that Jews are intentionally working together to destroy whites etc like it is a deliberate strategy, like they are an organized group. This is obviously not true, the whole thing arises organically, as I said capitalists want cheap slave labour (whether they are Jewish or not), minorities will always want more immigration because it prevents racism against themselves, all ethnic groups prefer their own (hence the nepotism among Jews) and this is how you always end up with anti-Semitism - high powered ethnic minority ruling class ruling over another ethnic group and working towards goals that the native ethnic group doesn't like. And of course part of the reason why Jews are overrepresented in all these fields is simply because of their IQ / culture - they have always put education and money first, not all cultures have a tradition of this, which is why for example blacks and other groups are where they are today. But Jews are also very clannish and nepotism is rampant which contributes to why Harvard is like 30% Jewish etc, again this isn't a specifically Jewish thing, the same could be said about rich whites. People who have connections and are born into money are always way overrepresented in powerful positions than others, and Jews happen to be a group who are born into money and have connections. And whites don't like it when they use their power to advocate policies that won't benefit whites (multiculturalism)", "score": 2, "send_replies": true, "subreddit": "Narrative_Collapse", "date_year_month": "2019-05", "created_utc_converted": "2019-05-23 12:42:17", "score_overall": 10, "words": "jewish jewish jew jewish jewish conspiracy jewish clannish jewish jewish", "shared_words": "jewish jew conspiracy clannish", "socre_distint": 4}
{"author": "Rognvaldi", "body": "Heh, I tried to warn you!\n\n&gt; By all likelyhood, you probably won't be surprised that I remain unconvinced.\n\nBy all means, I figured you'd be a hard rock to budge, but you didn't find a single thing I mentioned to be unusual? You don't find it incredibly strange that a *single* family has control of [almost every central bank in every country?](http://humansarefree.com/2013/11/complete-list-of-banks-ownedcontrolled.html) You don't find it strange or, at the very least, an unhealthy obsession with wealth and ownership that this same family has had a monetary stake in almost every war since Napoleon Bonaparte fought and lost against the British in France, simply by virtue of owning those banks?\n\nHonestly, if I didn't know any better, I'd want to help them. Run up and give them therapy, as ineffective as I think I'd be at that.\n\nThat being said, you don't find it strange that a country that prides itself on diversity and unbiased representation somehow ends up filled with news corporations that are dominated by a single ethnic group &lt;link censored&gt; pMnWnWyS/moc.nibetsap//:sptth that is... less than 2% of the population in that country?\n\nYou don't find it strange that this same &lt;2% statistic is represented by having a same-ethnicity advisor to every US presidency for the last half-century?\n\nYou don't find it strange The Protocols has provided a carbon copy guidebook for how ALL NA/SA/EU societies have progressed since the start of the 1900s? (Left out Asia as they seem rightfully xenophobic and intolerant of other cultures, even though we have examples of them adopting communism and socialism- a far cry from what the west looks like today)\n\nYou don't find it strange how the presses weaponized the number '6000000' and the words 'Jews' and 'extermination'? ([Again, if you didn't look at it](http://goyimgazette.com/wp-content/uploads/sixmillion-34appearances.jpg)) In fact, you didn't find it strange at all how officials 'went to Russia' and determined that the **Russian** '**solution**' to the **'Jewish problem'** would end in **murderous extermination?** ([This image is from the NY Times.](https://12bytes.org/wp-content/uploads/ny-times-6-million-jews-1906.gif))\n\nOh, that's just one source with a shady history (not really, it's a popular paper that still exists today- look it up if you want), right? What about another, from the Milwaukee Sentinel in 1915. &lt;censored&gt; =fer?/=cGcq5SO5UmM4YzYwMHc691c3VmSlRXYulWbyVGd4V2b0NnbhxGczJXY6NUL1ETOxwWayBXQtwWZulGduV2UlV2a1F2dslWTlhGVtEWazNXdS1ybs9GSvoDa0FGc/aidem/98zak/resu/yrellag/moc.tekcubotohp//:sptth\n\nTwo questionable sources? [Here's another.](https://2.bp.blogspot.com/-887NWVcX9II/T28wf_dSEUI/AAAAAAAAEek/dtXV-UmGIWQ/s1600/;;;.jpg)\n\nNow let's be honest. 2/3 of these articles came about as a result of the Anti-Jewish Pogroms that occurred in Russia. The violence was an inexcusable act of mob justice that should not have occurred and claimed the lives of far more innocents than anyone who was guilty of anything (I'm speculating in favor of the victims here). That being said, I would not say '6000000' lives were threatened nor would I say that the Jews were being exterminated wholesale (while terrible, 14 and ~2000 deaths does not hold a candle to the entire population). Because of this, I retain my assertion that these terms were weaponized.\n\nI'm just curious how you reconcile those things in your mind.\n\n\n\n\n&gt; would require an unrealistic amount of cohesion and secrecy with no room for leaks throughout a scope of centuries, not to mention resources\n\nI think you're projecting your expectations of such an undertaking and are using those reasons as for why this couldn't work. We've established a line, difficult to trace or not, which has allowed for an abundance of leaks. [And leaks there have been!](https://theevilofzionismexposedbyjews.weebly.com/index.html) Otherwise we wouldn't be talking about this at all. Jews aren't a hivemind, and I never said they were. We're talking about a very specific group of people, many of which, if you watched the video I linked in my 3/3 post, think that non-Jews are worthy of only being slaves. For a group that 'needs a lot of coordination', that thought seems to get through pretty clearly. \n\nOn the context of resources, we're talking about a conspiracy where the culprits have come into control of the media and banking industries. We've proven that they proliferate there. Resources aren't out of the question.\n\n&gt; Likewise, don't you consider it strangely fruitous that this global genetic conspiracy did not manage to take control of the internet itself?\n\nMakes you wonder about 'Net Neutrality', doesn't it? Pushes for control are never instantaneous. Just like the Rothschilds built up their incredible banking empire over an extremely long period of time, so must Zionists adhere to the restraints involved in influencing politicians and vote outcomes to support authoritarian control over new forms of technology. [I'd say that the EU has been doing a pretty good job of pushing that sort of power creep.](https://www.theguardian.com/technology/2018/jun/20/eu-votes-for-copyright-law-that-would-make-internet-a-tool-for-control)\n\nYou've come across as pretty sharp so far, and frequently mention non-binary situations. Do you really trust that this censorship and implementation of filters for what users are able to upload stops at copyright laws? Do you really trust that the installation of AI-enforced filters won't lend itself to this idea of a globalist conspiracy?\n\n&gt; I had a sinking feeling this would be about Jews the very moment you mentioned \"ethnicity\".\n\nI'd like to be clear here: [we're talking about Zionists, which do not represent all Jews.](https://www.youtube.com/watch?v=oUppu2OHVTY)&amp;&amp; This is much in the same way as ISIS does not represent all members of the muslim faith and the KKK does not represent all non-blacks. I think there's a huge stigma here in differentiating Zionists and Jews as a testament to the presence of decades of indoctrination to lead you to believe that all Jews are above reproach.\n\n&amp;&amp; If you don't elect to watch the whole video for whatever reason, atleast look at this quote by the rabbi in the interview:\n\n&gt; [The question is: are you antisemitic?] Rabbi's Answer: That is the beautiful ploy of Zionism that they can intimidate anybody who stands in opposition to their blatant, inhumane treatment of the Palestinians- and mind you, we will show you, with God's help, that they are brutally beating the Jewish inhabitants who, and nobody can accuse us of being armed and militant, but you can see that the Jews are brutally beaten... because they're opposing the existence of the state.\n\nI hope that, at the very least, we can agree that Zionists are not all Jews.\n\nHell, the Zionists pushing globalism generally aren't even Jewish to begin with. Another topic, I suppose.\n\n&gt; control over all the media (you know, the world is a bit bigger than just the US)\n\nI never said they have control over literally all the media, but [anything over half is pretty convincing.](https://www.europeanfreedom.com/2018/05/14/jewish-control-of-the-media-in-the-united-states-and-therefore-around-the-world/)\n\n&gt; the way we write our history did not manage to erase the most obvious weak spot -- proof of their mere existence?\n\nLike you say, the world isn't black and white. Historians are of a free mind and record things as they interpret them. There's no one singular curator that all history must go through in order to be presented to the public, and that is why we have so many alternative history books and teachings varying on the country, whether they are truthful or not.\n\n&gt; such as an inherently religious culture allegedly promoting atheism (or is the Jewish faith also just part of some cover?)\n\nPrimarily, Jews hate Christianity because Christians claimed their religion and advocated that the Jewish messiah had finally come- to their distate, that messiah also revoked the Jews' title as the chosen people in favor of gentiles. As being a 'true' Jew is arguably a lineage issue, they don't really care what others believe, as long as it furthers Zionism. Non-Jews (goyim) are stupid slaves or cattle, remember?\n\n&gt; or feminism being a Jewish plot\n\nYou may have noticed \"giving women 'liberation'\" (quote marks included, hinting that it's unneeded) was part of The Protocols. The current waves of feminism do not advocate equality, but preferential treatment over men.\n\n&gt; You also seem to be unaware that homosexuality was a thing that existed in other cultures before they even had contact with a European civilization\n\nDo I? All I ever said was that it came alongside the 'new ideas' of the terrorists. Nowhere could you claim that I implied they invented the concept of homosexuality, nor do I think there's a little Jewish homosexuality fairy that convinces small children to not be straight even before they've been exposed to pop culture- that's just absurd. I think you're really misrepresenting my argument here.\n\n&gt; And let's not even get started about the alleged link between Jews and communists, in spite of\n\nI assume this is continued in the next paragraph? Kinda got me confused on the flow there.\n\n&gt;  Your perception ... impossible for people to come up with ideals of equality and tolerance by themselves\n\nIs it? I think all I instigated was that it heavily lended itself to Zionist control and the debasement of morality.\n\n&gt; everything is connected to terrorism\n\nYou're turning my argument into a bit of a hyperbole, now. Like I said, look for overwhelming commonalities to determine an infection. Parts can exist exclusive of said infection.\n\n&gt; You talk calmly and polite now...\n\nDo you assume I foam at the mouth in anger when I mention genuine and citable efforts of peace and mediation made by Germany before WW2? I'm almost offended =p\n\nOn the holocaust: I never denied it, just think it needs review for consistency. The # of deaths has changed much thru history.\n\n0/", "score": 1, "send_replies": true, "subreddit": "europe", "date_year_month": "2019-05", "created_utc_converted": "2019-05-23 18:00:41", "score_overall": 16, "words": "jewish jewish conspiracy conspiracy globalist conspiracy jewish jewish jewish jewish jewish jew goyim jewish jewish holocaust", "shared_words": "jewish conspiracy globalist jew goyim holocaust", "socre_distint": 6}
{"author": "slyweazal", "body": "**The President is creating a government shutdown crisis predicated on lies and racist rhetoric about illegal immigration.**\n\nAccording to the right wing think tank the CATO Institute, President Trump's administration has provided an incredibly misleading narrative about illegal immigration and crime.^[[1]](https://www.cato.org/blog/white-houses-misleading-error-ridden-narrative-immigrants-crime)\n\n&gt;But we should not tolerate the peddling of misleading statistics without context. What matters is how dangerous these subpopulations are relative to each other so the government can allocate resources to prevent the greatest number of murders possible. Thus, enforcing immigration law more harshly is an ineffective way to punish a population that is less likely to murder or commit crimes than native-born Americans. Illegal immigrants, non-citizens, and legal immigrants are less likely to be incarcerated, convicted, or arrested for crimes than native-born Americans are. \n\nThe Washington Post compiled statistical charts that indicate the Trump administration is lying when they claim illegal immigration is a crisis. They disprove Trump's lies including immigrants flooding the border (they're not), that they bring crime (they don't), and that they're a drain on the economy (they aren't).^[[2]](https://www.washingtonpost.com/news/wonk/wp/2018/06/21/theres-no-immigration-crisis-and-these-charts-prove-it/?utm_term=.5a93c2cb02fa)\n\n&gt;The administration has said that the country is in danger of being “overwhelmed” by “massive increases in illegal crossings” that will bring “horrible crime,” “unbelievably great taxpayer expense” and the loss of American jobs.\n\n&gt;None of those claims are true.\n\n&gt;...Here's what we can say in conclusion. Current rates of illegal immigration remain extremely low by historic standards. Legal and undocumented immigrants are significantly less likely to commit most crimes than native-born citizens, making them a net benefit to public safety. The research shows that immigrants are not taking jobs away from U.S. natives, and their impact on wages appears to be small to nonexistent, particularly across the long term.\n\n**President Trump's rhetoric is incredibly dangerous and is reminiscent of authoritarian leaders who have committed crimes against humanity.**\n\nThe President's rhetoric - his referral to undocumented immigrants as *\"infesting\"* the United States is incredibly dangerous and it is not the first time he has alluded to white nationalist talking points. First he tweeted it^[[3]](http://www.foxnews.com/politics/2018/06/19/republican-pressure-intensifies-to-end-family-separations-at-border.html) followed by him saying this as a statement during a speech later in the day.^[[4]](http://fox2now.com/2018/06/19/trump-ramps-up-rhetoric-dems-want-illegal-immigrants-to-infest-our-country/) Moreover, former Trump Campaign Chairman Cory Lewandowski went on national television and dehumanized a child with Down Syndrome who had been separated from their family.^[[5]](https://www.washingtonpost.com/news/morning-mix/wp/2018/06/20/womp-womp-outrage-after-corey-lewandowski-mocks-story-of-child-with-down-syndrome-separated-from-parents/?noredirect=on&amp;utm_term=.18f884832b12) President Trump has peddled anti-semetic conspiracies including the conspiracy that a prominent Jew is behind the migrant caravans^[[6]](https://thehill.com/homenews/administration/414171-trump-i-wouldnt-be-surprised-if-soros-were-paying-for-migrant-caravan) that he claims are *\"invading\"* the country.^[[7]](https://www.pbs.org/newshour/politics/watch-trump-defends-calling-migrant-caravan-an-invasion-ahead-of-midterm-elections) And Fox News has repeated extremely dangerous xenophobic rhetoric that these migrants are bringing diseases with them, they're not.^[[8]](https://www.vox.com/science-and-health/2018/11/1/18048332/migrant-caravan-fox-news-disease-smallpox-outbreaks-vaccines-xenophobia)\n\nSome experts have compared the President's statements to Nazi propaganda.^[[9]](https://www.timesofisrael.com/critics-say-trumps-description-of-immigrants-recalls-nazi-propaganda/)\n\n&gt;Social commentators pointed out that history has shown, particularly before and during the Holocaust, that “infest” — a term almost exclusively used to describe vermin — dehumanizes a population and is often a precursor to murder or genocide.\n\n&gt;“Democrats are the problem. They don’t care about crime and want illegal immigrants, no matter how bad they may be, to pour into and infest our Country, like MS-13,” the president tweeted. “They can’t win on their terrible policies, so they view them as potential voters!”\n\n&gt;One of the most notorious anti-Semitic films produced by Nazi Germany’s Ministry of Propaganda was “Der ewige Jude” (“The Eternal Jew”), with input from propaganda minister Joseph Goebbels.\n\n&gt;The US Holocaust Memorial Museum says that “One of the film’s most notorious sequences compares Jews to rats that carry contagion, flood the continent, and devour precious resources.”\n\n**These xenophobic conspiracy theories are incredibly dangerous. Recently a far right conspiracist murdered 11 people in a Synagogue.^[[10]](https://www.nbcnews.com/news/crime-courts/pittsburgh-synagogue-shooting-suspect-threatened-jewish-groups-pushed-migrant-caravan-n925256) The murderer believed in the same xenophobic, racist conspiracies that were being peddled by members of the GOP, President Trump and the American rightwing media sphere.^[[11]](https://www.washingtonpost.com/politics/2018/10/29/how-trumps-conservative-media-helped-mainstream-conspiracy-theory-now-tied-tragedy/?utm_term=.005def0fb638)**\n\n________\n\n1) [CATO Institute - The White House’s Misleading &amp; Error Ridden Narrative on Immigrants and Crime](https://www.cato.org/blog/white-houses-misleading-error-ridden-narrative-immigrants-crime)\n\n2) [Washington Post - There’s no immigration crisis, and these charts prove it](https://www.washingtonpost.com/news/wonk/wp/2018/06/21/theres-no-immigration-crisis-and-these-charts-prove-it/?utm_term=.5a93c2cb02fa)\n\n3) [Fox News - Republican pressure intensifies to end family separations at border](http://www.foxnews.com/politics/2018/06/19/republican-pressure-intensifies-to-end-family-separations-at-border.html)\n\n4) [Fox St. Louis - Trump ramps up rhetoric: Dems want ‘illegal immigrants’ to ‘infest our country’](http://fox2now.com/2018/06/19/trump-ramps-up-rhetoric-dems-want-illegal-immigrants-to-infest-our-country/)\n\n5) [Washington Post - ‘Womp womp’: Corey Lewandowski mocks story of child with Down syndrome separated from parents](https://www.washingtonpost.com/news/morning-mix/wp/2018/06/20/womp-womp-outrage-after-corey-lewandowski-mocks-story-of-child-with-down-syndrome-separated-from-parents/?noredirect=on&amp;utm_term=.18f884832b12)\n\n6) [The Hill - Trump: 'I wouldn't be surprised' if Soros were paying for migrant caravan](https://thehill.com/homenews/administration/414171-trump-i-wouldnt-be-surprised-if-soros-were-paying-for-migrant-caravan)\n\n7) [PBS - WATCH: Trump defends calling migrant caravan an ‘invasion’ ahead of midterm elections](https://www.pbs.org/newshour/politics/watch-trump-defends-calling-migrant-caravan-an-invasion-ahead-of-midterm-elections)\n\n8) [Vox - Fox News says the migrant caravan will bring disease outbreaks. That’s xenophobic nonsense.](https://www.vox.com/science-and-health/2018/11/1/18048332/migrant-caravan-fox-news-disease-smallpox-outbreaks-vaccines-xenophobia)\n\n9) [Times of Israel - Critics say Trump’s talk of immigrants ‘infesting’ US recalls Nazi propaganda](https://www.timesofisrael.com/critics-say-trumps-description-of-immigrants-recalls-nazi-propaganda/)\n\n10) [NBC - Pittsburgh synagogue shooting suspect threatened Jewish groups, pushed migrant caravan conspiracies](https://www.nbcnews.com/news/crime-courts/pittsburgh-synagogue-shooting-suspect-threatened-jewish-groups-pushed-migrant-caravan-n925256)\n\n11) [Washington Post - How the Trumps and conservative media helped mainstream a conspiracy theory now tied to tragedy](https://www.washingtonpost.com/politics/2018/10/29/how-trumps-conservative-media-helped-mainstream-conspiracy-theory-now-tied-tragedy/?utm_term=.005def0fb638)", "score": 21, "send_replies": true, "subreddit": "insanepeoplefacebook", "date_year_month": "2019-05", "created_utc_converted": "2019-05-24 06:36:18", "score_overall": 12, "words": "conspiracy jew holocaust jew holocaust conspiracy jewish conspiracy jewish jewish conspiracy conspiracy", "shared_words": "conspiracy jew holocaust jewish", "socre_distint": 4}
{"author": "TapTheForwardAssist", "body": "Really interesting!\n\nTo save anyone else having to look at shitty White Nationalist sites, the \"Steinlight Plan\" (based on some article some Jewish guy wrote in 2001) is a conspiracy that (((Jews))) realized that their diabolical plan to dilute the white race in America was a double-edged sword, because the minorities they're bringing in aren't guilt-ridden about the Holocaust so can't be manipulated like whites. And also their immigration plan was going *too* well and alarming whites, raising the danger that noble white Americans would get burned out feeling sorry for the Jews and just expel them.\n\nSo the Jews allegedly had to pull a U-Turn and start backing conservatives in order to dial down immigration a bit, both so they bring in new minorities slowly enough that they can be assimilated into Jew-loving, and also so whites don't get alarmed and backlash against their Jewish handlers.\n\nSo I guess some crazies are worried that Trump isn't a white savior, but is there to placate people so the Jews can slow-roll white genocide at a more sustainable level?\n\nDid I get the gist of that right?", "score": 18, "send_replies": true, "subreddit": "Qult_Headquarters", "date_year_month": "2019-05", "created_utc_converted": "2019-05-24 07:00:00", "score_overall": 5, "words": "jewish conspiracy holocaust jew jewish", "shared_words": "jewish conspiracy holocaust jew", "socre_distint": 4}
{"author": "NoLockedThreadsBot", "body": "Original post: [Imagine seeing a photo of a happy family and thinking this](https://reddit.com/r/insanepeoplefacebook/comments/bsa84u/imagine_seeing_a_photo_of_a_happy_family_and/) \n\nComments:\n\n    Author: Merari01 Body:     user reports:        2: This is spam        1: jewish propaganda        1: &lt;no reason&gt;        1: none of those kids are white. literally white genocide, retard        1: Not insane: con artist        1: It's rude, vulgar or offensive        https://www.youtube.com/watch?v=-MkRuV0aCcI\n\n    Author: FlaskyTg Body: That’s the literal grand dragon of the Ku Klux Klan. You should already know he is a crazy fucker.\n\n        Author: GordanHamsays Body: He's not just crazy, he's in the running for the 'worlds craziest fucker' every year, level of fucking crazy\n\n        Author: gualdhar Body: Worst part is sometimes he doesn't win.\n\n        Author: TheDunadan29 Body: You can't blame him, the competition is pretty stiff.\n\n        Author: Joystiq Body: Sometimes it can sneak up behind you tho\n\n        Author: BUTUNEMPLOYMENT Body: Go on?\n\n        Author: hahaha01 Body: I can't think of anyone who Trump(s) him.\n\n        Author: lurkarmstrong Body: God thanks you for this comment\n\n        Author: AlexJonesTrannyP0rn Body: Didn't he endorse Trump?\n\n        Author: ExactlyUnlikeTea Body: Lol why are you asking this like it was a question? Of course he did\n\n        Author: Warchemix Body: What really ?!               I am shocked and appalled /s\n\n        Author: BelongingsintheYard Body: I like his photoshopped bicep in his profile picture.\n\n        Author: FlaskyTg Body: It gets better. That picture is from a meme that was making fun of him and his soft lizardy body. He just cut it down.\n\n        Author: bacon_is_just_okay Body: &gt;soft lizardy body              omg\n\n        Author: Fresh_Bulgarian_Miak Body: Grand Lizard of the Klu Klux Klan\n\n        Author: fuckingwizards Body: r/rareinsults\n\n        Author: BelongingsintheYard Body: That’s hilarious.\n\n        Author: anonymom1 Body: That is a nice touch, isn’t it?\n\n    Author: CaptainBathrobe Body: They look like a loving family, which is probably why David Duke can't relate.\n\n        Author: madmaxturbator Body: He was married from 1974-1984. His ex wife then started fucking one of his klan buddies.              Dickbag David himself hasn’t been able to find anyone stupid enough to marry him since then apparently. And he travels in some really really stupid circles...              Ie. Dude got cucked and chucked. Beyond pathetic.\n\n        Author: Lookatmyhooves Body: Are they dead now or did nothing happen?\n\n        Author: eyetracker Body: His ex had another son with the founder of Stormfront, and the kid was in the news recently for repudiating Nazism.\n\n        Author: Lookatmyhooves Body: Beautiful\n\n        Author: FReed0mCHild Body: It's like poetry, it rhymes\n\n        Author: plz2meatyu Body: The best friend and wife married.  The best friend is the founder of Stormfront.  David Duke is their son's godfather.              Very typical of these types.\n\n        Author: mdemo23 Body: Keep it all in the family. Roll tide.\n\n        Author: Draked1 Body: &gt; Stormfront is a white nationalist,[3] white supremacist,[4] antisemitic, Holocaust denial,[5][6][7] neo-Nazi[8] Internet forum, and the Web's first major racial hate site.               [Wiki](https://en.m.wikipedia.org/wiki/Stormfront_(website))              God damn that’s an introduction\n\n        Author: PlG3 Body: Ah, the origin story\n\n        Author: PubliusPontifex Body: To be fair, that family pisses me off a bit because fuck me they're photogenic.\n\n        Author: caaksocker Body: They have no right to be that good looking in a family photo!\n\n        Author: PubliusPontifex Body: Why can't they all be ugly and miserable like the rest of us?!?!\n\n    Author: turnipheadstalk Body: He even added the triple parentheses for those who favor their racists anti-Semitic flavored.\n\n        Author: dublboyMom1217 Body: I don't get the parentheses thing\n\n        Author: NOTTallestEgg Body: if you put ((())) around somthing, it means its \"jewish\"                     example : (((cock and ball toture)))\n\n        Author: mundusimperium Body: THEY TOOK MY VIDYA, MY GF, AND NOW THEY TAKE MY FUCKING ***COCK AND BALL TORTURE***!?  WHEN WILL THIS WHITE GENOCIDE MADNESS END?\n\n        Author: el_t0p0 Body: 😤 totally unepic\n\n        Author: everadvancing Body: LITERAL MAYOCIDE\n\n        Author: internalservererrors Body: A moment of silence for Sunn O)))\n\n        Author: 6ThePrisoner Body: Also means globalists which they say is a Jewish conspiracy.  So many dog whistles when you know what to look for.\n\n        Author: poktanju Body: Globalists, Rotschilds, bankers, Bolsheviks, rootless cosmopolitans... it's hard to keep up.\n\n        Author: 6ThePrisoner Body: Rootless cosmopolitans? Wtf?  Is that a real one?\n\n        Author: sammypants123 Body: Absolutely. Mix ‘wandering jew’ with ‘jews are rich’.               Can’t think why Jews sometimes move around when they keep getting murdered or kicked out of places.\n\n        Author: Fogfish420 Body: It was a white supremacist twitter extension that automatically put parentheses around something Jewish. Ie if someone has the name Joseph Weinstein if would show to the supremacist as (((Joseph Weinstein)))\n\n        Author: arleban Body: Why?  Did it mean something before that?\n\n        Author: YangWenli1 Body: It used to be used for cyber hugging in AOL chatrooms.              [https://en.wikipedia.org/wiki/Triple\\_parentheses](https://en.wikipedia.org/wiki/Triple_parentheses)\n\n        Author: arleban Body: If only this creativity could be used for good...              Thank you for the link though.\n\n        Author: TheAtlanticGuy Body: So typical of Nazis to hijack something that used to be completely innocent and turn it into a hate symbol.              I mean what is the full list now?              * The Charlie Chaplin mustache              * The swastika              * The number 14              * Parenthesis              * A frog              * The OK hand sign              * Probably a bunch of others\n\n        Author: Nyxelestia Body: Indian here, wait til you hear what they did with that good luck symbol...\n\n        Author: Hekantonkheries Body: Some say hijack, some say it was given to them because people are scared that trying to defend the symbol would label them as sympathizers to the ones trying to steal it.\n\n        Author: digital_end Body: Decent people tend to leave shitty places.  While shitty people enjoy being surrounded by anger and hate, decent people leave it.               It's the same method used over and over to corrupt subreddits here.  Only idiots want to spend their day wallowing through a dozen \"I'm clearly being racist but not saying the N word so they can't ban me aren't I clever\" (or similar variants) types of posts, so they quit going to those places.  Meanwhile it emboldens the people who hold those views.               Over time the average type of user shifts, crosses a threshold, and it rapidly goes to shit... generally a while after, reddit has to block the subs.  Exactly what happened with the cringe subs recently as a current example.                 ...               So yes, symbols get taken and people don't want to associate with that trash so they quit using them... and so the only people using them are assholes.  Like the swastika itself for example.                 But amusingly, the better result for them is when people don't quit using them.  Because then the hate can be mixed in nicely with the common use... and anyone pointing it out is just 'being a snowflake'.  [Pepe](https://i.imgur.com/lXSWGjR.jpg) falls in that camp.  People whining about it is silly, but at the same time it is corrupted in those circles.  It works well for both spreading the intended message, and at the same time making people who call it out look silly because it's also commonly used outside of those groups.               Whole thing with symbolism and common use is a complicated and evolving mess.  Like the evolution of language itself.\n\n        Author: Quiet_Kate Body: I mean, if you go out of your way to make a stink about not being allowed to use a certain phrasing anymore and argue with people concerned about the actual risks of white supremacy then at best your priorities are kinda fucked up, at worst you're helping them recruit.               They only do it so that you will get mad at their detractors for saying you can't use those words. That is central to their online recruitment strategy and the main reason they choose harmless words in the first place.              The sooner you stop complaining and picking fights over it the sooner the words revert to their original meanings as the white supremacists move onto the next one.               Also maybe worth considering there are a lot of people out there with bigger reasons to be distressed about white supremacy than \"but I liked that woooord\"...\n\n        Author: dell_arness2 Body: I may be wrong on this, but I believe that in Nazi Germany, the names of jewish people were often printed in bold in state-sponsored media.  On platforms like twitter that don't have bold text, the parens are used as a substitute\n\n        Author: Amphibionomus Body: Actually the origin is a bit different, [https://en.m.wikipedia.org/wiki/Triple\\_parentheses](https://en.m.wikipedia.org/wiki/Triple_parentheses)              Started on a alt-right blog it seems.\n\n        Author: Jimothy_Riggins Body: I can’t remember the exact details, but I read somewhere about a popular audio recording white supremacist would listen to the had an echo effect.               My details are foggy, but I think it’s supposed to allude to an echo", "score": 1, "send_replies": true, "subreddit": "NoLockedThreads", "date_year_month": "2019-05", "created_utc_converted": "2019-05-24 07:37:50", "score_overall": 8, "words": "jewish holocaust jewish jewish conspiracy jew jewish jewish", "shared_words": "jewish holocaust conspiracy jew", "socre_distint": 4}
{"author": "Account235", "body": "Yes, yes, we all know by now that everyone who opposes the imperial war machine in any way is both a Russian agent and an antisemite. Jeremy Corbyn knows it, Ilhan Omar knows it, we all know it.\n\nThis one’s been around a while, ever since headlines blared in 2011 that Assange had complained of a “Jewish conspiracy” against him after an account of a conversation by Private Eye editor Ian Hislop. Assange responded to this claim as follows:\n\n    “Hislop has distorted, invented or misremembered almost every significant claim and phrase. In particular, ‘Jewish conspiracy’ is completely false, in spirit and in word. It is serious and upsetting. Rather than correct a smear, Mr. Hislop has attempted, perhaps not surprisingly, to justify one smear with another in the same direction. That he has a reputation for this, and is famed to have received more libel suits in the UK than any other journalist as a result, does not mean that it is right. WikiLeaks promotes the ideal of ‘scientific journalism’ — where the underlaying evidence of all articles is available to the reader precisely in order to avoid these type of distortions. We treasure our strong Jewish support and staff, just as we treasure the support from pan-Arab democracy activists and others who share our hope for a just world.”\n\n“We treasure our strong Jewish support and staff.” Man, what a Nazi.\n\nBut that wasn’t what cemented this smear into public consciousness. Two related events punched that ticket, and bear with me here:\n\nThe first event was the WikiLeaks account tweeting and then quickly deleting the following in July 2016: “Tribalist symbol for establishment climbers? Most of our critics have 3 (((brackets around their names))) &amp; have black-rim glasses. Bizarre.” The triple brackets are what’s known as echoes, which are a symbol that antisemites often put around words and names to hatefully indicate Jewishness in online discourse. In 2016 some Jewish people began putting the triple brackets around their own names on social media as a way of pushing back against this behavior, so if you really want to it’s possible for you to interpret the tweet as saying ‘All our critics are Jewish. Bizarre.’\n\nBut does that make sense? Does it make sense for the guy who announced “We treasure our strong Jewish support and staff” to then go making openly antisemitic comments? And if he really did suddenly decide to let the world know that he believes there’s a Jewish conspiracy against WikiLeaks, why would he delete it? What’s the theory there? That he was like “Oh, I just wanted to let everyone know about my Jewish conspiracy theory, but it turns out people get offended when an account with millions of followers says things like that”? That makes no sense.\n\nIf you look at the account’s other tweets at the time, it becomes clear that its operator was actually just trying to communicate an obscure, subtle point that was completely unsuitable for a massive international audience and 140 characters. When a user responded to the tweet before it was deleted explaining that some Jewish people now put triple brackets around their names to push back against antisemitism, the account responded, “Yes, but it seems to have been repurposed for something else entirely — a wanna be establishment in-group designator.” When accused of antisemitism by another account, WikiLeaks responded, “The opposite. We criticised the misappropriation of anti-Nazi critiques by social climbers. Like Ice Bucket Challenge &amp; ALS.”It looks clear to me that whoever was running the WikiLeaks Twitter account that day was clumsily trying to communicate an overly complicated idea about “social climbers” and establishment loyalism, then deleted the tweet when they realized they’d screwed up and stumbled into a social media land mine.\n\nNow, I say “whoever was running the WikiLeaks Twitter account that day” because it’s been public knowledge for years that @WikiLeaks is a staff account shared by multiple people. Here’s a tweet of the account saying “this is a staff account, not Assange.” Here’s a tweet of the account saying “@WikiLeaks is a shared staff account.” This became self-evidently true for all to see when Assange’s internet access was cut off by the Ecuadorian embassy for the first time in October 2016, but the WikiLeaks Twitter account kept making posts during that time without interruption. This takes us to the second event which helped cement the antisemitism smear.\n\nThe second event occurred in February 2018 when The Intercept’s Micah Lee, who has had a personal beef with WikiLeaks and Assange for years, published a ghastly article which made the following assertion:\n\n    “Throughout this article, The Intercept assumes that the WikiLeaks account is controlled by Julian Assange himself, as is widely understood, and that he is the author of the messages, referring to himself in the third person majestic plural, as he often does.”\n\nThere is absolutely no reason for Lee to have made this assumption, and the fact that this remains uncorrected in his original article is journalistic malpractice.\n\nThe article reveals Twitter DMs from a group chat of which the WikiLeaks account was a member. One of the other accounts in the group chat shared a tweet by journalist Raphael Satter, who was posting a smear piece he’d written about WikiLeaks. The WikiLeaks account responded as follows:\n\n    “He’s always ben [sic] a rat.”\n\n    “But he’s jewish and engaged with the ((())) issue.”\n\nWhen I first read about this exchange as written down by Micah Lee, I read it as “He’s always been a rat, but then, he is Jewish, and engaged with the ((())) issue.” Which would of course be gross. Calling someone a rat because they’re Jewish would obviously be antisemitic. But if you read the DMs, whoever was running the account didn’t do that; they said “He’s always ben a rat,” followed by a full stop, then beginning a new thought.\n\nNow if you look at the date on that exchange and compare it to the date on the deleted ((())) tweet, you’ll see that this was one month after the infamous ((())) tweet that had caused such a tizzy. It appears likely to me that the operator of the account (who again could have been any of the WikiLeaks staff who had access to it) was saying that Satter was mad about “the ((())) issue”, meaning the tweet so many people were so recently enraged about and were still discussing, hence his attacking them with a smear piece.\n\nThere are also claims about an association between Assange and the controversial Israel Shamir, which WikiLeaks denies unequivocally, saying in a statement:\n\n    Israel Shamir has never worked or volunteered for WikiLeaks, in any manner, whatsoever. He has never written for WikiLeaks or any associated organization, under any name and we have no plan that he do so. He is not an ‘agent’ of WikiLeaks. He has never been an employee of WikiLeaks and has never received monies from WikiLeaks or given monies to WikiLeaks or any related organization or individual. However, he has worked for the BBC, Haaretz, and many other reputable organizations.\n\n    It is false that Shamir is ‘an Assange intimate’. He interviewed Assange (on behalf of Russian media), as have many journalists. He took a photo at that time and has only met with WikiLeaks staff (including Asssange) twice. It is false that ‘he was trusted with selecting the 250,000 US State Department cables for the Russian media’ or that he has had access to such at any time.\n\n    Shamir was able to search through a limited portion of the cables with a view to writing articles for a range of Russian media. The media that subsequently employed him did so of their own accord and with no intervention or instruction by WikiLeaks.\n\nNow, we’re on Smear #16. There’s still a ways to go. If you’ve been reading this article straight through it should be obvious to you by now that there’s a campaign to paint Assange as literally the worst person in the world by calling him all the worst things you can possibly call someone. Is it possible that he’s some kind of secret Jew hater? Sure, theoretically, but there’s certainly no good argument to be made for that based on the facts at hand, and given the extent the narrative shapers are going to to paint him in a negative light, it’s a mighty big stretch in my opinion.", "score": 1, "send_replies": true, "subreddit": "france", "date_year_month": "2019-05", "created_utc_converted": "2019-05-24 14:01:33", "score_overall": 19, "words": "jewish conspiracy jewish conspiracy libel jewish jewish jewish jewish jewish jewish conspiracy jewish conspiracy jewish jewish jewish jewish jew", "shared_words": "jewish conspiracy libel jew", "socre_distint": 4}
{"author": "Zerkcs1", "body": "&gt; But who would decide that ? That's nightmarish.\n\nWealth would be assets in this sense. There are a lot of cases in the world where tools are held communally in towns and villages on an on need basis. Corn mashers in Mexican villages are an example of this. So...everyone. \n\n&gt;Marx was jew as long as most of the Bolchevists that overthrew the Tsar, their conquest created a country controlled mostly by them, which is also why I said they shared the same goals and ideas.\n\nOh my god are you SERIOUSLY going down the international jewish conspiracy route? \n\n&gt;Between 1918 and 1956, 66 million Russian died, and holodomor estimation's are between 20 and 30 million deaths, \n\n1. Source?\n\n2. According to wikipedia Holodmor had as many as 7.5 million deaths. But if we’re doing extended timelines, Holocaust was \"\"\"only\"\"\" 6 million and these are the big estimations so hum yeah\n\n3. [If we’re doing extended timelines, 60 million Indians alone died during the Raj from famine](https://en.m.wikipedia.org/wiki/Famine_in_India). Who knows how many more died from quasi-slave labor, failed independence battles, disease caused by the Brits, etc. Definitely more than 66 million\n\n&gt;Holocaust was \"\"\"only\"\"\" 6 million and these are the big estimations so hum yeah\n\nThe Holocaust wasn’t only Jews ya know. 17.5 million people were exterminated. Including 6 million Jews.", "score": 1, "send_replies": true, "subreddit": "dankmemes", "date_year_month": "2019-05", "created_utc_converted": "2019-05-25 12:50:27", "score_overall": 6, "words": "jew jewish conspiracy holocaust holocaust holocaust", "shared_words": "jew jewish conspiracy holocaust", "socre_distint": 4}
{"author": "CHRISTINEitsDAVEpmME", "body": "Submission statement- \n\nAccording to several disciples with whom he confided, Mr. Raniere’s views were as follows::\n\nThe Holocaust is an exaggeration arising out of a Jewish conspiracy, designed to advance the interest of Jews at the expense of other peoples.\nThe stories of Nazi brutality were just propaganda.\nGermany was the victim of Allied aggression.\nAllegations made against Germany, including the Holocaust, were wartime propaganda which had been used to justify the United States’ involvement in World War II.\nThe Allies made the Nazis the “scapegoat” for their own misdeeds.  The atrocities of the Allies were more brutal, painful, mortal and numerous than the most extreme allegations made against the Germans. The Nazi treatment of Jews was no different from what the Allies did to their enemies in World War II.\nIsraeli politicians [men like Edgar Bronfman] derived billions of dollars from nonexistent, mythical and imaginary cadavers, whose numbers have been reckoned in an unusually distorted and dishonest manner\nThere was no German program to exterminate Europe’s Jews, and the estimate of six million Jewish wartime dead is an irresponsible exaggeration. The Holocaust – the alleged extermination of some six million Jews (most of them by gassing) – is a hoax and should be recognized as such.\nThe gas chambers used by the Nazis to exterminate the Jews did not exist. There were no execution gas chambers in Auschwitz or in any other concentration camp. Today, what are displayed as ‘gas chambers’ at the remains of the Auschwitz camp in Poland are a post-war fabrication by the Polish communist regime or the Soviet Union.  Neither at Auschwitz nor in any territory controlled by the Germans was there ‘mass murder of Jews’ in ‘gas chambers.’ Mr. Raniere admits there were scattered killings. But most who died at Auschwitz were the victims of “natural causes” such as disease, not gassing. The death of some Jews were due to the typhus plague during the war and the famine towards the end of the war caused by the defeat of the Germans.\nThe majority of documentation relating to the operation of the gas chambers in death camps, is “rare” and “unreliable” – and based upon misleading evidence, false statements, and outright lies.\nThe Zionists fabricated a legend, under the name of the Massacre of the Jews. It is myth. Leading Jews – such as Edgar Bronfman – spread this myth as part of a plundering plot intended to enable the creation of a Jewish homeland in Palestine, garner support for the state of Israel and pocket money for themselves and their Jewish friends – some of whom are connected to the Illuminati.", "score": 3, "send_replies": true, "subreddit": "conspiracy", "date_year_month": "2019-05", "created_utc_converted": "2019-05-25 19:43:00", "score_overall": 10, "words": "holocaust jewish conspiracy holocaust scapegoat jewish holocaust jewish jewish illuminati", "shared_words": "holocaust jewish conspiracy scapegoat illuminati", "socre_distint": 5}
{"author": "AfraidKiwi", "body": "His support for the black september terrorists who kidnapped, castrated and murdered Israeli athletes for the crime of being jewish. His support for Hamas and Hezbollah. His description of a convicted terrorist as his brother. His appearances on Press TV. His numerous conspiracy theories about Israel. The mural. His dehumanisation of a British jew by saying they weren't as english as him. His opposition to the IRHA definition. Him sitting by while people called for the destruction of Israel and comparing Israel to the Nazis while also stopping holocaust survivors from disagreeing with calling Jews Nazis. His numerous relationships with holocaust deniers and proponents of the blood libel. His appointment of antisemites to high ranking positions in the Labour party.", "score": 2, "send_replies": true, "subreddit": "ukpolitics", "date_year_month": "2019-05", "created_utc_converted": "2019-05-26 10:59:56", "score_overall": 6, "words": "jewish conspiracy jew holocaust holocaust libel", "shared_words": "jewish conspiracy jew holocaust libel", "socre_distint": 5}
{"author": "nidarus", "body": "Yeah, that's bullshit. Hitler was adamantly and famously anti-Zionist, and he wrote about it in Mein Kampf:\n\n&gt;For while the Zionists try to make the rest of the world believe that the national consciousness of the Jew finds its satisfaction in the creation of a Palestinian state, the Jews again slyly dupe the dumb Goyim. It doesn’t even enter their heads to build up a Jewish state in Palestine for the purpose of living there; all they want is a central organization for their international world swindle, endowed with its own sovereign rights and removed from the intervention of other states: a haven for convicted scoundrels and a university for budding crooks.\n\nAnd to hold the Haavara agreement as an example of their \"pro Zionism\", as some holocaust deniers (including the current Palestinian president Abbas) claim, is nonsense. By that measure, you could claim that the Ribbentrop-Molotov agreement, was proof of the Nazi support for communism. Or for that matter, their alliance with the Palestinian Mufti of Jerusalem, Hajj Amin al-Husseini, as proof of them being the original Palestinian nationalists.\n\nThe Nazis just wanted the Jews out of the country at that point, to break the Jewish boycott, and get the money from the Jews that fled the country. The Zionists wanted, and indeed succeeded in, saving thousands of Jewish lives. There was never any support for Zionism as a movement, support for the idea of an actual Jewish state, let alone support for it as a legitimate final solution to the \"Jewish question\".\n\nThere's a whole [thread debunking this myth in AskHistorians](https://www.reddit.com/r/AskHistorians/comments/4h45ia/the_ken_livingstone_what_was_hitlers_relation_to/). Please read it.", "score": 7, "send_replies": true, "subreddit": "worldnews", "date_year_month": "2019-05", "created_utc_converted": "2019-05-26 15:05:33", "score_overall": 8, "words": "jew goyim jewish holocaust jewish jewish jewish jewish", "shared_words": "jew goyim jewish holocaust", "socre_distint": 4}
{"author": "PM_ME_UTILONS", "body": "Oh, that gives me an idea: \"Protocols of the learned elders of Zion\"\n\nMy local library system has \"The Protocols of the meetings of the learned elders of Zion, with preface and explanatory notes / translated from the Russian text by Victor E. Marsden\" that I presume explains they're a forgery.\n\nBut Amazon has \"Protocols of the Learned Elders of Zion Paperback – February, 2011\"  (dunno how to strip out the link crap that probably identifies me to some degree) that looks like it plays it straight: \n\n&gt;Freemasons and Zionist Jews everywhere screamed and complained that these 24 Protocols are a hoax, a forgery, even a blood taint against the Jews. But then came the brutal and barbaric Communist Bolshevik Revolution in Russia and its captive republics, led by covert Masonic Jews—Lenin, Trotsky, Kaganovich, and others. The cruel and sinister crimes of the crypto Jew revolutionaries seemed to have jumped off the pages of the Protocols. [...]\n\n\n.\n\n\n&gt;**Note from Amazon**\n\n&gt;Amazon does not endorse The Protocols of the Learned Elders of Zion. This book is one of the most infamous, and tragically influential, examples of racist propaganda ever written. It may be useful to some as a tool in the teaching of the history of anti-Semitism, but it's unquestionably propaganda.\n\n&gt;Does Amazon sell this book? We do, along with millions of other titles. The Protocols of the Learned Elders of Zion is classified under \"controversial knowledge\" in our store, along with books about UFOs, demonic possession, and all manner of conspiracy theories. You can also find books in other sections of Amazon's online bookstore that analyze The Protocols' fraudulent origins and its tragic historical role in promoting anti-Semitism and Jewish persecution, including A Lie and a Libel: The History of the Protocols of the Elders of Zion. As a bookseller, Amazon strongly believes that providing open access to written speech, no matter how hateful or ugly, is one of the most important things we do. And because we think the best remedy for offensive speech is more speech, we also make available to readers the ability to make their own voices heard and express their views about this and all our titles in reviews and ratings.\n\nMan, you go down a friggin' weird rabbit hole in the related books...\n\nBack to \"Culture of Critique\", that looks to me (from the reviews of A People That Shall Dwell Alone: Judaism as a Group Evolutionary Strategy) like the sort of thing I'd expect out of this Subreddit: a bloodless academic look at a hot-button culture war topic that's going to scare a lot of people and maybe embolden &amp; encourage some nasty people, but potentially true and interesting taken on its own. \n\n[looks for takes on it in SSC-sphere]\n\nHmm, generally pretty negative, people saying he's anti-semitic.\n\nScott himself in a links post:\n\n&gt;Nathan Cofnas [debunks Kevin MacDonald’s anti-Semitic conspiracy theories.](https://link.springer.com/article/10.1007/s12110-018-9310-x) Interesting not so much because I expect many people to believe Kevin MacDonald’s anti-Semitic conspiracy theories, but because an attempt to disprove anti-Semitism on the merits got published in a journal and was generally-well-received, and because it shows the way that careful and intelligent study of group differences can be used to fight racism (the argument is basically “Jews’ success in various fields is as we would predict from their IQs, so there’s no need to posit any conspiracy theory”). I don’t think there’s a good way to debunk these kinds of conspiracy theories without citing this research, which is one reason I become so concerned when people try to suppress it.\n\nOn looking a bit more, it looks like that third book (Culture of Critique) is the objectionable one. \n\nEpistemic Status: very limited knowledge of the factual claims made in these books, let alone their accuracy, also limited knowledge of how the alt-right is using them, also unsure about ethics of this discussion.\n\nKind of gets at the heart of this sub actually. This seems to me like the sort of thing that should absolutely be discussed, and absolutely be discussed quite carefully.", "score": 7, "send_replies": true, "subreddit": "TheMotte", "date_year_month": "2019-05", "created_utc_converted": "2019-05-27 01:31:06", "score_overall": 8, "words": "jew conspiracy jewish libel conspiracy conspiracy conspiracy conspiracy", "shared_words": "jew conspiracy jewish libel", "socre_distint": 4}
{"author": "Calcuj", "body": "1) Lots of religions, cultures, and traditions have great things to offer the world. Not all need to fulfill the same purpose. We can have different views on many topics while still learning from each other. Judaism doesn't demand that everyone follows it. \n\n&amp;#x200B;\n\n2) Being Jewish doesn't fit neatly in modern identity categories. Ethnicity could work since it isn't as specific, but tribe, a people, etc. have been used as well. It's not just about religion though. An atheist Jew isn't any less Jewish than a religious Jew. There also isn't a distinction between people who convert to Judaism and people who were born Jewish. Converting to Judaism isn't just about believing in it, it's about becoming part of the Jewish people.   \n\n\n3) Well there are companies that distribute newspapers and record shows, but I'm guessing that's not what you meant. There isn't a secret group controlling banks and media. That's just a trope used to scapegoat people. Some governments run some banks and news sources and some rich people can fund a newspaper or two, but no one controls it all. The world is more chaotic than conspiracy theorists would have us believe.", "score": 13, "send_replies": true, "subreddit": "Judaism", "date_year_month": "2019-05", "created_utc_converted": "2019-05-27 13:30:38", "score_overall": 8, "words": "jewish jew jewish jew jewish jewish scapegoat conspiracy", "shared_words": "jewish jew scapegoat conspiracy", "socre_distint": 4}
{"author": "millenialprincess", "body": "Being Jewish isnt a separate race, we are part of the human race just like you. We are a religion and are made up of slightly different but extremely different closely related ethnic groups. Genetically, Ashkenazim score somewhere between Sicilians (a southern european population that is heavily genetically levantine) and Cypriots (basically levantines). Other Jews score mostly as levantine and mixed with their host population (Iraqi Jews mixed with Mesopotamian populations, Libyan jews mixed with berbers to some extent, etc). There is a lot of overlap with all of our groups, genetically. Are Ashkenazi Jews a european group? Hell no. Not related to their host country. Im basically a Polish Jew yet most people ask me if Im Lebanese or Sephardi (Jews from Spain or Portugal) or even Persian Jewish, which shows that we can still pass as middle eastern even though we have slightly elevated levels of northern european and eastern european than other Jews have (see Jeff Goldblum or Oded Fehr). Mainland Greeks are still more closely related to eastern europeans than Ashkenazi Jews are, just to put things into perspective. \n\nTo sum up the beef white people have against us, we have feelings and wants just like everyone else and we have the ambition and drive to get what we want. Some of us are extremely brilliant, which scares white people. There’s no zionist conspiracy to control the media. Yes, Jews are in the media, since non Jews didnt let immigrant Jewish workers take off on sabbath, Jews had to find a new outlet of work. This became hollywood and movie studios (ex: Warner Bros). \n\nJews got into banking because (at least in europe) Jews couldnt own land and christians couldnt charge interest on loans for each other but Jews have no prohibition against charging interest on loans to non Jews. Jews had to basically join the merchant class of people. Jews in the middle east and north africa also became merchants and bankers. It basically became our trade. Some banks are owned by Jews like Goldman Sachs or Safra bank but I have no personal ownership haha (I wish). \n\nJews dont eat non jewish babies’ blood. There is so much wrong with people saying jews do this, it makes me want to vomit. We also dont have horns. Wtf. \n\nNon Jews can be cool as long as they dont want me dead. Just let me be, I have nothing against you. We believe righteous non jews have a place in the world to come without conversion to Judaism.", "score": 2, "send_replies": true, "subreddit": "Judaism", "date_year_month": "2019-05", "created_utc_converted": "2019-05-27 15:09:00", "score_overall": 7, "words": "jewish jew jewish conspiracy jewish merchant jewish", "shared_words": "jewish jew conspiracy merchant", "socre_distint": 4}
{"author": "dirtygremlin", "body": "&gt;Soros money was behind the refugee crisis and his openly stated interests are to change states.\n\nThis belongs in r/conspiracy, hence me calling you a Top Mind.\n\n&gt;As a Jew, I don’t want Soros. He’s a piece of shit.\n\nThis is not an argument.  These seeks to qualify your \"judgement\" of him, because your \"Jewishness\" informs your ability to criticize him somehow.  Hence the /r/AsABlackMan statement.  It doesn't mean your not Jewish, just that you're an idiot.\n\nI'm not seeking to diminish antisemitism.  I concur Garrison isn't antisemitic.  I have repeatedly stated on this site that regardless of his absurd and inflammatory stances, the \"scheming merchant\" images were shopped into his work.  Those are all tangential to your belief that \"as a Jew\" is some magical card to have insight on the absurd disinformation campaign that swirls around Soros, that are in fact very similar antisemitic smearing tactics to those applied to Garrison.  Now, is your point debated?", "score": 3, "send_replies": true, "subreddit": "vaxxhappened", "date_year_month": "2019-05", "created_utc_converted": "2019-05-27 18:26:41", "score_overall": 5, "words": "conspiracy jew jewish merchant jew", "shared_words": "conspiracy jew jewish merchant", "socre_distint": 4}
{"author": "sh125itonlysmellz", "body": "since /u/redterror88 ran away here is a little run down\n\n\n\nhttps://www.thesun.co.uk/news/8809459/labour-anti-semitism-activists-jeremy-corbyn/\n\nLabour activists who blamed 9/11 on Jews and claimed Theresa May bombed Manchester are allowed to stay in party\n\nabour activist shared neo-Nazi material, is still embraced by local party - and now elected councillor A Labour activist who shared the claim “the Jews declared war on Germany in 1933” has been elected a councillor - amid confusion over whether she was even investigated over it despite numerous complaints. https://www.thejc.com/news/uk-news/labour-activist-rachel-abbott-shared-neo-nazi-material-about-how-jews-declared-war-on-germany-1.483859\n\nSadiq Khan poses with Labour councillor he called anti-Semitic over Facebook posts 'blaming Zionist Jews for 9/11' and claiming 'Israel and the US created ISIS'\n\nNational Union of Journalists investigates after board member tweets Jewish politicians don't have 'human blood' https://www.thejc.com/news/uk-news/national-union-of-journalists-looking-into-complaints-against-anti-israel-board-member-1.468260 https://www.dailymail.co.uk/news/article-6981063/Pictured-Sadiq-Khan-poses-Labour-councillor-called-anti-Semitic.html\n\nhttps://www.walesonline.co.uk/news/politics/swansea-labour-party-member-understood-16275738\n\nAlan Bull, who was selected by @uklabour as a candidate, in the full knowledge he is a Holocaust denier https://twitter.com/AntisemitismOut/status/976383308308283392\nMuslim peer Lord Ahmed blames Jewish conspiracy for jailing him\n\nhttps://www.thetimes.co.uk/article/muslim-peer-lord-ahmed-blames-jewish-conspiracy-for-jailing-him-nkcxnk892wj\n\nCorbyn-supporting candidate deselected over Israel-ISIS article http://jewishnews.timesofisrael.com/corbyn-supporting-candidate-deselected-over-israel-isis-article/\n\nLABOUR REFUSES TO SAY WHAT WILL HAPPEN TO COUNCILLOR WHO POSTED CARICATURE OF HOOK-NOSED BLOODTHIRSTY JEW https://antisemitism.uk/labour-refuses-to-say-what-will-happen-to-councillor-who-posted-image-of-hook-nosed-bloodthirsty-jew/\n\n“You do know Hitler was ‘only defending’ Germany from Jews right?.Another Labour Councillor Has Been Suspended Over Alleged Anti-Semitic Comments https://www.buzzfeed.com/hannahalothman/another-labour-councillor-has-been-suspended-over-alleged?utm_term=.leAlqKma3#.lp3Gr8Vlm\n\nAysegul Gurbuz: Labour councillor suspended after praising Hitler on social media The 20-year-old called the German dictator the 'greatest man in history' on Twitte https://www.independent.co.uk/news/uk/politics/aysegul-gurbuz-labour-councillor-suspended-after-praising-hitler-on-social-media-a6977611.html\n\nIT’S THE SUPER RICH FAMILIES OF THE ZIONIST LOBBY THAT CONTROL THE WORLD”, AS COUNCIL CANDIDATE https://antisemitism.uk/labour-selects-billy-wells-who-defends-ken-livingstone-and-says-its-the-super-rich-families-of-the-zionist-lobby-that-control-the-world-as-council-candidate/ Don’t give your soul energy to the parasitical Rothschild-Zion-Jesuit-Vati-lunatic nonce controllers.\n\nAnti-Semitic row Newcastle councillor WILL stand for Labour at local elections screenshots of Mr Ahad’s Facebook page show him saying he voted against a planning application for a Marks &amp; Spencer store “on principal (sic)” – also saying the store was “directly killing innocent Palestinian people by directly funding the Zionist regime”. https://www.chroniclelive.co.uk/news/north-east-news/anti-semitic-row-newcastle-councillor-14500732.amp?__twitter_impression=true\n\nGeorge McManus was suspended in August over an alleged anti-Semitic Facebook post. In his post, Mr McManus claimed Mr Watson had \"received £50,000+ from Jewish donors\" before adding: \"At least Judas only got 30 pieces of silver\". https://www.hulldailymail.co.uk/news/hull-east-yorkshire-news/labour-party-suspension-lifted-george-2051241\n\n“There are only nine countries left in the world without a Rothschild central bank: Russia, China, Iceland, Cuba, Syria, Iran, Venezuela, North Korea and Hungary. Isn’t it funny we are always at war with these countries?” https://www.heraldscotland.com/news/16369930.scottish-labour-leader-richard-leonard-criticised-over-delayed-probe-into-allegedly-anti-semitic-post-by-councillor/\n\nFormer Mayor of Shrewsbury Cllr Ioan Gruffydd Jones, shared http://Smoloko.com a far-right/Nazi apologist/neo-fascist/white nationalist/white supremacist/anti-Semitic propaganda website on Facebook, among other unpleasant posts.\n\nhttp://jewishnews.timesofisrael.com/ilyas-aziz-readmitted/ Anti-Semitic’ Labour councillor readmitted to party\n\nIrfan Javed @UKLabour candidate in Woodfield in Stevenage. He has ranted on Facebook about “Jew propaganda” and commented: “I am just suspicious. This is what Jewish dominated western media usually does. https://order-order.com/2018/05/01/labour-candidate-ranted-jew-propaganda/\n\nJohn Clarke @UKLabour Cllr &amp; PPC in Essex, berated Jewish victims of the holocaust, saying we should have \"fought back\" &amp; the Rothschild's have \"used usury as an imperial instrument to take over the world and all of its resources, including you and I” https://antisemitism.uk/racist-labours-councillor-clarke-found-berating-holocaust-victims-for-not-fighting-back/\n\nCllr Luke Cresswell. Who was reported to @UKLabour for antisemitism &amp; rewarded with a council seat. He tweeted a blood-drenched Israeli flag, captioned “Moses must be proud of you https://www.telegraph.co.uk/politics/2018/03/29/labour-quietly-reinstated-six-councillors-posted-anti-semitic/\n\na councillor from Fife, suggested in a Facebook post that headlines critical of @UKlabour position could be the work of the Israeli security services. https://www.bbc.co.uk/news/uk-scotland-scotland-politics-45018653\n\nwant more?", "score": 2, "send_replies": true, "subreddit": "ukpolitics", "date_year_month": "2019-05", "created_utc_converted": "2019-05-29 04:09:33", "score_overall": 15, "words": "jewish holocaust jewish conspiracy jewish conspiracy jew jew jewish jew jewish jew jewish holocaust holocaust", "shared_words": "jewish holocaust conspiracy jew", "socre_distint": 4}
{"author": "1945BestYear", "body": "I semi-recall this quote from a high ranking Nazi, I think it was Himmler, telling his men to do exactly this. Before the Holocaust, practically everybody in Germany personally knew at least one Jew, every town had at least one Jewish family. Your barber could have been Jewish, your local baker, a colleage at the factory where you worked, a frequent customer in your cafe. Even Hitler's family doctor when he was young was Jewish. Now that the populace who had bought into the Nazi creed were being ordered to get rid of \"The Jews\", they had to as much as possible think of \"The Jews\" as only being a nebulous, foreign conspiracy, an infection which the body of Germany had to be cleaned of. They couldn't allow themselves to conceive the truth, that they were killing people who had so recently been their fellow citizens, neighbors, and friends. \"We all have our own One Good Jew. This is irrelevant; They all have to die.\"", "score": 24, "send_replies": true, "subreddit": "PoliticalHumor", "date_year_month": "2019-05", "created_utc_converted": "2019-05-31 20:19:05", "score_overall": 7, "words": "holocaust jew jewish jewish jewish conspiracy jew", "shared_words": "holocaust jew jewish conspiracy", "socre_distint": 4}
