{"archived": false, "author": "flushkz", "body": "The reason that anti-Semitism arose in Germany is the same reason as all the other host nations that have picked on them throughout history. While totally normal today, usury (lending money with interest) was considered unethical and forbidden. The pattern of Jews being accepted into a country, and then alienating the locals with business practices like predatory loaning and banking/currency manipulation to they point they are expelled goes back thousands of years. They even refer to themselves as the wandering tribes of Israel. No other ethnic group in history has received this treatment so consistently, for so long, across continents.\n\nBut what about today? Many feel that the Jews as a group are conducting a group effort to weaken countries like America by degrading society's morals and value. They will point out that all the producers involved in pornography and cinema that glorifies drugs is overwhelmingly if not totally Jewish. Same with the central banking system. Also many will point out that the events of the Holocaust have empowered Jews to act without being held accountable. Look at Israel, a fascist nation that commits horrible human rights violations and has recently enacted apartheid. Imagine if a white Europeans tried to make a fascist ethno-state like that. The social programming that it's anti-Semitic to criticize Jews has granted them incredible power, add that with a deeply and internally hurt culture, a culture that undoubtedly hates the the world that attempted genocide against them, and core ancient Jewish beleifs like non-jew \"goyim\" being \"sub human cattle meant to serve the jew\", and you have a very plausible foundation for funny business. I mean who doesn't want to rule the world?\n\nPs- fuck people that vandalize property with hate symbols.", "score": -6, "send_replies": true, "subreddit": "Brooklyn", "date_year_month": "2018-11", "created_utc_converted": "2018-11-01 00:23:25", "score_overall": 6, "words": "jewish holocaust jewish jew goyim jew", "shared_words": "jewish holocaust jew goyim", "socre_distint": 4}
{"archived": false, "author": "soayherder", "body": "Antisemitism has been around a lot longer than the holocaust, though. Queen Isabella (Columbus one, yep) and King Ferdinand ordered the Jews in Spain to convert to Catholicism or leave Spain (kicking off the Inquisition). Those who left had all their property confiscated. It was motivated by getting out from under debts owed to the Jews, and general antisemitism (please recognize that I am condensing, simplifying, and understating, but if you want to read up on it, the relevant term for these would be the *conversos*).\n\nYou could also look up blood libel (most famous cases were in medieval England but not exclusively; in general though it refers to the very mistaken and horrific belief that Jews would kidnap and murder Christian infants and children in order to get their blood to consume it in their 'unholy' rituals. (Aside from all the OTHER problems wrong with this belief, meat is only able to be kosher when the blood has been removed from it; blood is by definition not kosher.)\n\nThen there's the Russian pogroms, and ... well, you get the drift. The Holocaust was not the first planned attempt at extermination Jewish life and culture. It was just one of the more highly publicized and successful.", "score": 10, "send_replies": true, "subreddit": "Firearms", "date_year_month": "2018-11", "created_utc_converted": "2018-11-01 03:56:58", "score_overall": 6, "words": "holocaust libel kosher kosher holocaust jewish", "shared_words": "holocaust libel kosher jewish", "socre_distint": 4}
{"archived": false, "author": "Drunklaowinner3", "body": "Nothing is wrong with him, except he says the Holocaust was a hoax and there where no death camps and all the deaths of the Jews where caused by disease and that Nazis never intended to hurt even one Jew \n\nOne of his key arguments was that there was no Air photographs showing the crematorium, when he was shown proof of air photos of the the crematorium he said they where all fake and made by a Jewish conspiracy \n\nSo- that’s him\n\nIt always goes back to magic Jews \n\nStop denying the Holocaust ", "score": 1, "send_replies": true, "subreddit": "unpopularopinion", "date_year_month": "2018-11", "created_utc_converted": "2018-11-01 10:03:33", "score_overall": 5, "words": "holocaust jew jewish conspiracy holocaust", "shared_words": "holocaust jew jewish conspiracy", "socre_distint": 4}
{"archived": false, "author": "namasteupinthisbitch", "body": "&gt; The term “globalist” is frequently used as a euphemism for Jew, including by far-right news site Breitbart, which surrounds Jewish former Trump economic adviser Gary Cohn’s name with globe emoji, for “globalist.” The notion of Jews as internationally beholden to some Jewish conspiracy and its goals, rather than serving as loyal subjects of their home countries, dates back at least to a 1920s pamphlet, “The International Jew,” published by Henry Ford.   - https://www.washingtonpost.com/outlook/2018/10/24/conspiracy-theories-about-soros-arent-just-false-theyre-anti-semitic/     \n\nyou played yourself.", "score": 0, "send_replies": true, "subreddit": "PoliticalHumor", "date_year_month": "2018-11", "created_utc_converted": "2018-11-01 18:20:47", "score_overall": 8, "words": "globalist jew jewish globalist jewish conspiracy jew conspiracy", "shared_words": "globalist jew jewish conspiracy", "socre_distint": 4}
{"archived": false, "author": "eggsssssssss", "body": "You are absolutely missing something. You’ve been posting about antisemitism pretty frequently recently so I can’t say you just don’t care about it, but it’s hard to think you don’t care about it selectively—as long as it’s convenient to your politics—and it’s fucking maddening to see you defend the echoed dogwhistles of nazis because as a conservative you happen to be in the crowd they’re broadcasted towards.\n\nhttps://www.nytimes.com/2018/10/31/us/politics/george-soros-bombs-trump.html\n\nPlease seriously give this a read.\n\nWhen an ultranationalist nut rants about how the Rothschilds are globalists bankrolling a conspiracy to sabotage the country, it’s not less antisemitic if he doesn’t bring up the fact that they’re jewish. Can you imagine, a jew listening to someone calling bullshit on that, and instead yelling “How is this about antisemitism? Doesn’t that make YOU the racist??” because they happen to be a nationalist as well? I’ve seen that plenty about the Soros stuff the last few days.\n\nThe Koch brothers are as vilified (by non-republicans) as they could be, they’re way wealthier than Soros, and they donate enormously higher sums to all kinds of conservative causes. But as much hate as they get, at worst it’s Bernie Sanders trash talking their ability to influence politics as the poster children of the 1%. You don’t see the conspiracy theories that come with the Soros Treatment—most recently, that he’s secretly funding an invasion disguised as migrants, trojan horse-ing murderers and Islamic terrorists to break open the border and sabotage the country on behalf of the Democrats—because the Soros Treatment is the batshit insane stuff that gets cooked up by white nationalists. It’s basically the same stuff as the Rothschild treatment, Globalist/International Jew shit and all, and it’s being repeated by conservative media, republican politicians, and the president.", "score": 6, "send_replies": true, "subreddit": "Judaism", "date_year_month": "2018-11", "created_utc_converted": "2018-11-01 19:55:51", "score_overall": 6, "words": "conspiracy jewish jew conspiracy globalist jew", "shared_words": "conspiracy jewish jew globalist", "socre_distint": 4}
{"archived": false, "author": "DollywoodVacation", "body": "&gt; But, why? With all of the hatred, what's driving it?\n\nMy theory is years of building a foundation of conspiracy theories.  For years I've been noticing how the verbage is sliding to a very 1930's sounding tone.  Illuminati, Freemasons, globalist etc.  They've been tap-dancing around \"Jews\" for awhile now.  Trump has essentially galvanized these people. \n\n&gt;This is the 21st Century...what is the benefit of singling out some group or ethnicity and wishing their extinction? \n\nThe rich need scapegoats so you don't see them as the problem. \n\n&gt;That's just seems beyond absurd and pointless. Mental issues.\n\nIf these were simple mental issues, it would be isolated.  You literally have the President of the US parroting the same thing these with \"mental issues\" are.  Our media prottles right along with them. Fox News propagates that Soros, the Evil Jew, is behind everything anti-Trump and \"anti white\".  These aren't mental issues, these are social issues.  People, who have been ignored or at least feel that way... grasp to things.  Just like Nazis.  If/When the economy tanks... we're fucked. ", "score": 51, "send_replies": true, "subreddit": "news", "date_year_month": "2018-11", "created_utc_converted": "2018-11-01 20:53:08", "score_overall": 4, "words": "conspiracy illuminati globalist jew", "shared_words": "conspiracy illuminati globalist jew", "socre_distint": 4}
{"archived": false, "author": "benadreti", "body": "Soros is a Jew who survived the Holocaust by his parents hiding him with a non-Jewish family. \n\nNow he's rich and liberal and gives a lot to liberal causes.  The far-right in Europe and the US has turned him into the new Rothschild by crafting a narrative that he (a super wealthy globalist Jew) is using his money to control western countries (the same thing they said about the Rothschild family in the 1800s, which played a role in increasing antisemitism). ", "score": 11, "send_replies": true, "subreddit": "Israel", "date_year_month": "2018-11", "created_utc_converted": "2018-11-02 12:51:44", "score_overall": 5, "words": "jew holocaust jewish globalist jew", "shared_words": "jew holocaust jewish globalist", "socre_distint": 4}
{"archived": false, "author": "jvalordv", "body": "They've long made for a convenient scapegoat. Even in the modern era, they have become a common target in times of nationalist fervor. Hitler argued that the terrible deal given to Germany after WWI, despite the front never even being fought in German territory, was because of a betrayal from within. He claimed Jews were this enemy because they were permanent outsiders, not real members of the \"nation,\" and said their generally better than average socioeconomic status was due to a nature of subversion. We see this today still where \"globalist\" and \"Hollywood elite\" become nods to a Jewish conspiracy.", "score": 73, "send_replies": true, "subreddit": "AskReddit", "date_year_month": "2018-11", "created_utc_converted": "2018-11-02 14:49:57", "score_overall": 4, "words": "scapegoat globalist jewish conspiracy", "shared_words": "scapegoat globalist jewish conspiracy", "socre_distint": 4}
{"archived": false, "author": "acertainshape", "body": "The origins of anti-semitism are complicated, from Christians blaming Jews for Jesus' crucifixion to Jews being restricted to certain occupations like money lending (and who likes someone you are indebted to). Rumors of Jews killing Christian children and drinking their blood are known as blood libel myths and took off in medieval times. Basically Jews were shunned and forced into their own tightly knit communities and formed distinctive cultures separate from gentiles. This made a lot of ignorant peasants upset as they thought those Jews were up to no good and their otherness was seen as a threat, leading to pogroms. In more modern times, starting in the 19th century, race theorists proclaimed Jews an inferior race, eventually leading to Hitler, Nazism, and the Holocaust. \n\nCauses\n\nAntisemitism has been explained in terms of racism, xenophobia, projected guilt, displaced aggression, and the search for a scapegoat. Some explanations assign partial blame to the perception of Jewish people as unsociable. Such a perception may have arisen by many Jews having strictly kept to their own communities, with their own practices and laws.\n\nIt has also been suggested that parts of antisemitism arose from a perception of Jewish people as greedy (as often used in stereotypes of Jews), and this perception has probably evolved in Europe during Medieval times where a large portion of money lending was operated by Jews. Factors contributing to this situation included that Jews were restricted from other professions,[231] while the Christian Church declared for their followers that money lending constituted immoral \"usury\".\n\n\nhttps://en.m.wikipedia.org/wiki/Medieval_antisemitism\n", "score": 6, "send_replies": true, "subreddit": "TooAfraidToAsk", "date_year_month": "2018-11", "created_utc_converted": "2018-11-02 19:25:03", "score_overall": 5, "words": "libel holocaust scapegoat jewish jewish", "shared_words": "libel holocaust scapegoat jewish", "socre_distint": 4}
{"archived": false, "author": "PeePeeChucklepants", "body": "Historically one issue that led to depictions like, Shylock in The Merchant of Venice... Is I believe that Christians were prohibited from charging interest and doing the type of financial lending that has set up many world banks.  So you had Jewish communities handling this for others which led to them being depicted as money-crazed, predatory individuals as an entire religious group.\n\nOver time,  some Jewish individuals and communities became more powerful and wealthy because they were dealing in money for their careers... And it feels envy and greed among the people who don't have this and now all of a sudden... They spout conspiracy theories that Jews are running secret cabals if wealth to control the entire world.", "score": 1, "send_replies": true, "subreddit": "news", "date_year_month": "2018-11", "created_utc_converted": "2018-11-02 20:27:37", "score_overall": 5, "words": "merchant jewish jewish greed conspiracy", "shared_words": "merchant jewish greed conspiracy", "socre_distint": 4}
{"archived": false, "author": "bogHR", "body": "&gt;At the same time Netanyahu is great friends with the antisemite Orban.  \n&gt;  \n&gt;Orban agitates against a supposed Jewish, globalist conspiracy spearheaded by Soros\n\nSo you only have to be against one Jew to be called an antisemite ?\n\nThats a retarded way of thinking….", "score": 2, "send_replies": true, "subreddit": "europe", "date_year_month": "2018-11", "created_utc_converted": "2018-11-03 20:10:22", "score_overall": 4, "words": "jewish globalist conspiracy jew", "shared_words": "jewish globalist conspiracy jew", "socre_distint": 4}
{"archived": false, "author": "rewboss", "body": "Short answer: Propaganda and history.\n\nIn history, Jews formed a distinct ethnic group. They didn't generally look different, but they had different lifestyles, different traditions, and a different religion.\n\nJews were historically always treated with suspicion: after all, \"Jews\" had caused Jesus to be crucified, and hadn't accepted Jesus as the Messiah. In mediaeval times, they were often kept apart from the Christian population by being made to live in ghettos -- there are some cities (Hanau in Germany, the birthplace of the Brothers Grimm, is an example) where you can still see parts of the ghetto wall.\n\nIn gets worse. In those days, it was common for there to be a ban on Christians charging interest, meaning that Christians couldn't be moneylenders or bankers (without going bankrupt very quickly). That was left to the Jews, who were then seen as unfairly enriching themselves at the expense of their Christian \"superiors\". (If you've ever wondered why so many financiers have Jewish surnames, that's why.) You can see this in Shakespeare's play *The Merchant of Venice*, when Antonio has to go to the Jew Shylock to get a loan -- but Antonio is an antisemite, a fact that Shylock finds supremely ironic (\"You call me a misbeliever, cut-throat dog, / And spit upon my Jewish gaberdine, / And all for use of that which is mine own. / Well then, it now appears you need my help...\").\n\nSo, it's mistrust on religious grounds, plus resentment at how they're able to make money.\n\nAll of this made them a common scapegoat whenever things went wrong. They were frequently blamed for the Black Death, for example: in Strasbourg, 2,000 Jews were burned alive in a single day, for example. In Frankfurt, the Fettmilch Uprising was originally a protest against economic mismanagement by the patricians of the city, but spilled over into an all-out attack on the Jewish ghetto.\n\nBasically, antisemitism has a very, very long history.\n\nThe Nazi persecutions were just the most famous recent manifestions of this basic resentment. Hitler had a deep-seated and basically irrational hatred of Jews, and this formed the basis of many of his political views.\n\nAt the time, things were really rough in Germany. There was the humiliation of the loss of WW1, the economic turmoil caused by war reparations and the Great Depression, and political instability (with governments collapsing at frequent intervals, sometimes more than once in a year).\n\nHitler did what people had done generations ago, and used the Jews as a convenient scapegoat: he accused them of causing Germany to lose the war in a bit of propaganda known as [the Stab-in-the-Back legend](https://upload.wikimedia.org/wikipedia/commons/0/06/Stab-in-the-back_postcard.jpg).", "score": 17, "send_replies": true, "subreddit": "NoStupidQuestions", "date_year_month": "2018-11", "created_utc_converted": "2018-11-04 14:52:30", "score_overall": 7, "words": "jewish merchant jew jewish scapegoat jewish scapegoat", "shared_words": "jewish merchant jew scapegoat", "socre_distint": 4}
{"archived": false, "author": "idiotsonfire", "body": "You don't let your scapegoat speak or have an opinion, narcissism (and fascism!) 101!  You let your scapegoat speak, or seem human in any conceivable way, the people you're trying to whip up into terror over the scapegoat (turns out fear of someone or a class of people are very easy to turn into hate,) may just find out that the person or people really don't give a shit about them.  Soros is the ultimate scapegoat, and having been a member of the Republican party in the past, they blame this guy for **everything.**  If it helps to hammer it in, he's a holocaust survivor and...he's Jewish.  \n\nA rich jew is the trivial scapegoat for everything.  They will invent any evil scheme they possibly can, that Soros destroys countries is a big conspiracy they love to abuse, thought they never figure out how or give any credible information on how he does this, he's their scapegoat for literally everything.  To a narcissist, allowing your scapegoat the chance to speak is the worst thing to do.  You don't let the people you abuse speak.  Not ever.  ", "score": 1, "send_replies": true, "subreddit": "politics", "date_year_month": "2018-11", "created_utc_converted": "2018-11-05 14:06:51", "score_overall": 11, "words": "scapegoat scapegoat scapegoat scapegoat holocaust jewish jew scapegoat conspiracy scapegoat scapegoat", "shared_words": "scapegoat holocaust jewish jew conspiracy", "socre_distint": 5}
{"archived": false, "author": "RussiaWillFail", "body": "You're asking a very difficult question that most likely goes back about 2300 years and getting to the heart of the answer basically requires looking at Judaism and Christianity the same way we look at Roman and Egyptian religions.\n\nThe long and the short of it is that Judaism most likely emerged during the period of civil wars in Canaan, prior to the Roman occupation of Judea. One of the Kingdoms inside Canaan took the Babylonian lesser God of War Yahweh as their patron deity and declared him as the one true God. That Kingdom then went on to win the most civil wars in the region, solidifying their religious doctrine as being dominant in the region. Out of this history emerged Judaism.\n\nThe history of antisemitism is most likely a combination of antipathy toward the ruling monotheistic Jews in Canaan from the subjugated pagan polytheists and general xenophobia in Rome once they conquered Judea, where most in Judea and Canaan were seen as disobedient barbarians due to multiple military rebellions against the Roman conquest and occupation. Rome saw this antipathy as offensive from what they considered a lower society and persecuted Jews in retribution, targeting their religion as the Jewish populations were too spread out to target effectively militarily.\n\nThis general xenophobia, antipathy and superiority complex in Rome spread with the Roman Empire and was communicated to virtually all Roman principalities where Jewish members of the Empire emigrated to.\n\nNow, modern conspiracy theories toward Jews can be traced back to the revolutions in Europe in the 18th 19th centuries, particularly in America, France and Russia. It really is hard to communicate to people in the modern era how terrifying the late 1700s were for Europeans. They watched as the most powerful military forces in the world were repelled by guerrillas in America and their own proletariat executing the aristocracy in France. This led to a period of great instability in the following decades and fear that the entire world order of European dominance through religion and aristocracy was on the verge of collapse. Combine this with the explosion of the printing press and an uptick in literacy and voila, you have the perfect conditions for some good old fashioned conspiracy theories to spread.\n\nThere were countless conspiracies spread across Europe about what caused the American and French Revolutions. Everything from secret societies (it's around this time that the original Illuminati conspiracy was invented, but that's a whole other story) to the Jews were blamed for the turgid conditions that Europeans were living in. The Enlightenment movement in Europe had also begun to spread to other countries such as Bavaria, Poland, and Germania leading to massive new movements demanding parliamentary representation of the people. More conspiracies were fueled.\n\nWe now get to the point of Russian relevance. Following Catherine the Great's lifting of Russia out from European irrelevance (yet another major force of destabilization in the late 1700s), into a force of nature in European politics, the Russian aristocracy suffered a number of rulers that sent the country rubber-banding between liberal and conservative reforms that crippled Russian influence globally and made the establishment of parliamentary representation almost impossible due to aristocratic hand-wringing and slavish devotion to an autocrat paralyzing the Russian state and making modernization impossible in the 18th century. This paralysis created mass paranoia among the Russian aristocracy and is one of the chief influences in Russia failing to act quickly enough with its European allies to avert World War I. But the main bit we want to focus on is the turmoil inside Russia that led to the Bolshevik Revolution.\n\nPrior to Russia's devastation in World War I, the Russian economy had been left stagnating by the failure to modernize. The proletariat of Russia was deeply unhappy and rebellions had been fomenting for decades, particularly in response to the failure of the Russian state to implement parliamentary representation for the people. The Russian Aristocracy, deeply embedded with the Russian Orthodox Church at this point in history, needed something to distract the proletariat- something to take the blame. So the Russian Orthodox Church and the Russian Secret Police organized together and wrote a book called \"The Protocols of the Elders of Zion\". It is a book plagiarized from popular French conspiracy thrillers from the early 19th century combined with every single Jewish conspiracy theory that had been floating around Europe for the previous 2000 years, all collected into one loose, nonsensical conspiracy about Jews running the world for nefarious purposes. It was released with the intention to scapegoat Russian Jews into being blamed for the problems of the Russian State.\n\nObviously, we know this didn't work and following World War I the Bolshevik Revolution led to the assassination of Nicholas II and the end of the rule of the Russian aristocracy under Lenin's Communist Party. However, the Protocols of the Elders of Zion spread out of Russia and across Europe, becoming a bestseller and influencing a young Bavarian soldier by the name of Adolf Hitler, whom was introduced to the book by a number of German Nationalists that were cultivating him to be their public voice. He would go on to use that book to inform Mein Kampf, referencing the book directly by name. As Hitler rose in power, so did his spread of the Protocols into German society, fueling the spread of the book worldwide, leading to the book becoming a bestseller in both Europe *and America*.\n\nThis crystalized the modern form of antisemitism about Jews controlling the banks and the media that we all know today.", "score": 3, "send_replies": true, "subreddit": "politics", "date_year_month": "2018-11", "created_utc_converted": "2018-11-05 16:45:26", "score_overall": 11, "words": "jewish jewish conspiracy conspiracy illuminati conspiracy conspiracy jewish conspiracy conspiracy scapegoat", "shared_words": "jewish conspiracy illuminati scapegoat", "socre_distint": 4}
{"archived": false, "author": "johnpaultremblay", "body": "Why do you think she's Jewish? Munro and Leighton are both English names. Gotta scapegoat the Jews! A fucking temple just got shot up by a guy who probably would've shared this dumbass meme, and people are somehow blaming the Jews for the attack, and now for the Kavanaugh ordeal. No wonder Jews are so defensive nowadays.\n\nThe fuck who shot up the Pittsburgh synagogue did so because of that particular temple's support for refugees. He murdered 11 AMERICANS in cold blood as some sort of protest of the \"global Jewish conspiracy\" to bring refugees into white nations. \n\nI'm not saying we should accept any adult male refugees (or necessarily any refugees at all - it should be analyzed on a case-to-case basis). We definitely don't need more uneducated people who won't assimilate to American culture. \n\nBut, here's why the Jews support refugees: because not even a hundred years ago when they were being systematically exterminated in Europe, many Jews fled to countries seeking refuge, and many were turned away and then killed when they had to return to Europe. \n\nI'm really sick of the unabashed Jew-hating that goes on here and in real life in right-wing circles. \n", "score": 2, "send_replies": true, "subreddit": "CringeAnarchy", "date_year_month": "2018-11", "created_utc_converted": "2018-11-05 21:15:10", "score_overall": 5, "words": "jewish scapegoat jewish conspiracy jew", "shared_words": "jewish scapegoat conspiracy jew", "socre_distint": 4}
{"archived": false, "author": "AccounabilityDracula", "body": " \n\nAs everyone else here has basically said - saddened but not surprised. \n\nBut also:\n\n\\-Anger at Trump for fueling this fire - playing to his proudly uneducated base, promoting their whack beliefs and conspiracy theories just to get votes and adoration. Using dogwhistles like \"globalist\" or whatever other bullshit that means \"The Jewish Conspiracy\" because he knows it flies with this crowd. Their lives suck, they're pissed off, they and are looking to blame anyone except themselves. Jews will do nicely, and have for some time. \n\n&amp;#x200B;\n\nWe are an easy scapegoat because we can be accused of literally everything. We are a \"closed off, secret society\" but also somehow infiltrated all aspects of the mainstream culture and government.  We are a \"financial drain\" on a country, but also somehow control all the money. We are 0.2% percent of the world's population, yet somehow responsible for every problem ever. \n\n\\-Anger at Ivanka and Jared for saying nothing. I find them both despicable, but I had an inkling of hope that they'd serve as a sort of watchdog for the Jewish people. Jared's grandparents were Holocaust survivors and experienced it firsthand. But no, all quiet from them. \n\n\\-Heartbreak, and feeling like I wanted to be around fellow Jewish people. My girlfriend and friends are mostly not Jewish, and while of course they understood what an awful event this was, I don't think they felt the same hurt as I did.\n\n\\-Fear for what's happening in this country and if the \"normal\" we've known for the last 60+ years is gone. If this was the alarm to pack up and leave for a safer place, like the Jews in 1933 Berlin wished they had known. I don't plan on going any time soon, and I hope I never have to, but for the first time ever, I looked up the process for becoming a Canadian citizen just in case. \n\n\\-The realization of why Israel exists. This shit is why. This has gone on for the entire history of the Jewish people, facing brutal attacks and expulsions for millennia. Modern politics aside, this why Jewish people needed, and dreamed of, a place they could be in charge of and watch out for/protect eachother. It may look like Trump is pro-Israel, but he’s doing it for his evangelical Christian base, not for the Jews. \n\nEven before Trump, this was an infection in our country that was spreading for decades and waiting for the right moment to come to the surface. Trump is that moment. Whether he personally shares these beliefs or not, he gives them fuel by pandering, saying he's a \"nationalist\" and that there were \"very fine people\" on both sides, not denouncing white nationalism, etc. People like the shooter have had this banged into their head over and over again until they are convinced enough to go do something about it. \n\nThis wasn’t the first and won’t be the last. I don’t know how we’re going to stop this. Not just send these racist, heavily-armed, mixed-up losers back to their hidey-holes, but really stomp it out for good. ", "score": 2, "send_replies": true, "subreddit": "Jewish", "date_year_month": "2018-11", "created_utc_converted": "2018-11-05 22:53:35", "score_overall": 11, "words": "conspiracy globalist jewish conspiracy scapegoat jewish holocaust jewish jewish jewish jewish", "shared_words": "conspiracy globalist jewish scapegoat holocaust", "socre_distint": 5}
{"archived": false, "author": "benMogh", "body": "Antisemitism isn’t just a generic hate. Antisemites have a specific ideology and narrative: that Jews are an international elite who control politics, banking, media and economics for our own benefit.  That we are a fifth column, loyal to no nation. And that we import liberalism, immigrants, lgbt rights, Islamist, etc as a way of attacking and replacing white gentiles\n\nWhen the Nazis of Charlottesville (who Trump called ‘good people’) surrounded a synagogue with armed gunmen chanting ‘Jews will not replace us’—they were not concerned with being replaced by Jews. They were noting their belief that Jews are seeking to replace white men with hispanics, Muslims, and others to weaken them\n\nProponents of antisemitism use phrases like ‘globalist’, Bloomberg and Soros as codewords for Jews, much like the Nazis did with Rothschild and “internationalists”. They know that pointing the finger directly at Jews isn’t politically palatable, so they dog whistle in a way that can speak directly to their supporters and attract new ones.\n\nThis is the antisemitism of the alt-right, the antisemitism is the shooter, the antisemitism of Trump, the antisemitism of Hitler, and increasingly of mainstream Republicans\n\nThe shooter attacked the synagogue because he believed it was an instrument of George Soros and the Hebrew Immigrant Aid Service to bring in the Honduran caravan to weaken white people amd advance the position of “globalists” (or what Nazis call ‘the internal Jew’), a conspiracy theory that Trump shares\n\nTrump’s antisemitism however present differently Han the shooters because Trump has no underlying values except self preservation and self promotion. So when Trump goes to the Republican Jewish Committee and tells them (as he did in 2016) ‘you people are just like me, you love money) he is showing his belief in this conspiracy theory but devoid of the extermination component the Nazis has because he sees certain Jews as a tool he can use for himself. But make no mistake, he is motivated by the same twisted worldview. ", "score": 4, "send_replies": true, "subreddit": "Judaism", "date_year_month": "2018-11", "created_utc_converted": "2018-11-06 13:33:27", "score_overall": 5, "words": "globalist jew conspiracy jewish conspiracy", "shared_words": "globalist jew conspiracy jewish", "socre_distint": 4}
{"archived": false, "author": "FullyAutoLGSC", "body": "I'm just going to copy/paste something I wrote in this comment to clear up the whole anti-semitism of the Nazi thing for you and provide some context. Communists were always the actual geopolitical enemy, Jew's were just an obvious scapegoat that could be wrapped up into the whole global conspiracy against Germany.  \n\n\n\" Communist revolutions and movements were spreading all over Europe, destroying churches, authority, killing the rich and the nobility, involved in terrible crimes and a massive civil war that killed millions in Russia, before setting up the USSR that went on to kill millions more in often arbitrary violence and mass starvation, ect. Not many people know this, but there was a communist revolution in Bavaria and a short lived Bavarian People's Republic. Bavaria would later go on to vote heavily for the Nazi Party. The country was literally being torn apart between anarchists, communists, socialist, liberals, conservatives, monarchists, fascists, ect. Then along comes Hitler and co. who literally fight communists in the streets, form a party, and promise to save the country (and all of Europe) from global Communism. It also helps that's many prominant communists like Marx, Lenin, Trotsky, ect. were Jews. It is a hallmark of fascist to have an ambiguous and ill defined enemy that is at the same time weak and strong, which became a global Jewish-Communist-Capitalist conspiracy that controlled the world and wanted to keep the German race weak and down. (See the \"Q anon\" movement in the USA for a recent example of how this garbage works). I am also going to note here that although Jews suffered horribly under the Nazi's and their experiance deserves the upmost respect, they were not the only people to go through the camps. An even greater number (although far less proportionally to total population) of communists, physically and mentally handicapped, socialists, gypsies, feminists, homosexuals, ect. were killed in the Holocaust. We in the West tend to overlook that because after the war we still didn't like those groups very much, but had strong ties to the Jewish community.\"  \n", "score": 3, "send_replies": true, "subreddit": "history", "date_year_month": "2018-11", "created_utc_converted": "2018-11-06 17:59:45", "score_overall": 7, "words": "jew scapegoat conspiracy jewish conspiracy holocaust jewish", "shared_words": "jew scapegoat conspiracy jewish holocaust", "socre_distint": 5}
{"archived": false, "author": "Guan-Di", "body": "Paul Neelan: ran against Paul Ryan in the primary. Lost. Was supported by Sarah pallen and Steve bannon until reporters revealed that he was a guest on a podcast called “Fash the Nation”. \n\nRussel walker: running for N. Carolina house district 48. Said “god is racist and all Jews are descendants of the devil.” When the SPLC labeled as anti-Semitic he said “they hate anyone who disagrees with them and seek to destroy by any means their opponents. They are not southern, they are Jewish.”\n\nArthur Jones: Illinois third congressional district. Member of American nazi party until 1980. The Republican Party failed to put a candidate up against in the primary and failed to put up a third party candidate for the actual election. His website has a section titled “Holocaust?” Which claims well known holocaust survivors are actually paid crisis actors. \n\nCorey Stewart: running against Tim kaine in Virginia. Stewart is buddy buddy with Jason Cheslar, organizer of the first unite the right rally. \n\nBill fowel: running in Illinois. Thinks sandy hook was a false flag, as well as the San Bernardino and  9/11 attacks. Believes in pizza gate and that Beyoncé is part of the Illuminati. \n\nJohn Fitzgerald: running in cali’s 11th. Holocaust denier. Believes in other crazy conspiracy theories. Had robo calls that opened with “damn the Jewish takeover of america”\n\nSteve King: incumbent from Iowa’s 4th Congressional district. General racist and xenophobe. Has retweeted nazis and is on record saying cultural mixing is bad for humanity. ", "score": 2, "send_replies": true, "subreddit": "behindthebastards", "date_year_month": "2018-11", "created_utc_converted": "2018-11-07 01:58:32", "score_overall": 7, "words": "jewish holocaust holocaust illuminati holocaust conspiracy jewish", "shared_words": "jewish holocaust illuminati conspiracy", "socre_distint": 4}
{"archived": false, "author": "try-D", "body": "Additionally to my first comment, here is a list of examples of antisemitism in public life by the IHRA:\n\n Calling for, aiding, or justifying the killing or harming of Jews in the name of a radical ideology\nor an extremist view of religion.\n\n Making mendacious, dehumanizing, demonizing, or stereotypical allegations about Jews as such\nor the power of Jews as collective — such as, especially but not exclusively, the myth about a\nworld Jewish conspiracy or of Jews controlling the media, economy, government or other\nsocietal institutions.\n\n Accusing Jews as a people of being responsible for real or imagined wrongdoing committed by a\nsingle Jewish person or group, or even for acts committed by non-Jews.\n\n Denying the fact, scope, mechanisms (e.g. gas chambers) or intentionality of the genocide of the\nJewish people at the hands of National Socialist Germany and its supporters and accomplices\nduring World War II (the Holocaust).\nAdopt the following non-legally binding working definition of antisemitism:\n“Antisemitism is a certain perception of Jews, which may be expressed as hatred\ntoward Jews. Rhetorical and physical manifestations of antisemitism are directed\ntoward Jewish or non-Jewish individuals and/or their property, toward Jewish\ncommunity institutions and religious facilities.”\n\n\n Accusing the Jews as a people, or Israel as a state, of inventing or exaggerating the Holocaust.\n\n** Accusing Jewish citizens of being more loyal to Israel, or to the alleged priorities of Jews\nworldwide, than to the interests of their own nations.**\n\n** Denying the Jewish people their right to self-determination, e.g., by claiming that the existence\nof a State of Israel is a racist endeavor.**\n\n** Applying double standards by requiring of it a behavior not expected or demanded of any other\ndemocratic nation.**\n\n Using the symbols and images associated with classic antisemitism (e.g., claims of Jews killing\nJesus or blood libel) to characterize Israel or Israelis.\n\n Drawing comparisons of contemporary Israeli policy to that of the Nazis.\n\n\n Holding Jews collectively responsible for actions of the state of Israel. ", "score": 31, "send_replies": true, "subreddit": "Israel", "date_year_month": "2018-11", "created_utc_converted": "2018-11-07 15:19:06", "score_overall": 12, "words": "jewish conspiracy jewish jewish holocaust jewish jewish jewish holocaust jewish jewish libel", "shared_words": "jewish conspiracy holocaust libel", "socre_distint": 4}
{"archived": false, "author": "Fuknmods", "body": "\\&gt;Nobody is *literally* going after white men unless there's a reason beside being white men, like oppressing people with disabilities  who happen to be white men, silencing whistleblowers who happen to be  white men and so on. \n\n&amp;#x200B;\n\n\"Nobody is literally going after them guys, they're going after white men PLUS X only. All the articles saying \"fuck white men\" is actually about white men PLUS. South African farm murders and land seizures don't count. Anti white media doesn't count. Muslim rape gans in Brittain that specifically targeted white girls to groom and rape don't count. The Tommy Robinson scandal doesn't count. The autistic kid who got kidnapped and tortured by blacks live on facebook for wearing a MAGA hat doesn't count...\" - you, denying reality. \n\n&amp;#x200B;\n\nMost people that get targetted for being white aren't whistleblowers or crippled, the commonality is \"not leftist\".\n\n&amp;#x200B;\n\n\\&gt;White men who *belong* to globalist conspiracies are dangerous people\n\n&amp;#x200B;\n\nNot really. Are flat earthers dangerous because of the Globe-alist conspiracy they believe is going on? Of course not. Just like most leftists are't violent or dangerous. Again, you don't even need to believe in the conspiracy to just open your eyes and look around. You focus on muh conspiracy but refuse to even touch that it's only white nations who have globalism pushed into them. China is very much ethnocentric, hell non chinese that marry chinese citizens aren't granted citizenship, are unable to own things like a car or open a bank account easily (these are typically done in the chinese citizens name, leaving the non citizen at great risk if a divorce happens). Something like this was considered in the US, repeal of birthright citizenship, and suddenly it's the greatest crime imaginable. China does it? Who cares. Whites do it? HOLD UP!\n\n&amp;#x200B;\n\n\\&gt;but so are homophobic, anti-Semitic  white men who like to scapegoat minorities in order to make them think  they've combated it.\n\n&amp;#x200B;\n\nNot really, there's no danger in a group that wants to split off into a piece of land where they are as far away as posssible from gays, jews and nonwhites. Wanna know why? Because in that territory, there is no gay, jew or nonwhite to oppress. \n\n  \n\\&gt; Silencing who? Phillip Green, or Lord Dankula? White men aren't a monolinth.\n\n&amp;#x200B;\n\nWhite conservatives are specifically targeted by social media, it's not a secret either given that recent google leaks have PROVEN they plan to do it. \n\n  \n \\&gt;Not every single white man on the planet. Not no white man on the planet, either.\n\n&amp;#x200B;\n\nSo because not every single one is targetted it means there's no active targetting and silencing of white conservatives on social media? You serious?\n\n  \n\\&gt;Calling someone trash or a hick is classist.\n\n&amp;#x200B;\n\nBut WHITE Trash is not classist, because WHITE people is not a social class. \n\n&amp;#x200B;\n\n\\&gt;Terms like \"white trash\"  make it perfectly clear that not all white people are privileged. \n\n&amp;#x200B;\n\nYeah that's what's implied there. Privilege. When OP says \" Your  workplace isn't unfriendly to republican views, it's unfriendly to  white trash views\" he clearly means unprivileged views. When he said \" If you don't want to be called a racist white hick\" he's clearly talking about class, when he followed it up with \" you might consider not holding racist views.\" that clearly refers to class instead of race. Him conflating racism with conservatism and white trash? Absolutely nothing to do with race, all about class status. You know you're bullshitting right? Please tell me you're at least AWARE of what you're doing. \n\n&amp;#x200B;\n\nWould you tell me if I said \"Your workplace isn't unfriendly to democrat views, it's unfriendly to nigger welfare trash views\"  that I'm disparaging the guy for his social class or his race? Your side pulls this shit all the time, you DEFEND racism against whites and pretend it's morally justified or nonexistent, but as soon as you flip the cards around on the same insult it's suddenly proof of white racism towards minorities. What a hypocrite.\n\n&amp;#x200B;\n\n\\&gt;There  are better ways to call out white people's racism than to use snobbery  as a defence.\n\n&amp;#x200B;\n\nSays the very retard who uses snobbery to defend racism against whites. What a fucking joke.", "score": 4, "send_replies": true, "subreddit": "unpopularopinion", "date_year_month": "2018-11", "created_utc_converted": "2018-11-07 18:59:36", "score_overall": 9, "words": "silencing globalist conspiracy conspiracy conspiracy scapegoat jew silencing silencing", "shared_words": "silencing globalist conspiracy scapegoat jew", "socre_distint": 5}
{"archived": false, "author": "ineed750bucks", "body": "&gt;theres a difference between killing your own and foreign influence in it\n\nExcept there it was initiated and carried out by you own people and the only foreign influence was the weapon trade. Actually, having japan stay a lagging behind feudal nation would be infinitely more beneficial to the foreign nations as they would be able to exploit japan like they did with china at the time. So not only did meiji restoration bring japan technological progress, it also had the least amount of casualties and saved you from being forced into a draconic deal with america or england.\n\n&gt;no its not\n\nBut neither is a jap propaganda website a legitimate source. And english is the language of this website. And internet as a whole.\n\n&gt;how is it weak?\n\nSo glover, a scottish man, **supposedly** worked for a company that **supposedly** had weak neglectable ties with the rottshilds family, who had literally zero reasons to help japan evolve from its feudal nature, sold weapons to them...and you're also claiming that he for some reason funded the whole thing even though it doesn't make sense and he had neither resources nor any reasons to do it? Oh, and it also isn't documented anywhere. Yeah, it's pretty bullshit. And rottschilds have always been the targets of retarded conspiracy theories even though the only jewish thing about the company is the rottshilds themselves. The company isn't connected to the jewish culture, ethnicity or religion in any way and it doesn't represent the jewry in any way. Basically one jew made a company and everyone is inventing bullshit claims about it with no evidence and then they somehow blame all the jews for whatever bullshit they just invented. It's the most backwards thing in the world after that time you said japan had standards in ww2 times.\n\n&gt;i didnt say that\n\nYou said:\n&gt;jews being invaders isnt an uncommon opinion in asia\n\nWhy would you lie about something that's so easy to check?\n\n&gt;modern day finland do\n\nAre you retarded? I said I meant forced conscription of an occupied nation, not the country's own people. A lot of countries have conscription, but in recent history pretty much only the japs and the nazis did it to the nations they occupied. Especially on such a scale.\n\n&gt;korea was annexed not occupied\n\nThat's the same thing though because koreans were coerced into it. The korean monarch even refused to sign it. You can't say it was legal when it was based on that 1905 treaty that was signed following the withdrawal of the russian influence in the region while the korean palace was occupied by the imperial japanese soldiers and there were japanese troops stationed in key locations throughout korea. It was a ransom sort of situation.\n\n&gt;thats not true, condoms were issued to prevent prostitutes from getting pregnant but thats for obvious reasons\n\nCondoms were actually issued to prevent the spread of the venerical diseases that the japanese troops caught from all the uncontrollable rapes.\n\n&gt;they werent injected with anything\n\nIt's mentioned in several studies that I can't easily find online so I'm not gonna bother. This does seem questionable actually as Oxytetracycline was patented only in 1950. Doesn't mean anything though. Arsphenamine is a syphilis treatment drug that along with antibiotics was used to contain the spread of venerical diseases from the japanese soldiers. It also isn't uncommon for women to become sterile after brutal rapes. You know, like those that the japs did to the comfort women.\n\n&gt;people die in war for ltos of reasons, people died in construction outside of war too, the estimated figure is bullshit it was not that high\n\nYou can't say the civillians you kidnapped and forced to work to death are \"necessary casualties\". This is the second most backwards thing you said today.\n\n&gt;thats not genocide\n\nNot in the traditional sense no. It was neither a methodical genocide like the holocaust nor was it an impulsive thing like the rape of nanking. But you still:\n1)kidnapped women as young as 15 y o by thousands and forced them to be prostitutes\n2)made millions of koreans forced labourers thousands of which perished from the horrible conditions.\n3)forced koreans to serve in the japanese army\n4)murdered random civillians under guise of punishing rebels\n5)looted and confiscated property\nAnd etc.\nAlso, kidnapping people then having them die of overwork is arguably pretty genocidal.\n\n&gt;&gt;Really? A 15 y o korean girl brought from korea to japan...to be a \"temporary nurse\", when there were enough of them as it was? Do you even believe the things that you're saying?\n\n&gt;yes\n\nAmazing.\n\n&gt;&gt;muh patriarchy\n\n&gt;they were **allowed** to testify\n\nYou literally proved my point.\n\n&gt;&gt;You ate prisoners of war!\n\n&gt;in extreme circumstances\n\n...are you trolling me? Did I just get magnificently baited? Ffs, how do I delete my account? The shame is killing meeeeee\n\nThat's it. You won. I won't touch reddit ever again. I haven't been trolled so brutally since that time in the summer camp. No more agendaposting. Never. Never again. Ah the shame ahhhhhh fucking hell.\n\nYou know what, I allow you to post this somewhere. This is too good to die in a deleted thread. It's not like you needed my permission though.", "score": 2, "send_replies": true, "subreddit": "Drama", "date_year_month": "2018-11", "created_utc_converted": "2018-11-07 23:40:11", "score_overall": 5, "words": "conspiracy jewish jewish jew holocaust", "shared_words": "conspiracy jewish jew holocaust", "socre_distint": 4}
{"archived": false, "author": "MajorLads", "body": "As a people living in diaspora they have been a consistent other in countries throughout history. Living as a minority group with different customs and religion is never a good a position. In Europe there has been a long history of antisemitism with pogroms during the crusades to inquisition to the Holocaust. Jews could become a popular target to blame when bad things happen. A common start of an antisemitic riot or porgrom was the idea of blood libel where after somebody(usually a child) had gone missing or been murdered that local Jews had killed the child to harvest their blood to make matzo with. \n\nThere was always also an economic incentive to anti-Jewish violence in that property could be looted, but Jews also held a distinct place in European society in regards to finance in that charging interest on loans for forbidden for Christians because it was the sin of usury. Jews were often the only people who could lend money(think of Shylock from the Merchant of Venice) and hence the economic incentive to banish or kill the person who holds your debts.\n\nDiscrimination and violence against Jews would shift in the late 19th century when the term antisemitism was popularized during the time of scientific racism. It was the technical term for *Judenhass*(jew-hatred) which was defined as an opposition to the Jewish spirit. This is when many of the antisemitic tropes of trying to control the world from behind the shadows that was best popularized by *The Protocols of the Elders of Zion*. \n\nHistorically in the Arab world Jews were second class, but along with Christians they were protected unlike other religious followers. Many of the Sephardic Jews who fled Muslim countries in the 20th century had fled Spain to the middle east during the inquisition. Antisemitism greatly increased in the middle east as a result of the Israeli-Arab conflict and many of the ideas that were popularized in the 19th century have been adopted.", "score": 10, "send_replies": true, "subreddit": "morbidquestions", "date_year_month": "2018-11", "created_utc_converted": "2018-11-08 04:48:00", "score_overall": 6, "words": "holocaust libel jewish merchant jew jewish", "shared_words": "holocaust libel jewish merchant jew", "socre_distint": 5}
{"archived": false, "author": "arobkinca", "body": "&gt; staple anti-semitic conspiracy theories about globalist jews to build political capital\n\nTrump is an ass, but this is not right. He has been a strong supporter of Isreal and his daughter is a converted Jew married to a Jewish man with Jewish kids. How has he been anti-Semitic?", "score": 4, "send_replies": true, "subreddit": "PoliticalDiscussion", "date_year_month": "2018-11", "created_utc_converted": "2018-11-08 09:29:46", "score_overall": 5, "words": "conspiracy globalist jew jewish jewish", "shared_words": "conspiracy globalist jew jewish", "socre_distint": 4}
{"archived": false, "author": "__Panda___", "body": "&gt;Correlation does not equal causation.\n\nNobody says it does. But it's very unlikely that this crime would have happened without the extreme rhetoric and conspiracy theories coming from the mainstream right, like Fox News and Republican politicians.\n\n&gt;I don't care about an opinion piece by the NYT.\n\nIt's not an opinion piece, it's a \"news analysis\", it says so on the top of the article.\n\n&gt;Its rich of you to talk about the Soros conspiracies when the left does the exact same thing about the koch brothers.\n\nNo, it's not rich of me. This just reeks of desperation on your part.\n\nFirstly of all, the Koch brothers aren't Jewish. Secondly, there are no wild conspiracy about how the Koch's stand behind everything the left doesn't like. The things that usually are criticized are things that are proven facts. For example the Koch's financing right wing shill Dave Rubin. Or how they spent millions to boost the Tea party movement. Those are proven facts.\n\nIf people say things about Soros that are true, there is no problem, for example Soros gives moneys to \"black lives matter\" that's not a conspiracy theory. But they don't just say that, they make up crazy conspiracy theories about Soros being behind the caravan or Soros paying all the women to protest on the women's march. Those are conspiracy theories, not facts, there's a difference, you don't seem to understand it.\n\nAnd when the left rails against money in politics, like the Koch's money, they're also against Soros' money in politics. The Young Turks for example have stated that countless times.\n\n&gt;American citizens have been killed by illegal immigrants, that is a fact. I know that some of you are willing to turn a blind eye to these crimes for your perceived 'greater good' but a lot of us aren't.\n\nAnd American citizens have been killed by native born citizens. Illegal immigrants are more law abiding than native born citizens, so this crime panic doesn't make any sense. Also the caravan wasn't a real danger at all by any sane measurement.\n\nThis was an insane rhetoric by the right and it most likely had an impact on this Pittsburgh shooter.\n\nIt's also a misnomer to talk about \"illegal immigrants\" here, since these people wanted to come in legally.\n\n&gt;The most heinous part is that you are talking as though Trump was talking about Soros' 'jewishness'.\n\nNo, the most heinous part is that you think it's not antisemitic if people have crazy conspiracy theories about how Soros, a rich Jew, is financing a \"allegedly\" extremely dangerous migrant caravan; a *\"foreign invasion\" \"an illegal alien mob,” “an attack on America”,* and George Soros, a Jew, is allegedly behind it. The fact that you're not capable to detect the antisemitism here does speak poorly of you.\n\n&gt;This is typical left wing bullshit where you get to just call something out as a dog whistle and expect everyone else to follow your lead.\n\nSo funny, since it's literally the right who constantly calls the left antisemitic when they criticize Israel. Constantly.\n\nBen Shaprio, one of the rights leading \"intellectuals\" for example has a definition of antisemitism that includes pretty much every person on the left and even most Jews, since 70% of them vote left. He called them \"Jews in Name Only\". He called Obama an \"antisemitic son of a bitch\", \"second Holocaust incentivizing\", his administration a \"Jew hating administration\", his chief of staff a \"Kapo\".\n\nHe called the liberal Jewish advocacy group \"J-Street\" antisemitic!\n\nSo please; spare me ...\n\nAnd you know what's the difference?  Antisemitism researcher would absolutely agree with me and the NYT that the conspiracy theories around Soros are to a large degree antisemitic. However, they would never agree with Shapiro's definition according to which Obama is antisemitic because of the Iran-Deal, or people who support the Iran Deal. Or that Obama is antisemitic at all.\n\n&gt;If you don't have any solid evidence to say that Trump was criticising Soros as a jew then shut the fuck up about it.\n\nI said he gave rise to the conspiracy theory, it's completely irrelevant whether he's antisemitic himself. He's giving support to antisemitic conspiracy theories. You're straight up nuts if you think you're somehow excused if you're not antisemitic yourself, which I don't know whether he is.\n\n&gt;You're just adding more conspiracies to the mix. Trump's son in law is jewish as is his daughter and grandchildren.\n\nAnd he also used antisemitic stereotypes when he spoke in front of Jewish Republicans. Again I didn't say he's antisemitic, I don't know whether he is, but the conspiracy theory is antisemitic and he gave weight to it, gave support. It's completely irrelevant whether he's antisemitic himself. And just to be clear; some of the greatest antisemites in history had Jewish people that they loved. Even Hitler had a \"noble Jew\", that's how he called him, Doctor Bloch, whom he spared from the Holocaust.\n\n&gt;Tell me, who do you think has done more good for the jews. Obama or Trump?\n\nObama gave them the Iron Dome, that gave enormous protection for Jews living in Israel, plus enormous financial aid, more than any previous presidents. The Iran deal I considered to be a good thing, and the annulment a bad thing by Trump. Also, he was respectful of minorities and a society like that is much more safe for Jews. That's why when Trump was elected hate crime in general and antisemitic hate crimes spiked.\n\nSo therefore, without any question; Obama. But this is not the topic here, and I'm not going to debate this with you.\n\n&gt;*She wouldn't have done damage by nominating liberal judges, nor by restricting gun rights.*  \n&gt;  \n&gt;Changing the very foundations and principles of the United States is causing damage. America isn't just whatever you want it to be at any given time. You don't get to turn millions of Americans in to criminals because they carry a weapon or accessory that you don't like.\n\nYou don't turn people into criminals if you say you can't buy or have this weapon anymore. It's an absurd statement. People can have other fire arms.", "score": 1, "send_replies": true, "subreddit": "samharris", "date_year_month": "2018-11", "created_utc_converted": "2018-11-08 18:40:36", "score_overall": 22, "words": "conspiracy jewish conspiracy conspiracy conspiracy conspiracy conspiracy jew jew holocaust jew jewish conspiracy jew conspiracy conspiracy jewish jewish conspiracy jewish jew holocaust", "shared_words": "conspiracy jewish jew holocaust", "socre_distint": 4}
{"archived": false, "author": "wewerewerewolvesonce", "body": "&gt;The thought of \"Chosen people\" being a Jewish concept may not make sense for you and me but for a Nazi, having his ideology \"tainted\" in any way with Judaism should be a major issue. Call it the anti-semitic argument against National Socialism.\n\nThis is pure fiction, who do you actually think read those books?\n\n&gt;Btw, I don't know what arguments you're talking about. These articles you linked don't make your case at all.\n\nMy point was very simple, the post the OP linked to painted Bolsheviks in a poor light, and GK Chesterton conflates Jewish people with Bolsheviks.\n\n“we may hear something of the type that really is Bolshevist and generally is Jewish.”\n\n“we used to lecture the Russians for oppressing the Jews, before we heard the word Bolshevist and began to lecture them for being oppressed by the Jews”\n\nAdditionally, I said the reason he did this was an extension of his anti-semitism which remarked on in several articles. Here's just one of the quotes.\n\n&gt;The insistence that Chesterton's anti-Semitism needs to be understood \"in the context of his time\" defines the problem, because his time-from the end of the Great War to the mid-thirties-was the time that led to the extermination of the European Jews. In that context, his jocose stuff is even more sinister than his serious stuff. He claims that he can tolerate Jews in England, but only if they are compelled to wear \"Arab\" clothing, to show that they are an alien nation.\n\nHere's another quote from another article\n\n&gt;His caricatures of Jews were often that of grotesque creatures dressed up as English people. His fictional and his non-fictional works repeated antisemitic stereotypes of Jewish greed, usury, capitalism, bolshevism, cowardice, disloyalty and secrecy (each of these stereotypes are examined in detail in my recent book, [*Chesterton’s Jews*](https://simonmayers.com/chestertons-jews/)).\n\nHere's a direct quotes from Chesterton about Jewish people\n\n&gt;He suggested that a comparison may be made between “Gipsey pilfering” \\[[9](https://simonmayers.com/2013/12/09/g-k-chesterton-and-the-stereotype-of-the-greedy-jew/#CSGJ1)\\] and “Jewish usury.” Both “races,” he observed, “are in different ways landless, and therefore in different ways lawless.”\n\nFor some reason you seem to think that his conflation of Judaism with Hitlerism was not related to his already existing anti-semitism. \n\nI mean, given that you previously accused me of making associations that weren't there I'm not sure what you think you're actually doing at this point.", "score": 1, "send_replies": true, "subreddit": "JordanPeterson", "date_year_month": "2018-11", "created_utc_converted": "2018-11-08 19:28:25", "score_overall": 9, "words": "jewish jewish jewish jewish greed cowardice jewish jew jewish", "shared_words": "jewish greed cowardice jew", "socre_distint": 4}
{"archived": false, "author": "somepasserby", "body": "&gt; Nobody says it does. But it's very unlikely that this crime would have happened without the extreme rhetoric and conspiracy theories coming from the mainstream right, like Fox News and Republican politicians.\n\nIf you can't provide a direct connection then your hypothesizing means nothing.\n\n&gt; It's not an opinion piece, it's a \"news analysis\", it says so on the top of the article.\n\nIts editorialized drivel. Give the facts, not your opinion.\n\n&gt; No, it's not rich of me. This just reeks of desperation on your part.\n\nFirstly of all, the Koch brothers aren't Jewish. Secondly, there are no wild conspiracy about how the Koch's stand behind everything the left doesn't like. The things that usually are criticized are things that are proven facts. For example the Koch's financing right wing shill Dave Rubin. Or how they spent millions to boost the Tea party movement. Those are proven facts.\n\nIf people say things about Soros that are true, there is no problem, for example Soros gives moneys to \"black lives matter\" that's not a conspiracy theory. But they don't just say that, they make up crazy conspiracy theories about Soros being behind the caravan or Soros paying all the women to protest on the women's march. Those are conspiracy theories, not facts, there's a difference, you don't seem to understand it.\n\nAnd when the left rails against money in politics, like the Koch's money, they're also against Soros' money in politics. The Young Turks for example have stated that countless times.\n\n&gt;Its about talking as though they are destroying America. Do you not think that the left has vilified the koch brothers, really? \n\nYou want to look at conspiracy theories? I just typed 'koch brothers racism' in to google and these were some of the top results.\n\n&gt; https://www.theroot.com/millions-of-students-are-quietly-being-taught-the-koch-1823742091\n\n&gt; https://www.thenation.com/article/how-charles-koch-is-helping-neo-confederates-teach-college-students/\n\nYou portray them as evil puppeteers orchestrating the downfall of America.\n\n&gt; And American citizens have been killed by native born citizens. Illegal immigrants are more law abiding than native born citizens, so this crime panic doesn't make any sense. Also the caravan wasn't a real danger at all by any sane measurement.\n\nOh so its okay for illegals to kill Americans because other Americans are already doing that. Great logic you have there. Why stop potential murderers if there are already murderers.\n\n&gt; No, the most heinous part is that you think it's not antisemitic if people have crazy conspiracy theories about how Soros, a rich Jew, is financing a \"allegedly\" extremely dangerous migrant caravan; a \"foreign invasion\" \"an illegal alien mob,” “an attack on America”, and George Soros, a Jew, is allegedly behind it. The fact that you're not capable to detect the antisemitism here does speak poorly of you.\n\nShow me exactly where Trump mentioned his 'jewishness'. If you can't then you are a proven liar.\n\n&gt; So funny, since it's literally the right who constantly calls the left antisemitic when they criticize Israel. Constantly.\n\n&gt; Ben Shaprio, one of the rights leading \"intellectuals\" for example has a definition of antisemitism that includes pretty much every person on the left and even most Jews, since 70% of them vote left. He called them \"Jews in Name Only\". He called Obama an \"antisemitic son of a bitch\", \"second Holocaust incentivizing\", his administration a \"Jew hating administration\", his chief of staff a \"Kapo\".\n\n&gt; He called the liberal Jewish advocacy group \"J-Street\" antisemitic!\n\n&gt; So please; spare me ...\n\n&gt; And you know what's the difference? Antisemitism researcher would absolutely agree with me and the NYT that the conspiracy theories around Soros are to a large degree antisemitic. However, they would never agree with Shapiro's definition according to which Obama is antisemitic because of the Iran-Deal, or people who support the Iran Deal. Or that Obama is antisemitic at all.\n\nIts the amount you call out Israel relative to every other country in the region. If you want to boycott Israel but think that we should be trading with Iran then you are an anti-semite. Making deals with a regime that has made it abundantly clear that they want to wipe Israel off the face of the map is the clearest sign one can have of anti-semitism. Coming up with every excuse under the sun as to why Hamas shoots rockets at Israel and the PLO pays the families of terrorists is anti-semitism. When you align yourself with people who make it clear that they don't even think Israel should have the right to exist you show your anti-semitism. Also, who cares if 70% of american jews vote left? How many of those 70% are jewish in any sense other than ancestry? If you don't go to synagogue or wear a yarmulke the risk of violence against you is tiny.\n\n&gt; I said he gave rise to the conspiracy theory, it's completely irrelevant whether he's antisemitic himself. He's giving support to antisemitic conspiracy theories. You're straight up nuts if you think you're somehow excused if you're not antisemitic yourself, which I don't know whether he is.\n\nYet you have no actual evidence for this other than your perceived dog whistle. Who has benefited the jewish people more? \n\n&gt; Obama gave them the Iron Dome, that gave enormous protection for Jews living in Israel, plus enormous financial aid, more than any previous presidents.\n\nNo, he simply gave approval. It doesn't mean much when he ensured that the Israelis will have to be shooting that thing in perpetuity because Obamaallied himself with the very people who encourage terrorist attacks to be carried out on Israel i.e. Abbas.\n\n&gt; The Iran deal I considered to be a good thing, and the annulment a bad thing by Trump.\n\nOf course you do. And you will completely ignore the deal's role in Yemen as well. Who cares about shiite terrorism, right. Just blame the saudis for everything.\n\n&gt; Also, he was respectful of minorities and a society like that is much more safe for Jews. \n\nWhat a load of crap. Muslims LOOOOOVVVVVEEEE the jews don't they. The black Obama staffers that wrote \"death to jews\" on the synangogue walls the other week obviously love the jews. Most minorities don't even consider jews a minority simply because their skin colour is white.\n\n&gt; That's why when Trump was elected hate crime in general and antisemitic hate crimes spiked.\n\nYet it has been disproven that that hate crime is all coming from the right. Brooklyn specifically has had a huge rise in anti-semitic crimes that were confirmed to not be of right wing origin.\n\n&gt; You don't turn people into criminals if you say you can't buy or have this weapon anymore. It's an absurd statement. People can have other fire arms.\n\nIf you ban semi-automatics and the owner of that weapon refuses to give it up you make them a criminal. To do so to your fellow americans is fucking evil of the highest order. But most of them have white skin so I guess you couldn't give a fuck.", "score": 1, "send_replies": true, "subreddit": "samharris", "date_year_month": "2018-11", "created_utc_converted": "2018-11-09 10:01:23", "score_overall": 18, "words": "conspiracy jewish conspiracy conspiracy conspiracy conspiracy conspiracy conspiracy jew jew holocaust jew jewish conspiracy jewish conspiracy conspiracy jewish", "shared_words": "conspiracy jewish jew holocaust", "socre_distint": 4}
{"archived": false, "author": "12footjumpshot", "body": "That is total bullshit. Trump support of Israel is not a support of the Jewish community. He supports Israel to placate the evangelicals who are waiting for the apocalypse (moving the embassy to Jerusalem). Netanyahu is also a strong man who aligns with Trump on his hardline view of the Muslim world. Meanwhile, when it comes to Jews as people, Trump’s rhetoric is packed with anti-Semitic dog whistles. The “globalist” conspiracy is actually the “Jewish global conspiracy”. Attacks on George Soros are not simple fear mongering of a prominent liberal donor, but a powerful wealthy Jew “pulling the strings”. And let’s not forget “fine people on both sides”. Don’t for a second think Trump isn’t empowering anti-Semitism in America just because he’s empowering anti-Muslim, anti-Latino or anti-trans sentiment too. He has more than one boogieman to trigger his base with.", "score": 27, "send_replies": true, "subreddit": "politics", "date_year_month": "2018-11", "created_utc_converted": "2018-11-09 11:40:42", "score_overall": 6, "words": "jewish globalist conspiracy jewish conspiracy jew", "shared_words": "jewish globalist conspiracy jew", "socre_distint": 4}
{"archived": false, "author": "UnbearableGhostBear", "body": "lol wow that's some amazing word diarrhea there. Pretty impressive actually. So you go check out the 3 jokes I posted on /r/TheDonald, then likely saw my Steve Jackson-esque joke post about a Leafs' winger's contract talks, and then you go into this really weird Jewish conspiracy thing that I never brought up in the first place. What's with this Jewish Illuminati thing you're into? I just made a joke (not even in this thread, you decided to go creep on me) based on a card game man, lol. But holy shit you really got irked to write so much and so fluently. Not kidding about being impressed by your wordsmithing.\n\nI like how you automatically dismiss any credibility from me and how you keep riding that high horse. I'm not in \"your reality\" after all. Folks like me get really confused when we hear that have to be diverse, unify, think for ourselves, and be good fellow Americans... but then when anything learns an inkling toward Trump it's met with hatespew, and the door opens to start your lectures about how you're better and more virtuous than others. lol I was even telling people to protest here... just question the source (who is simply a criminal). And I'm the one doing groupthink? I actually used to be an \"Orange Man Bad!\" guy 2 years ago. But the moment I gave Trump credit for something I felt was good (economy based stuff), folks like you came from all directions foaming at the mouth. I mean, you creeped my account that is very short lived, got mad at a Garth meme and a Swiss Banking joke, and turned around and called me an anti-Semite in public. Even worse! A poor man's anti-Semitic dog whistle! And my other posts? Condeming pedophelia and trying to find a church? And I'm doing groupthink?  I'm still weirded out about your Jew thing btw. You also seem to like to talk about marginalization a lot. But childish, bigoted, and projection-style attitudes like yours that are the groupthink that a lot of us are sick of. You're actually driving a bigger wedge in the divide, bud.\n\nSo while I'm sure you high fived yourself after writing your novel, it ended up just being an essay on how to project, grand-stand, force the narrative, dismiss people, publicly ridicule, and (I'm guessing) question the Jews. You're really good at writing though and I would love to read some of your hot takes on high level Jewish financiers (really, you've sparked my interest now, and your demeaning tone could make it extra-extra spicy). We can also tally up the name calling and where it started too in this thread. No, we're not going to change each other's mind and that's fine. I wouldn't want you to get bored and depressed while being angry about the Jews. Bad combo. But even though you're not actually my friend, I hope you and your family have a good day!", "score": 3, "send_replies": true, "subreddit": "bloomington", "date_year_month": "2018-11", "created_utc_converted": "2018-11-09 13:59:10", "score_overall": 6, "words": "jewish conspiracy jewish illuminati jew jewish", "shared_words": "jewish conspiracy illuminati jew", "socre_distint": 4}
{"archived": false, "author": "kingraptor724", "body": "&gt;Hitler needed an ethnic group that could be used as a scapegoat.\n\nSo of all the 100+ countries that Jews have been kicked out of, each one of them used Jews as a scapegoat? Maybe refusal to assimilate and scamming indigenous populations through usury isnt the reason? Man you sure do think that the Jews are oppressed when they are 1.4% of the US yet have massive representation in political funding, media/news, finance, law, academia, and foreign policy. When are you guys going to start being fair and tell people that Jewish privilege is real? \n\n&gt;The actions of a government =/= the wishes of the people of the country or of a loosely related ethnicity.\n\nExcept Israelis and Western Jews are ecstatic about the state of Israel. I think this video shows how Western Jews feel about Israel pretty accurately and in a nutshell. https://www.youtube.com/watch?v=MKEKiILJSEs&amp;t=0s&amp;list=WL&amp;index=12\n\n&gt;If it was a group of white people doing any of what you seem to thing is going on\n\nOf course I would. I have no problem with what the Jews are doing on a philosophical level when it comes to preserving your tribe while destroying others. You are just following the natural law after all. The problem comes in when it is targeting my tribe specifically. I am following the natural order as well by trying to save my tribe from an invader. Conflict is a natural result of an invader refusing to live separately.\n\n&gt;First of all, you're attributing characteristics to an ethnic group.\n\nAre you seriously denying the rampant nepotism in the Jewish community? How else do you logically think that Jews have gotten such large representation in important government jobs and other fields while being 1%? I have worked in 2 orthodox Jewish businesses before, dont even try your disingenuous bullshit with me. What a coincidence that both companies partook in nepotist job filling and excluding non-jews from business meetings. \n\n&gt;Secondly, you are an ethnic nationalist yourself, so how would that be even close to a legitimate criticism coming from you?\n\nRefer to my natural law point earlier. \n\n&gt;I am responsible for my own actions, but the actions of other people are not my responsibility.\n\nBe aware that you are straw manning me with the \"You think all Jews are in on a conspiracy\". I obviously know there are normal Jews that probably don't care about their national identity. But the problem is that there are VERY MANY that do, and unfortunately those people usually have power. But your type of Jew is just as bad, the (Excusing zionism and playing the victim type). Ironically low totem poll Jews like yourself keep the anti-semitism machine running by pretending that zionism doesn't exist.", "score": -1, "send_replies": true, "subreddit": "HistoryMemes", "date_year_month": "2018-11", "created_utc_converted": "2018-11-10 06:46:18", "score_overall": 7, "words": "scapegoat scapegoat jewish jewish jewish conspiracy jew", "shared_words": "scapegoat jewish conspiracy jew", "socre_distint": 4}
{"archived": false, "author": "darthhayek", "body": "&gt;You keep saying this. How do you really feel about Jews?\n\nIt just means non-Jews. Goyim is the one that has more of a pejorative connotation to it, which is why I usually avoid using that one outside of jokes and stuff. To be honest, I was never even familiar with either of these 2 words, I got along with the Jews in my community that well. For my entire childhood I looked upon them as fellow white people (and I'm not saying they *aren't* white people, it's just that, well, it was only earlier this year that I learned that \"Are Jews white\" is something that's been debated for a long time with white gentiles and Jews alike on both sides of the debate, rather than just some whitesuprem propaganda). If you can go around talking about white privilege and white supremacy all the time, then why is it bad and racist if I talk about gentiles and Jews. That's what I really don't get.\n\n&gt;Rape and murder are actual problems that exist, terrorism\n\nYes, and racism is a problem that exists too. By your own admission. You just have a problem with it when it's white people saying \"Hey, white people are people\".\n\n&gt;Huh, never realized Solzhenitsyn was such an anti-semite.\n\nSee, I don't think that being against the brutal genocide of tens of millions of people is an anti-Jew thing, but I guess that's the difference between me and you. It's also a part of the reason I find the Russian conspiracy theories of the left so disconcerting now. I don't see a difference between the liberal hatred of the Russians vs. neo-Nazi hatred of the Jews, except that the former seems to be infinitely more powerful right now. You can't exactly say something stupid like \"Trump is a Nazi\" to counteract that because he married his most prized daughter to a Jewish boy and he is the best friend that the State of Israel has ever had.\n\n&gt; No, I'm the one who's trying to point out that actual discrimination and racism against people of color exists right now, today, and not just because of shit that happened 200 years ago (although in a system where inheritance and conditions growing up play such a huge role in what a person is able to accomplish in life, shit that happened 200 years ago often does actually matter).\n\nOkay. You can talk about that all you want. I have absolutely no desire to stop you. I just want to know why you believe that talking about actual discrimination and racism against whites has to come at the expense of people of color, since I really don't understand it. It seems to me like the \"white nationalists\" (I'm not one, but still) like me and social justice warriors like you should be on the same side, but you're the ones who won't have me. Even if you think that discrimination and racism against whites isn't true, you shouldn't jump immediately to assuming we are awful people just for talking about it, why not give the benefit of the doubt that we're misguided and well-intentioned.\n\n&gt;That would be nice. Please encourage white supremacists and people who are blind to the white supremacist power structure to get started on that.\n\nWhy? I was thinking more of people like Jewy Jewboy Leibwotiz's white liberal puppet Stephen Colbert who started saying that colorblindness is racism as far back as 10 years ago.\n\nhttp://www.wupr.org/2013/04/03/%e2%80%9ci-don%e2%80%99t-see-race%e2%80%9d-the-pitfalls-of-the-colorblind-mindset/\n\nhttps://www.theguardian.com/commentisfree/2015/jan/26/do-not-see-race-ignoring-racism-not-helping\n\nWhere the fuck is there a white supremacist power structure? If such a thing existed, I would think that people would be able to openly identify as white supremacists without being purged from society........ since they'd be in power.\n\n&gt;lol white people by a 2-to-1 margin just elected a circus clown because he said the black president was from Africa and we need to keep out the weird brown immigrants\n\n&gt;such progress\n\nI'm glad you brought that up, because I find it incredibly revealing that it's the \"anti-racist left\" who has spent the last 2 years attacking a US president for his literal skin color. Points at flair\n\nHere's a thought maybe the reason why whites are becoming terrified of becoming a minority is because we don't want people like you to have power over us? It's not \"the spooky browns\", it's that you're a hateful and oppressive asshole who doesn't see us as humans.", "score": 2, "send_replies": true, "subreddit": "Libertarian", "date_year_month": "2018-11", "created_utc_converted": "2018-11-10 08:36:57", "score_overall": 4, "words": "goyim jew conspiracy jewish", "shared_words": "goyim jew conspiracy jewish", "socre_distint": 4}
{"archived": false, "author": "DangerousSuccotash", "body": "It has somewhat to do with them but they are just one family among many at the top. \n\nIt is not just Jews. You have your old elites still in power too, the remaining nobility went from land-held wealth to trafficking primarily in more liquid assets during the transition from manorial and mercantilist economics to modern industrial capitalism. They are still non-Jewish minority stakeholders in 'the management of human affairs.' \n\nIt was inevitable. You European peoples warred against one another so much, and drove technology and industry doing so to the point where states required financing to wage war which had become the health of the state. Taxation was no longer sufficient; if states did not take out loans they would lose to those that did. Indebtedness was mandatory for survival and so the transfer of power from the warrior caste to the financier caste was a virtually preordained historical certainty. \n\nIt only happens to be Jewish-led in its character because of Christian anti-usury laws: Jews were the only moneylenders in Europe for almost 1100 years and when Christians became involved it was on a more minor scale until the emergence of the Hanseatic League which produced great merchant banking dynasties like the Bethmanns and Barings. \n\nStill, this and other sources of gentile capital, such as the Italian maritime republics, the Dutch experience or the Scots come lately to London, were simply insufficient.\n\nBarings was broken in 1890. All the banks in the US were kaput but for Peabody's which rescued the others by way of Jewish finance in the mid 1800s. Jewish finance is the dominant power in the so-called 'industry.' \n\nIt is actually impossible to explain the coming into existence of Israel without the \"terrible power of [the] purse\" that Herzl referred to. \n\n&gt; long with all the other Jews\n\n\n99% of Jews know nothing about any grand conspiracy other than Judaism itself, which is a conspiratorial religion, hence the existence of the sayanim and their general conception of the world as something to be wrested from the gentiles for their God has appointed it unto them. \n\nIf you ever bother to read their texts, you will find this to be true.\n\nThe Torah:\n\n&gt; I will display my glory among the nations, and all the nations will see the punishment I inflict and the hand I lay on them.\n[Ezekiel 39:21]\n\n&gt; But thus shall ye deal with them; ye shall destroy their altars, and break down their images, and cut down their groves, and burn their graven images with fire.\nFor thou art an holy people unto the LORD thy God: the LORD thy God hath chosen thee to be a special people unto himself, above all people that are upon the face of the earth.\nDeuteronomy 7:2-6\n\n(And many more such things.)\n\n\nThe Talmud:\n\n&gt; \"Even the best of the Goyim (non-Jews) should be killed\"\n\n&gt; In Speher Or Israel (177b) it says:\n\"Take the life of the Kliphoth and kill them, and you will please God the same as one who offers incense to Him.\" And in Ialkut Simoni (245c. n. 772) it says: \"Everyone who sheds the blood of the impious is as acceptable to God as he who offers a sacrifice to God.\"\n\nThe Zohar:\n\n&gt; \"FURTHER THERE IS A LAW CONCERNING THE SLAUGHTER OF FOREIGNERS, WHO ARE THE SAME AS BEASTS. THIS SLAUGHTER IS TO BE CARRIED OUT IN A LAWFULLY VALID MANNER. THE ONES WHO DO NOT FOLLOW THE JEWISH RELIGIOUS LAW HAVE TO BE OFFERED TO GOD AS A SACRIFICE. IT IS TO THEM THAT PSALM 44:22 REFERS: 'YEA, FOR THY SAKE ARE WE KILLED ALL THE DAY LONG; WE ARE COUNTED AS SHEEP FOR THE SLAUGHTER.'\" (Thikune Zohar, edition Berdiwetsch 88b) \n\n&gt; \"The People of the Earth are idolaters, and it has been written about them: Let them be wiped off the face of the earth. Destroy the memory of the Amalekites. They are with us still in this Fourth Captivity, namely, the Princes [of Rome]... who are really Amalakites.\n\n&gt; \"It is certain that our captivity will last until the princes of the gentiles who worship idols are destroyed.\"\n\nAnd a common prayer:\n\n&gt; \"pour out thy anger upon nations that know thee not, and upon the kingdoms which do not invoke thy name; Pour out thy indignation upon them, and let thy wrathful anger take hold of them; Persecute and destroy them in anger from under the heavens of the Lord.\"\n\nAnd another prayer:\n\n&gt; \"Cut off the hope of the unjust; let all heretics perish at once; root out, break up and destroy the Proud Kingdom; hasten to make all peoples subject in our days.\"\n\nThis is the simple reality of this religion and culture. \n\n&gt; “In a thirty page study that examined all Halakhic authorities on the subject,” says professor Ehud Sprinzak of the Hebrew University of Jerusalem, “Ben-Haim [a rabbinical scholar] proves that according to the vast majority, the Torah, when speak- ing about Adam (a human being), never includes Gentiles in this category. He points out that ten recognized Halakhic authorities repeatedly proposed that Gentiles are more beast than human and that they should be treated accordingly; only two authorities recognize non-Jews as full human beings created in the image of God.” [SPRINZAK, p. 273]\n\n&gt; “What comes of all this,” wrote Rabbi Ben-Haim, “is that according to the prophets, and also according to our sages, the Gentiles are seen as beasts ... It is possible that one may see these injunctions as racism; another may call it hatred of Gentiles, whoever he is; but as far as the Jew who adheres to the statement of the Torah of Israel is concerned, this is reality and a way of life which were set for the people of Israel by G-d.” [SPRINZAK, p. 274]\n\n\n\n\nAnd this is verified by modern anecdote from among the Jewish community:\n\n&gt; Yossi Klein Halevi said that at Brooklyn’s Talmudic Academy he was taught:\n&gt;&gt;“Jews and goyim [non-Jews] were locked in eternal struggle. For now the goyim prevailed. But when the Messiah came, we would triumph. Twenty goyim would cling to each thread of our prayer shawls, pleading to serve us as protection against divine judgment.” [HALEVI, p. 68]\n\n&gt; “Every student brought up on the Babylonian Talmud – and it must be remembered that for many centuries, especially in Poland, the Jews studied little else – is inculcated with a disdain for the gentile which has entered into Jewish lore and into the very expressions of the Yiddish language.” [BERMAN, Chaim 1977, p. 35]\n\nAnd enjoys historical pedigree all the way back from their most revered sages:\n\n&gt; Isaac Abravenel (1437-1508), a prominent Jewish scholar of the Middle Ages, “considered Israel to be superior to other nations and therefore, he [Israel] is entitled to be their masters.” [ROSENTHAL, p. 73]\n\n\nMaimonides said:\n&gt;“A Gentile slave has to be enslaved forever ... one of the main reasons being that since the Jewish nation is the elite of the human race ... they deserve to have slaves serve them. [ROSENTHAL, p. 71]\n\n\n", "score": -4, "send_replies": true, "subreddit": "AskReddit", "date_year_month": "2018-11", "created_utc_converted": "2018-11-10 16:35:05", "score_overall": 16, "words": "jewish jewish merchant jewish jewish conspiracy goyim jewish jew jewish goyim goyim goyim jewish jewish jewish", "shared_words": "jewish merchant conspiracy goyim jew", "socre_distint": 5}
{"archived": false, "author": "Morningxafter", "body": "They hate the Jews but don't call them that. They call them *globalists*. But don't be fooled, in conservative speak globalist = Jew.  \n\nAnd for every problem they cause they try to shift the blame for everything on the democrats (and every conspiracy they have about the democrats comes down to being funded by George Soros, who is Jewish).\n\nSo yeah, every day they get closer and closer to being the same goddamn thing.", "score": -1, "send_replies": true, "subreddit": "worldnews", "date_year_month": "2018-11", "created_utc_converted": "2018-11-11 16:07:50", "score_overall": 4, "words": "globalist jew conspiracy jewish", "shared_words": "globalist jew conspiracy jewish", "socre_distint": 4}
{"archived": false, "author": "Khalbrae", "body": "They usually mean Jews or are willfully ignorany that the terms Globalist and Cultural Marxist have meant Jew since the nazi era.\n\n&gt; Globalist\n\n[It does mean Jew and has since the nazi era](https://www.adl.org/resources/reports/quantifying-hate-a-year-of-anti-semitism-on-twitter#%E2%80%9Cglobalist%E2%80%9D-as-code-word-for-%E2%80%9Cjew%E2%80%9D).\n\n[Another source](https://www.theatlantic.com/politics/archive/2018/03/the-origins-of-the-globalist-slur/555479/)\n\n[A racist podcast describing how Hitler's regime coined the globalist term](https://mk.christogenea.org/podcasts/adolf-hitler-globalism). &lt;- Hate site\n\n[A neo nazi going off on forums how Hitler was right because of the Jews and their connection to Globalism/Illuminati/Freemasonry](https://steamcommunity.com/app/476600/discussions/0/1318836262653250772/)\n\n[Another hate site citing Hitler's opposition to Jews and their globalism](http://immigration-globalization.blogspot.com/2011/10/if-hitler-won-world-war-ii-we-would.html?m=1) &lt;- hate site\n\n[More evidence](http://theglobalelite.org/globalists/) &lt;- actual hate group\n\n&gt; Cultural Marxist\n\n[It's been well known for some time](https://www.theguardian.com/commentisfree/2015/jan/19/cultural-marxism-a-uniting-theory-for-rightwingers-who-love-to-play-the-victim)\n\n[Very much so](https://antizionistleague.com/scrapbook/cultural-marxism/). &lt;- Actual hate group site\n\n[Indeed](https://www.vice.com/en_us/article/78mnny/unwrapping-the-conspiracy-theory-that-drives-the-alt-right)\n\n[Do you really need any more proof?](https://dailystormer.name/madlad-ron-paul-tweets-a-wyatt-mann-cartoon-blasting-jew-cultural-marxism/) &lt;- Actual hate group site.\n\nSpreading awareness that [supporting David Duke](https://davidduke.com/how-a-handfull-of-marxist-jews-turned-western-and-us-culture-upside-down/) (Actual hate group leader) by normalizing his language is wrong.\n\nOn this sub I will probably be downvoted to hell for pointing out both words [nazi roots.](https://youtu.be/vYQo6LI3Y7c)", "score": 1, "send_replies": true, "subreddit": "canada", "date_year_month": "2018-11", "created_utc_converted": "2018-11-12 00:52:19", "score_overall": 9, "words": "globalist jew globalist jew globalist globalist illuminati conspiracy jew", "shared_words": "globalist jew illuminati conspiracy", "socre_distint": 4}
{"archived": false, "author": "kusuriurikun", "body": "Part 2 of explanation (warned you it was long):\n\nThe NAR also has some fairly unique internal theology that really can be described as a Grand Unified Conspiracy Theory, [including a general belief in demonology that owes much more to the concepts of \"body thetans\" and \"engrams\" in Scientology than mainline religion](https://www.dailykos.com/stories/2006/10/3/253028/-Dominionism-as-a-coercive-religious-movement-part-2) as well as a strong belief in effectively alt-*everything* (alt-media, alt-medicine, alt-psychiatry, alt-education, you name it, they have it) and [a religious mandate that is in part based on prosperity gospel \"name it and claim it\" beliefs that essentially state the entirety of the country and society MUST be \"named and claimed\" for blessings to ensue](https://www.dailykos.com/stories/2006/10/5/253942/-A-history-of-Dominion-Kingdom-Now-Restoration-Theology) along with [an extremely aggressive \"spiritual warfare\" meme that essentially posits NAR members as being literal holy warriors against the forces of Satan in the physical world as well as the spiritual.](https://web.archive.org/web/20120814214454/http://dogemperor.newsvine.com/_news/2009/05/26/2864769-joels-army-mythos-101-not-your-grandmothers-christianity)  This particular evolution (especially the \"spiritual warfare\" stuff and the heavy emphasis on isolation of its members from non-NAR-controlled media sources) has led to things like a strong belief that the world in general is being secretly controlled by a literal Satanist cabal involving most people in power, which got especially ramped up after two books were published (Mike Warnke's \"The Satan Seller\" and Padzer and Smith's \"Michelle Remembers\") essentially setting up an entire mythos in dominionist circles on how Satanist cabals supposedly operated and how the entire Satanic Illuminati worked (Warnke in particular explicitly tied in urban legends of devil worship with the Illuminati).  Even after all of the above were exposed by an evangelical magazine (*Cornerstone* did a much-needed expose of most of the \"Satanic Panic\" peddlers in the early 90s) \"satanic panic\" has never died down in NAR circles and in fact has really become part of the core theology; [Rick Joyner in particular still promotes Mike Warnke even though he's been well and truly outed as a fraud](http://barthsnotes.com/2014/03/28/rick-joyner-and-the-return-of-mike-warnke/).\n\n(And occasionally the \"Satanic Panic\" narrative has gone oddly.  One downline of AmWay, [an MLM strongly connected with dominionist groups including cross-recruitment in NAR \"cell churches\"](https://www.dailykos.com/story/2007/7/23/361219/-Dominionism-s-parallel-economy-Pt-2-Dominionism-s-Corporate-Sponsors) (a setup common in NAR megachurches wherein [the church itself is set up like an MLM](https://www.dailykos.com/story/2007/8/11/370152/-Dominionist-cell-churches-and-religious-abuse) with multiple \"downlines\" et al) [actually put out a \"Satanic Panic\" narrative in the 70s insinuating the Proctor and Gamble servicemark was in fact a secret Satanic symbol and that the members of the P&amp;G board were actually a cabal of devil worshippers](https://caselaw.findlaw.com/us-5th-circuit/1296426.html); P&amp;G [sued and eventually won](https://www.cbsnews.com/news/procter-gamble-wins-satanic-civil-suit/), but not before having to change their service mark as a direct result of the harassment.)\n\nA lot of the stuff you see starting from Pizzagate onward (with the supposed \"rape tunnels\" and MKULTRA involvement and demonic sex rituals et al) are pretty much straight lifted from NAR \"satanic panic\" stuff that never died out in those circles (some of the \"rape tunnel\" stuff actually dating from stuff from [the infamous McMartin preschool trial, which included testimony from one of the authors of the debunked and fraudulent \"Michelle Remembers\"](https://en.wikipedia.org/wiki/McMartin_preschool_trial)); in fact, quite a lot of NAR preachers (including Rodney Howard-Browne, who's been linked to Trump himself) [actively promote Qanon stuff as a sort of vindication of the actual conspiracy theories pushed for ages in NAR circles.](https://www.mediamatters.org/blog/2018/08/02/list-right-wing-amplifiers-qanon-conspiracy-theory/220890?ICID=ref_fark)  If there is anti-Semitism involved, it's usually blaming \"secular Jews\" or \"globalist Jews\"; much more commonly, *LGBTQA* people literally get put in the position of the Ultimate Baddies (and here, we can actually name a direct \"patient zero\"--Scott Lively, [who's made quite a career of promoting a form of anti-gay Holocaust revisionism and some of the most virulent anti-LGBT initiatives (including the infamous Ugandan \"kill the gays\" bill)  and has authored books that can essentially be considered NAR equivalents of David Irving's \"Hitler's War\" and the Russian forgery \"Protocols of the Learned Elders of Zion\" with \"Jew\" replaced by \"Homosexual\" and \"Zionist\" replaced with \"Homosexualist\"](https://www.dailykos.com/stories/2007/10/18/399689/--Joel-s-Army-in-Eastern-Europe-hatecrimes-and-their-American-supporters)).\n\nEven the \"following breadcrumbs\" bits in Qanon imagery actually fit in disturbingly well with NAR belief, as [there is a strong \"signs and wonders\" emphasis where even the smallest coincidences can be seen as literal Signs From Deity as to where to go](http://www.talk2action.org/story/2006/6/1/112441/6431/Diary/Rick_Warren_s_Dirty_Dominionist_Secret).  (When you're dealing with folks who--very sincerely--see a woman writhing and grunting on the ground as a Sign From God Himself of the Birth Pangs of the New Millenium or someone sounding like they're about to hork up a hairball being a Sign From God Himself that Lord Conqueror Republican Jesus Is Coming Soon or someone waving a pretend lightsaber around as being a sign they're Going To War With Satan or have the nonsense babblings of repeated syllables interpreted as an \"Angelic Language\" or some obscure \"African\" or \"Indian\" language all repeating points the pastor conveniently wants to emphasize...people finding Great Meaning with QAnon droppings isn't too much more of a stretch for them.  And yes, people \"roaring like lions\" or acting like they're about to drop a baby in the middle of the pews is a Routine Thing in NAR worship.)\n\n(And wait, there's more in part 3)", "score": 3, "send_replies": true, "subreddit": "Qult_Headquarters", "date_year_month": "2018-11", "created_utc_converted": "2018-11-12 03:09:03", "score_overall": 8, "words": "conspiracy illuminati illuminati conspiracy conspiracy globalist holocaust jew", "shared_words": "conspiracy illuminati globalist holocaust jew", "socre_distint": 5}
{"archived": false, "author": "GalaxyBejdyk", "body": "Or, even better example...\n\n**THE JEWS** \\*dun, dun DUUUUN\\*\n\nJews are appereantly inferior subhumans, yet are able to control the world all on their own at the same time, who want to destroy and corrupt the world, yet are also blamed for making our world \"too soft\" trough continuous peace. They are often blamed by black supremacists for running the slavery, yet at the same time are accused by white nationalists for giving black people equal rights.\n\nNot to mentin, that they are blamed for the creation fo Holocaust (some Neonazis do believe that Holocaust hapenned, just that was orchestrated by Jews...and Hitler was appereantly Jew as well), despite the fact that depression and disilusioment from Holocaust almost caused a destruction of Jewish culture and faith.\n\nAnd that's just the tip of the iceberg...\n\nAnti-semitic conspiracy theories are some of the warped and bizzare nonsense, I've ever seen on the internet and that includes nonsense like Flat Earth, Transvestigation etc. ", "score": 22, "send_replies": true, "subreddit": "niceguys", "date_year_month": "2018-11", "created_utc_converted": "2018-11-12 21:50:08", "score_overall": 6, "words": "holocaust holocaust jew holocaust jewish conspiracy", "shared_words": "holocaust jew jewish conspiracy", "socre_distint": 4}
{"archived": false, "author": "shebazz42", "body": "&gt; It just shows you how despicable these _Democrats_ are that they’ll stoop that low to go into the prison, the jail, and register these criminals\n\nI feel like \"Democrat\" and \"liberal\" are starting to become \"Jew\" for some people. Like, for me, I just assumed the dude had registered himself, and there wasn't any sort of party involvement from either side, since if he hasn't been convicted yet he can obviously vote still. And his party affiliation is pretty irrelevant anyway.\n\nBut with the whole \"Jew\" parallel, so much of the stuff Democrats have been accused of has been bullshit boogeyman conspiracy stuff of the likes attributed to Jewish people before the Holocaust, and it's getting creepy to me that millions of people ingest this unsubstantiated conspiracy nonsense from Fox News. Where are their lies going to end? Are they going to get more and more fervent and violent?\n\nAnother thing that concerns me is that with the internet and government records sites, it's pretty straightforward to get a list of the Democrats in an area. I know in my state, North Carolina, given someone's name and county (and birthday if it's a common name), you can get their party affiliation via the [Voter Search](https://vt.ncsbe.gov/RegLkup/) page the state board of elections hosts. You can get a list of names in an area via the county assessor's office, such as [this one for Wake County, NC](http://services.wakegov.com/realestate/). I can 100% code something up that gives you a list of Democrats in Wake County. Makes me flash back to watching Hotel Rwanda where they had lists of Tutsi names and went around killing everyone with machetes. There's nothing stopping people from making those lists for Democrats.\n\nI hope that's not the direction we're headed, but I worry about it.", "score": 12, "send_replies": true, "subreddit": "politics", "date_year_month": "2018-11", "created_utc_converted": "2018-11-13 00:02:43", "score_overall": 6, "words": "jew jew conspiracy jewish holocaust conspiracy", "shared_words": "jew conspiracy jewish holocaust", "socre_distint": 4}
{"archived": false, "author": "StellarisJunkie", "body": "HELL NO!\n\nNazi? She is speaking herself and literally saying whites should be replaced. No one, not one Nazi is in the video! Only a Jewish woman confirming what *the Nazis repeatedly told the world and we perceived as a \"conspiracy\"*.\n\nTry again.\n\nAfrica will be African - absolutely fine.\n\nAsia will be Asian - absolutely fine.\n\nIsrael will be Jewish - absolutely fine.\n\nEurope will be European - Racist Fascist Nazi Anti-semitic Hate Speech Slavery holocaust Oppression White Privilege OY VEY MESHIGEN GOYIM Shut it Down.\n\n", "score": 1, "send_replies": true, "subreddit": "fstdt", "date_year_month": "2018-11", "created_utc_converted": "2018-11-13 04:51:01", "score_overall": 5, "words": "jewish conspiracy jewish holocaust goyim", "shared_words": "jewish conspiracy holocaust goyim", "socre_distint": 4}
{"archived": false, "author": "iLuvz2bake_n_69", "body": "it isn't false or a lie - it is very true and very open. it's not some secret or made-up thing. many, many, many jewish organisations very openly (always have done) push open borders propaganda and policies in western nations, and directly and indirectly aid in the migration and even the transport/trafficking of large numbers of people (both in north america and europe also). that is even currently happening now with the \"migrant caravan\" from guatemala etc - with trucks of jewish organisations with the star of david even filmed transporting people. and no it's not someone \"posing as jewish organisations to fuel hatred of jews\" or some other nonsense. \n\n\n\nthis is not some secret conspiracy - again, it is very open. jewish organisations are routinely in the news pushing for and promoting open borders policies. Trump never made any \"fear mongering\" or \"inflammatory remarks\" regarding this. he may have mentioned george soros and globalists but he does not and never has done, denounced jews as a group. he is THE most pro-semitic and kosher president in US history. \nhe is also the most jew-approved (officially, by jewish organisations and israel, nevermind individuals personal opinions of him) president, also. \nhe even has direct family who are jewish including his grandchildren.\n\n\n\nyou're an idiot. ", "score": 1, "send_replies": true, "subreddit": "florida", "date_year_month": "2018-11", "created_utc_converted": "2018-11-13 14:45:37", "score_overall": 9, "words": "jewish jewish jewish conspiracy jewish kosher jew jewish jewish", "shared_words": "jewish conspiracy kosher jew", "socre_distint": 4}
{"archived": false, "author": "CordouroyStilts", "body": "Let me preface this by saying I am not anti-Semitic, I'm just going to tell you what I've seen:\n\nIt really comes down to wealth and power.  Since I was a child I had heard \"The Jews run the media\" even though as a young kid in the early nineties I had no idea what that meant.  Regardless, that thought was out there.  I don't even know where I heard it.\n\nNow I'm in my thirties and frequently find entertainment in reading the conspiracy boards.  There is definitely some good offbeat news on those boards and those people are definitely on to big things in some ways.  Other times it's a wall of text that is clearly the rantings of someone most likely mentally Ill.  Usually with a top comment like \"Great Job\".\n\nIf you follow any conspiracy rabbit hole far  enough it somehow always ends anti-Semitic.  I've even seen it go as far as to say the Holocaust was a hoax by the Jews so that no one would be able to criticize them in the future.\n\nThe 'big proof' is what is called the \"Jewish Question\" or \"JQ\" since it needed an abbreviation since it's typed so much in those circles.  The JQ is basically \"how can a group who represents &lt;2% of the global population control &gt;90% of the wealth\".\n\nThis question quickly evolves any talk of the \"Rich\" \"elite\" \"illuminati\" into \"the Jews control everything\".\n\nI think the real answer is that in the medieval ages Christian's were forbidden to charge interest on a loan.  This allowed those of Jewish faith to capitalize and create the banking industry.  Bankers quickly became a very wealthy group who now could reinvest that wealth. \n\nNow I'm not an economist or historian so don't quote me on any of this.  Just another conspiracy post I guess.\n\nEdit: changed \"biblical times\" to \"medieval ages\"\n", "score": 1, "send_replies": true, "subreddit": "politics", "date_year_month": "2018-11", "created_utc_converted": "2018-11-13 14:53:06", "score_overall": 7, "words": "conspiracy conspiracy holocaust jewish illuminati jewish conspiracy", "shared_words": "conspiracy holocaust jewish illuminati", "socre_distint": 4}
{"archived": false, "author": "Khalbrae", "body": "A lot of people don't realize they are dog whistles originating from the Nazi party.\n\nThey usually mean Jews or are willfully ignorany that the terms Globalist and Cultural Marxist have meant Jew since the nazi era.\n\n&gt; Globalist\n\n[It does mean Jew and has since the nazi era](https://www.adl.org/resources/reports/quantifying-hate-a-year-of-anti-semitism-on-twitter#%E2%80%9Cglobalist%E2%80%9D-as-code-word-for-%E2%80%9Cjew%E2%80%9D).\n\n[Another source](https://www.theatlantic.com/politics/archive/2018/03/the-origins-of-the-globalist-slur/555479/)\n\n[A racist podcast describing how Hitler's regime coined the globalist term](https://mk.christogenea.org/podcasts/adolf-hitler-globalism). &lt;- Hate site\n\n[A neo nazi going off on forums how Hitler was right because of the Jews and their connection to Globalism/Illuminati/Freemasonry](https://steamcommunity.com/app/476600/discussions/0/1318836262653250772/)\n\n[Another hate site citing Hitler's opposition to Jews and their globalism](http://immigration-globalization.blogspot.com/2011/10/if-hitler-won-world-war-ii-we-would.html?m=1) &lt;- hate site\n\n[More evidence](http://theglobalelite.org/globalists/) &lt;- actual hate group\n\n&gt; Cultural Marxist\n\n[It's been well known for some time](https://www.theguardian.com/commentisfree/2015/jan/19/cultural-marxism-a-uniting-theory-for-rightwingers-who-love-to-play-the-victim)\n\n[Very much so](https://antizionistleague.com/scrapbook/cultural-marxism/). &lt;- Actual hate group site\n\n[Indeed](https://www.vice.com/en_us/article/78mnny/unwrapping-the-conspiracy-theory-that-drives-the-alt-right)\n\n[Do you really need any more proof?](https://dailystormer.name/madlad-ron-paul-tweets-a-wyatt-mann-cartoon-blasting-jew-cultural-marxism/) &lt;- Actual hate group site.\n\nSpreading awareness that [supporting David Duke](https://davidduke.com/how-a-handfull-of-marxist-jews-turned-western-and-us-culture-upside-down/) (Actual hate group leader) by normalizing his language is wrong.\n\nJust pointing out both words [nazi roots.](https://youtu.be/vYQo6LI3Y7c)\n\nFeel free to use these links if you wish.", "score": 10, "send_replies": true, "subreddit": "CanadaPolitics", "date_year_month": "2018-11", "created_utc_converted": "2018-11-13 22:56:47", "score_overall": 9, "words": "globalist jew globalist jew globalist globalist illuminati conspiracy jew", "shared_words": "globalist jew illuminati conspiracy", "socre_distint": 4}
{"archived": false, "author": "420blazeitfanggot", "body": "the thing is canada has no culture. its supplanted by Hollywood. and you know what religous faith these pedo executives share. hint: Arabs hate this 5 things about a specific neighbor. \n\nEspecially here in vancouver. Reminder that it's not just WASPs but Jews who think by attacking a successful minority group they can alleviate their position in society. Seems like the whole zionist conspiracy holds some ground, I mean it's not like God does this to people who are \"chosen\". Let's not forget how powerful white guilt is towards darker skinned people lol. blaming asians for unaffordable housing prices while banding together with other non asian minorities to attack us. \n\nI mean if God really loved Jews, they would be treated like Saudis not rounded up like pigs but because they were so dirty how can they say no to free shower and food. Seems like their own greed blinded them and just made it super easy for Nazi germany to get rid of em....if this shit was done to Asians we'd stepped the fuck up. Everybody would sacrifice themselves for the collective good but not Jews, they actually collaborated with the Nazis, and it was actually Jew on Jew holocaust more than just straight up nazism. Even Hitler knew to keep the elite Jews in power to run the massive economy. Im so sick of hearing about the fucking holocaust like its the only god damn genocide in human history. ", "score": 2, "send_replies": true, "subreddit": "AsianMasculinity", "date_year_month": "2018-11", "created_utc_converted": "2018-11-14 17:16:35", "score_overall": 6, "words": "conspiracy greed jew jew holocaust holocaust", "shared_words": "conspiracy greed jew holocaust", "socre_distint": 4}
{"archived": false, "author": "fascismbot3", "body": "\"A George Soros\" is a boogeyman. He is the male Hillary. He is someone the right wing can blame their woes upon. He is also a dog-whistle for antisemitism. Soros = Jewish / Globalist = Jewish. \n\nFascists cannot take responsibility for anything, they need a villain. \n\nHe is the right wing's scapegoat. He fits multiple quotas. Billionaire Elitist, Progressive donor, Democrat, Foreigner and Jew. ", "score": 3, "send_replies": false, "subreddit": "politics", "date_year_month": "2018-11", "created_utc_converted": "2018-11-15 03:52:18", "score_overall": 5, "words": "jewish globalist jewish scapegoat jew", "shared_words": "jewish globalist scapegoat jew", "socre_distint": 4}
{"archived": false, "author": "cromlaughsat4winds", "body": "The Means of Production under Nazi rule remained privatized, but was limited to Germans. Company leaders were allowed to make independent decisions, so long as they coincided with the greater political platform of Nazi Germany. The nationalization of private industry only occurred amid the war (much like many other participants) and was not an ideological decision, but a necessity from a funding perspective. \n\nGermany was amid a major depression. They separated 2 forms of capitalism- Schaffendes Kapitall: a productive, meritocratic, and Nationally driven form of capitalism, and Raffendes Kapital: a money-grubbing, greedy, foreign influenced capitalism. Antisemitic \nbeliefs in Germany predate the rise of Nazi Germany (see Richard Wagner's \"Jewishness in Music\" (1850), Wilhelm Marr's \"Victory of Jewry over Germandom (1879), or a slew of other examples you'll easily find if you still don't believe me). Full Jewish emancipation was not granted in Germany until 1871. The differentiation of these forms of capitalism was to scapegoat the Jewish people as the cause for capitalism's failings. \n\nThe Nazis privatized more than any other Western Capitalist country of that time period. There was a substantial push for expanded social programs/nationalization after the Great Depression. Following the rise of Nazi Germany, a number of companies which Weimar Germany had acquired a majority share of were sold off to a minority.\n\nNot to conflate Nazi Germany with capitalism though, it resembles capitalism as much as it does socialism. It is a far-right dictatorship and behaves as such.\n\nIf it were exclusively about wealth disparity, wealthy non-Jewish Germans would have been in concentration camps, but they were instead praised as societal leaders.\n\n\"If the Marxist teaching were to be accepted as the foundation of the life on the universe, it would lead to the disappearance of all order that is conceivable to the human mind. And thus the adoption of such a law would provoke chaos in the structure of the greatest organism that we know, with the result that the inhabitants of this earthly planet would finally disappear... Should the Jew, with the aid of his Marxist creed, triumph over the people of this world, his crown will be the funeral wreath of mankind, and this planet will once again follow its orbit through ether, without any human life on its surface, as it did millions of years ago\"\n\n-Mein Kampf\n\nHitler referred to Marxism as a Jewish weapon. \n\n\"Within a year of the German defeat in 1918 the first calls were heard for a new cultural mission for the German nation designed to stave off the spread of Bolshevism... it was the juxtaposition of 'Asiatic Bolshevism' with the 'Oriental Jew' that provided the key to National Socialist perceptions of an elaborite Jewish conspiracy, of which Marxism, with its insistence on 'those eminently Jewish values', internationalism, egalitarianism and pacifism, so antithetical to the völkisch ideal, was a key component\"\n\n-Lorna Waddington, 'Hitler's Crusade'\n\nIt's worth noting that Socialism was extremely popular in Europe at the time, and Hitler redefined it to gain popularity among the German people.\n\n\"Whoever is prepared to make the national cauuse his own to such an extent that he knows no higher ideal than the welfare of the nation; whoever has understood our great national anthem, \"Deutschland über Alles,\" to mean that nothing in the wide world surpasses in his eyes this Germany, people and land -- that man is a Socialist\"\n\n\"Socialism! What does socialism really mean? If people have something to eat and their pleasures, then they have their socialism.\"\n\n\n-Adolf Hitler\n\nThat rings nationalism to me.\n\n", "score": 2, "send_replies": true, "subreddit": "2007scape", "date_year_month": "2018-11", "created_utc_converted": "2018-11-15 21:20:33", "score_overall": 10, "words": "jewish scapegoat jewish jewish jew jewish jew jewish conspiracy jewish", "shared_words": "jewish scapegoat jew conspiracy", "socre_distint": 4}
{"archived": false, "author": "KFCConspiracy", "body": "Some of the things he actually does fit into this narrative about \"Globalism\" since he fights for free trade and democratic (lowercase d) values here and abroad. Some people resent that he's jewish, some people disagree with his values, and some people resent that he's a financier. So these conspiracy theories spring up around him paying basically anyone who agrees with him spring up and get repeated with dog whistles like globalist and banking conspiracy which are long time code-words for Jew in the antisemitic and conspiracy community. It gets repeated around, then places like Fox start to pick it up, knowing or not that they're repeating conspiracy theories from antisemites, and boom you have the right wing boogeyman. I think at this point it's morphed beyond simple antisemitism and people are just repeating this shit not knowing what the historical implications are... But there are people who should know better who repeat this shit. ", "score": 5, "send_replies": true, "subreddit": "tech", "date_year_month": "2018-11", "created_utc_converted": "2018-11-16 14:43:41", "score_overall": 7, "words": "jewish conspiracy globalist conspiracy jew conspiracy conspiracy", "shared_words": "jewish conspiracy globalist jew", "socre_distint": 4}
{"archived": false, "author": "thefirstandonly", "body": "Jew here.\n\nI actually don't normally talk about anti-semitism on the left/or Israel, but let me shed some light as to why the author's \"case\" here is complete fucking bullshit.\n\nThe right often talks about antisemitism (as in this article) by pointing at figures on the left and saying, look, they don't support Israel. More often than not, when someone on the left is deriding Israel, they are criticizing the country, its politics, domestic or foreign. The disagreement/hatred is not aimed at people. They generally don't stake out the position of, ALL JEWS NEED TO DIE AND THAT MEANS ISRAEL NEEDS TO BE EXTERMINATED. However this is basically true among the antisemitic non-religious right. \n\nOn the right however, they can generally be broken up into two groups, especially in 2018. \n\n1. The religious right. Christians, religious right who \"care\" about Jews in the sense they want Israel to be in their hands. Thats the extent of it. Of course when their messiah comes and the rapture occurs, all these Jews will be left on the earthen hellscape to rot and those who die will be burning in hell for eternity, but hey, they consider themselves \"friends\" of the Jewish people. Newsflash: They are not friends of the Jewish people, and most Jews understand this. \n\n2. The non-religious right, the alt-right, etc. Almost all \"red pilling\" in these groups point to jews as being the ultimate evil. They want Jews dead, exterminated, eradicated. The MAGAbomber was antisemitic, and the synagogue shooter as well. Both also believed in Qanon. Qanon is virulently antisemitic (jews control the planet, globalism, etc) and we see countless images of Trump supporters at the hate rallies holding Qanon signs, wearing the shirts, chanting WWG1WGA. If you press any these lunatics, you will find they hate Jews. Because they are conspiracy theorists and the road all these right-wing conspiracies take is the same. They are no different than Sayoc. Remember the Unite the Right rally? Same thing, same caliber of people. Alt-right lunatics, incels, racists. All of them hate Jews. Not the \"we think Israel should relax its policies\" hatred, but instead the \"Israel should be nuked and jews should be exterminated\" type of hatred. By the way, all of this is supported by the Trump administration. Eric Jr goes on TV and says critics of Trump are earning their shekels, they hire antisemites throughout all levels of the administration, GOP representatives invite holocaust deniers (Matt Gaetz, Steve King, etc) to major events, they retweet white supremacists and racists constantly. On and on this goes. \n\n...\n\nThe right, both religious and non-religious, completely monopolize the groups that harbor REAL antisemitism. Most American Jews understand this and vote democrat for this reason. The right can go fuck itself. ", "score": 12, "send_replies": true, "subreddit": "politics", "date_year_month": "2018-11", "created_utc_converted": "2018-11-16 16:51:46", "score_overall": 5, "words": "jew jewish jewish conspiracy holocaust", "shared_words": "jew jewish conspiracy holocaust", "socre_distint": 4}
{"archived": false, "author": "Myszy", "body": "Blood libel, pedophilia and satanism, it's all lies. All the peoples of the world, white and brown, who have identified the promotion of suicidal attitudes and a Bolshevik's wet dream levels of historical warping that Jewish groups have supported and funded? All bullshit. Hyperinflation? Not the Jews fault, it was the \"bankers\"! Sexual hedonism? Bullshit. Destruction of the family unit? Bullshit. Excessive promotion of race-mixing, removing the true diversity of the world? Bullshit. Promoting mass immigration? Bullshit. Anne Frank's diary? Written in ball-point pen. Whoops. Holodomor? Anti-semitic trickery. Eisenhower Death Camps? Bullshit. The holocaust was obviously worse. Sure the story says the bodies were dumped right next to the well for drinking water, and all the supposed death camps reside in communist - read: Ministry of Truth - East Germany, whereas not a single camp inspected by the US was deemed to be so. Cutting BABIES' DICKS AND SUCKING THE BLOOD OUT? Photoshop, duh. FGM is horrible but multilating baby dick? Religious freedom, bigot! Entarte Kunst? Bullshit. Increasingly severe porn on the front page with an average first viewing age of 11? Lies. I wonder why Lev Bronstein changed his name to Leon Trotsky...\n\nhttps://www.youtube.com/watch?v=n7QXz6hDtxI&amp;t=22s\n\nhttps://www.azquotes.com/quote/712915\n\nhttp://dtorah.com/otzar/shas_soncino.php?ms=Sanhedrin&amp;df=59a\n\nR`Johanan said: A heathen who studies the Torah *deserves death*, for it is written, Moses commanded us a law for an inheritance;(2) it is our inheritance, not theirs.(3) Then why is this not included in the Noachian laws? - On the reading morasha [an inheritance] he steals it; on the reading me'orasah [betrothed], he is guilty as one who violates a betrothed maiden, who is *stoned*.(4)\n\nhttp://dtorah.com/otzar/shas_soncino.php?ms=Sanhedrin&amp;df=58b\nRaba objected: is there anything for which a Jew is not punishable and a heathen is?(19) R`Hanina said: If a heathen smites a Jew, he is worthy of death(21) for it is written\n\nR`Joseph said, The scholars(23) stated: A heathen is executed for the violation of three precepts- Mnemonic G Sh R-(24) viz. , adultery, bloodshed, and blasphemy. But R`Shesheth said thus: The scholars stated, A heathen is executed for the violation of four precepts [including idolatry].\n\nhttp://dtorah.com/otzar/shas_soncino.php?ms=Sanhedrin&amp;df=55b\nR`Joseph said: Come and hear! A maiden aged three years and a day may be acquired in marriage by coition, and if her deceased husband's brother cohabits with her, she becomes his. \n\nFUCK your ignorance, and fuck your gay /s passive-aggressive fag talk. Stop being such a closed-minded mental robot and do your own research. Rooting for you bud. Reading suggestions: 200 Years Together - Alexander Solzhenitsyn, The Culture of Critique - Dr. Kevin MacDonald, The Talmud Unmasked - Justinas Bonaventure Pranaitis", "score": -1, "send_replies": true, "subreddit": "HistoryMemes", "date_year_month": "2018-11", "created_utc_converted": "2018-11-17 06:29:58", "score_overall": 5, "words": "libel jewish holocaust jew jew", "shared_words": "libel jewish holocaust jew", "socre_distint": 4}
{"archived": false, "author": "jericha", "body": "I am by no means an expert on genocide in general, but I’ll do my best to answer your question, based on my (admittedly limited) understanding these issues. \n\nFirstly, I’m American, and I’m looking at this topic from that perspective, so to me the idea of “white genocide” is inextricably linked to white supremacists and Neo Nazis. In the US, factions of the far right legitimately believe, or at least claim to believe, that the political, economical and social dominance (or supremacy) of white people in our society, which has existed unchallenged since this country was founded, is being challenged and subverted by... honestly, I don’t know. Black people, for sure, Jews who control the media and the so called “deep state” and/or some sort of global cabal that is secretly running the world behind the scenes (George Soros, the Illuminati, which according to the conspiracy theory, was founded  by the Rothschild family in the 18th or 19th century, I’m sure the list goes on), Hispanic immigrants, Muslims, you know, non-Caucasian/Aryan (in Nazi parlance) people. \n\nIn my mind, this movement, although certainly not a new phenomenon by any means, found allies in the people who started sounding the alarm about a supposed “war on Christianity” during Obama’s presidency (because apparently Obama is really a Muslim and a member of the Muslim Brotherhood, hell bent on imposing sharia law in the US, which obviously didn’t happen, so... see also: birtherism), which to me was nothing more than a racist dog whistle. While not all people who have bought into the “war on Christianity” hysteria are neo Nazis or outspoken racists and bigots, “white” supremacy in the US really means “white Christian” supremacy. \n\nWhile American Jews (I can’t speak to Jewish populations elsewhere) have largely assimilated and become more secular/less religious in their day to day lives (which may account for the confusion in your original comment), making them outwardly indistinguishable from the overall Caucasian population here, those who believe in and advocate for the supremacy of the white race do not view Jews as white/Caucasian, but as a separate ethnic group, due to the fact (I believe but am not 100% sure) that Jewish identity is passed down via bloodline from mothers to their children. While modern day white supremacy largely stems from the ideology of the Third Reich, anti-semitism has well documented history that began looooong before Hitler rose to power, by which point Jewish people had become a reliable scapegoat and target for those who wanted easy answers to their society’s problems or their personal struggles (remember, Hitler rose to power in the decades after WWI, the aftermath of which had left Germany in chaos and decimated the region, to put it very simply). \n\nWhile there has always been a strong undercurrent of racism and bigotry in America, in the decades since the civil rights movement, white supremacists and their ilk have been slowly shunned and forced underground as our society became more diverse and previously repressed minorities started to exercise their rights and make their voices heard, culminating in the election of our first black president. Then Trump came along and stoked the ever simmering racial tension in the US for political gain, thus legitimizing white supremacists, giving them a voice and a platform, and empowering them to come out of the shadows, although the groundwork for this resurgence was laid prior to Trump announcing his candidacy. So if you’ve been seeing the idea that a “white genocide” is occurring mentioned more frequently, that’s probably why, imo. Also, to be clear, this is not unique to the US. Europe is also seeing a resurgence of “nationalism” in response to the arrival in recent years of migrants and refugees from the Middle East and Africa. \n\nAs far as genocide in general, from a global and historical perspective, to be honest, I’m not sure I know enough to speak to that in any real depth. That being said, “genocide” generally refers to one ethnic/racial/national/religious group claiming superiority and dominance over another and systematically attempting to wipe out the opposing, “inferior” group (in contrast to a dictator like Stalin, who was pretty indiscriminate about who he threw in the gulag and was more focused on wiping out the political opposition).  Can the two groups on opposing sides of genocide both be of the same race, from a purely genetic standpoint? Yes. But it often goes deeper than mere race, in that the side committing the genocide will find some trait or context that they use to define their enemies as “other” and, therefore, justify the genocide. \n\nFor example (to provide some very basic facts), in Bosnia, which I believe is what you were referring to when you mentioned Eastern Europe, Bosnian Serbs waged a campaign of ethnic cleansing against Bosnian Muslims, although I don’t know enough about the ethnic and racial makeup of those two groups to speak to that point specifically. A better example might be the Rwandan genocide in the 1990s, in which the Hutus slaughtered the Tutsi population and an estimated 500,000-1,000,000 Rwandans were killed, the majority of them Tutsis. From a western perspective, both groups may appear to be of the same race and ethnic background, but based on the history of both the region and the two groups, and according to those involved in perpetrating the genocide, the Hutus and Tutsis were, in fact, distinct racial groups. \n\nSo, to answer your question, genocide is not always white people vs ethnic or racial minorities,  but it’s usually significantly more complicated than one race vs another, and the origins of a genocide are highly dependent on and influenced by the history of the region and the populations that live there. \n\nI hope that cleared some of this up for you. ", "score": 3, "send_replies": true, "subreddit": "AskReddit", "date_year_month": "2018-11", "created_utc_converted": "2018-11-17 17:47:14", "score_overall": 6, "words": "illuminati conspiracy jewish jewish jewish scapegoat", "shared_words": "illuminati conspiracy jewish scapegoat", "socre_distint": 4}
{"archived": false, "author": "GalaxyBejdyk", "body": "I was not reffering to genocide itself. From what I read, mainly from the historical writers on Quora I follow, the Holocaust did cause a massive depression among manny Jewish people and caused a bit of a schism in a Jewish religious identity, where a lot of them started to loose faith, which endangered Judaism as a religion. But I can be wrong, as I read this from just a few sources.\n\nI might even have them in my Bookmarks, but I can't for life of me find it as a reference.\n\nFair enoug, I am a bit guilty from not checking my sources sometimes too deeply, so this might've been the case here.\n\nYou see, when arguying with tinfoil hats, I noticed something a very strange pattern among them. They usually base their theories on the some amount of facts or realities, to have some legitimacy to this argument, that they make bullshit around to suit their agendas.\n\nTake good'ol Alex Jones, for example and his **\"GAY FROGS!!!\"** rant. He claims that goverment is affecting the water supply that turns animals and humans gay as a part of so called \"gay agenda\". He did this by misintepretating facts, that due to pollution, including hormonal pollution, in the water from our consumption causes some marine animals like fish or frogs change gender (or in case of frogs, that already can do that, you could say that it triggers it more often). Of course, being the climate change denier that he is, he cannot admit that humanity is fucking over their own enviroment, so he changes to fact around in order to hit two birds with one stone, and blame goverment and gay people for something.\n\nI've seen this pattern repeat over and over in countless other conspiracies, including some anti-semitic ones, such as the ones with Khazars, where they took a real life historical event and spun it into a conspiracy. \n\nI do admit that it is possible that I assumed that this was the case with these ideas as well, just partially checking my sources.\n\nThank you for pointing that out. I'll work on my rhetoric.", "score": 1, "send_replies": true, "subreddit": "NoStupidQuestions", "date_year_month": "2018-11", "created_utc_converted": "2018-11-17 22:26:24", "score_overall": 5, "words": "holocaust jewish jewish khazars conspiracy", "shared_words": "holocaust jewish khazars conspiracy", "socre_distint": 4}
{"archived": false, "author": "[deleted]", "body": "First, monument from 2010 not this week synagogue you liar. Next thing, tusk is the biggest shithead in our history, 90% of our debt is his job, leaving country in shitty state, everyone hates him to and he lied numerous times about lowering the taxes then lifting it up. \nhttp://www.outono.net/elentir/2018/06/26/the-truth-about-poland-and-the-holocaust/\nhttps://en.m.wikipedia.org/wiki/Collaboration_in_German-occupied_Polanda\n\nAbout 6 million Polish citizens—nearly 21.4% of Poland's population—died between 1939 and 1945 as a result of the occupation,[4][5][6] half of whom were Polish Jews. Over 90% of the death toll came through non-military losses, as most of the civilians were targeted by various deliberate actions by Germans and the Soviets.\n\nThe goal of the German state under Nazi leadership during the war was to destroy the Polish peoples and nation completely\n\nConcerning:\nthe Sheltering of Escaping Jews.\n      There is a need for a reminder, that in accordance with Paragraph 3 of the decree of 15 October 1941, on the Limitation of Residence in General Government (page 595 of the GG Register) Jews leaving the Jewish Quarter without permission will incur the death penalty.\n\n      According to this decree, those knowingly helping these Jews by providing shelter, supplying food, or selling them foodstuffs are also subject to the death penalty\n\n      This is a categorical warning to the non-Jewish population against:\n         1) Providing shelter to Jews,\n         2) Supplying them with Food,\n         3) Selling them Foodstuffs.\n\nTschenstochau, \n\nCollaboration in Poland was less institutionalized than elsewhere in Europe, and has been generally described as marginal.\n\nAt the beginning of the war German officials contacted several Polish leaders with proposals for collaboration, but they all refused\n\nYou know why poles had hardest time to help the jews? We were to be destroyed after jews, we had to give out all of the food, of a occupied Territories apart from jews we had lowest calorie prescribed, harshest occupation, nowhere to flee, soviet union was deporting people do gulag from second flank, only we had death penalty for whole family if someone even gave a jew loaf of bread.\n\nBut of course there were collaborators and to judge in what amount, at the end we must go to the cold numbers. And these are crystal clear: statistics from &gt;&gt;Israel’s War Crimes Commission indicate that less than 0.1% of ethnic Poles collaborated with the occupiers.&lt;&lt; If according to the last pre-war census, there were 24 million ethnic Poles in Poland, this means that less than 24,000 people collaborated with the Germans, whether because of greed, racial hatred, revenge, fear, etc … extreme circumstances of occupation in Poland, for almost 6 years, is a negligible figure.\nI don't know why you want so badly to poles to be perceived bad, that antisemitism for you, or you just want to be the only victim there was. \n\n\nPS due to police stats, antisemitism is decreasing in Poland. ", "score": 1, "send_replies": true, "subreddit": "Israel", "date_year_month": "2018-11", "created_utc_converted": "2018-11-19 01:30:56", "score_overall": 5, "words": "holocaust jewish jewish jew greed", "shared_words": "holocaust jewish jew greed", "socre_distint": 4}
{"archived": false, "author": "matzn17", "body": "First you talk about how people were killed and say it is a fairy tale. I do not understand why. It seems plausible to me. Humans can do horrible things to their own kind if they make subdivisions such as Jew, Communist, Homosexual,etc. They see an \"evil Jew\" not a human. Medieval and modern torture methods are the same. Secondly you talk about survivors. There are many explanations why someone would survive. Late imprisonment, killing millions also takes time, etc. Everyone of them has an individual story on how he or she survived. Maybe listen to it? \nBut then you talk about my biggest problem. The problem with every holocaust denier is this: I found sources that stated what you did, \"6 million is a meme number\". They were all non-credible blogs. The blogs cited people who are also more or less non-credible. I also red papers from credible historians, they did not deny the holocaust. In addition holocaust deniers never find one line of arguments, good to use for a gish gallop for example. In the end I don't even get why people deny the holocaust, instead of celebrating it. They are anti-semites after all. Less semites less \"global jewish conspiracy to [insert goal here]\".", "score": 1, "send_replies": true, "subreddit": "PropagandaPosters", "date_year_month": "2018-11", "created_utc_converted": "2018-11-21 16:11:02", "score_overall": 8, "words": "jew jew holocaust holocaust holocaust holocaust jewish conspiracy", "shared_words": "jew holocaust jewish conspiracy", "socre_distint": 4}
{"archived": false, "author": "WayeeCool", "body": "Remember when Putin met with Trump in Helsinki...?\n\nhttps://youtu.be/tI1dW-3rUjU (skip to 00:44)\n\nOr that in half his interviews Putin prompts the anti-Semitic Soros or Rothschild conspiracy theories?  \n\nhttps://youtu.be/Df2mD-PbQUE\n\nAlso... If anyone watched RT America or UK (or any RT network) they have been pushing Soros conspiracies and other anti semetic conspiracies for years... Pretty sure for the life of the network.  If you listen to Sputnik (the radio version of RT in the US/Europe), it's the same.\n\n\nhttps://youtu.be/spiVRC7PO1I\n\nWhat's really weird is if you do some digging, the anti-semetic Soros and Rothschild conspiracy theories can have their origins of wide spread propagation traced back to Russian sources.  And this isn't even a new tactic, The 1903 book, The Protocols of the Elders of Zion can be traced back to an \"annoymous\" author in Russia.  This is the book that can be directly linked to the wave of anti-semetism that lead to the Holocaust in the 1930s.\n\nhttps://en.m.wikipedia.org/wiki/The_Protocols_of_the_Elders_of_Zion\n\nSomething else a lot of people forget, which is relevant to Facebook today, is that American business titans like Henry Ford actively promoted this shit.  Henry Ford paid to have that Russian propaganda book, The Protocols of the Elders of Zion, translated to English and distributed 500,000 copies across the United States.\n\nAnd if you think this was a fluke, Ford also mass distrobuted to American homes \"The Dearborn Independent\", a newspaper who's articles were later packaged into a book titled \"The International Jew\".  You might think this was some fringe publication, like conspiracy websites of today, but in reality it was the Fox News it's time and was America's second most widely distrobuted newspaper with 900,000 readers.  It framed itself as not mass media but providing readers with an alternative to the MSM (mainstream media), much like Fox News today.\n\nhttps://en.m.wikipedia.org/wiki/The_Dearborn_Independent\n\nhttps://en.m.wikipedia.org/wiki/The_International_Jew\n\nBtw.  Yes, the term \"globalist\" does not have it's root in \"globalization\".  It is much older than the modern economic terminology and instead refers to the international nature of the Jewish people, aka \"the international Jew\".  How that before Israel, Jewish people were perceived as stateless and not having a native land.  Even today, anti-semites argue that Jews are still \"globalists\" (interlopers, invaders, migrants, stateless) because they migrated to Jerusalem after escaping slavery in North East Africa.  If this doesn't make sense remember that to a nationalist, an ethnic group being citizens of the world or not having a nationality... is the greatest sin.", "score": 88, "send_replies": true, "subreddit": "technology", "date_year_month": "2018-11", "created_utc_converted": "2018-11-22 11:40:03", "score_overall": 9, "words": "conspiracy conspiracy holocaust jew conspiracy globalist jewish jew jewish", "shared_words": "conspiracy holocaust jew globalist jewish", "socre_distint": 5}
{"archived": false, "author": "Avenger616", "body": "What? your already hundred-time slam-dunk debunked propaganda piece that you worship without looking at it using objective fact and publicly accessible information to cut out the tumor of the simplest of lies?\n\nIt's just 'jewish man bad\" and 'jews were the real nazi's', anti-semetic conspiracy mongering and 'gotcha' mischaracterization. Typical of a conservative boy to play at being a man.this is a fact:\n\nSoros was aged 9 at the start of WWII and 14 when it ended, i'd hardly call the holocaust and living through a sodding war to be one of the 'happiest times of my life'. You make him out to be s pyschopath with no evidence to back it up, your 'link' didn't even contain the quote\n\nQuit lying, or don't, we love watching you make an idiot of yourself.\n\nhttps://www.snopes.com/fact-check/george-soros-ss-nazi-germany/\n\nNext time you might be hit with a defamation or libel sit and those suing you might not be as forgiving.\n\nActions have consequences, spread lies= get sued into an early grave.\n\nAdmit your mistake and apologize= keep a modicum of dignity or respect.\n\nPlease make the stupid choice, we won't stop you, after all 'never interrupt your enemy when he is making a mistake' (eg, you, right now) we laugh at your pitiful smear attempt.", "score": 1, "send_replies": true, "subreddit": "worldnews", "date_year_month": "2018-11", "created_utc_converted": "2018-11-22 19:04:01", "score_overall": 4, "words": "jewish conspiracy holocaust libel", "shared_words": "jewish conspiracy holocaust libel", "socre_distint": 4}
{"archived": false, "author": "MarquisDePaid", "body": "It was Talaat Pasha, as well as Talaats good friend [Emmanuel Carasso](https://www.dailysabah.com/feature/2017/10/13/jewish-community-in-ottoman-empire)\n\n&gt;After the dethronement of Abdülhamid II, permission was given for the migration of Jews to Palestine. The most prominent financier and mentor of the Committee of Union and Progress (CUP), which seized the government in 1908, was a Jewish banker of Italian origin from Salonica, Emmanuel Carasso.\n\nThe Turkish newspaper references the [\"Ottoman balfour declaration\"](http://www.jewishpress.com/indepth/analysis/the-ottoman-balfour-declaration/2017/12/21/), signed by Talaat in 1918\n\n&gt;When Greeks, who had held a privileged status up until then, fell into disfavor after the Constantinople massacre of 1821 targetting Greeks, Jews were hoping for a second chance.\n\n&gt;However, with their art facilities scattered around Anatolia, Armenians came in first thanks to their capital surplus. As a result of the Jewish lobby's recommendations, the Young Turks government removed Armenians from Anatolia in 1915. Hence, the economy of the country was left in the hands of Jewish capital. **Carasso, who was a part of the committee that informed Abdülhamid II of his dethronement, was the closest confidant of Talat Pasha, the figure responsible for the deportation law. In fact, when Talat Pasha escaped abroad in 1918, he entrusted his entire estate to Carasso.** To take an active role in the foundation of the Ankara government, Carasso returned to his homeland before his death.\n\n\nWhats fascinating is that the Turkish piece seems to imply as if some nonexistent \"jewish conspiracy\" existed to genocide the armenians, rather than singling out the specific people involved.\n\nI don't think anyone needs to form some generalized bigotry against people of Jewish descent for the actions of a few people, and yet this idea is pushed by MSM too.\n\nTime of Israel did an article that strangely avoided any mention at all of Emmanual Carasso, bankers involved, and instead tries to scapegoat random Ottoman Jews as the perpetrators like this:\n\n\n[\"Before the Holocaust, Ottoman Jews supported the Armenian genocide’s ‘architect’\"](https://www.timesofisrael.com/before-the-holocaust-ottoman-jews-supported-the-armenian-genocides-architect/)\n\n&gt;Before the Holocaust, Ottoman Jews supported the Armenian genocide’s ‘architect’\n\n&gt;Author Hans-Lukas Kieser says a desperate Zionist press praised the empire even during the slaughter of its minority population, a murder which Israel continues to gloss over today\n\nWhile Emmanual Carasso could be considered a \"zionist sympathizer\" at most, most zionist groups had nothing to do with him. Theodore Herzl, the man who founded the term \"zionism\" in the modern context, had his proposals rejected in meetings with the Rothschilds family, yet the Rothschilds family was influential in the Balfour declaration.\n\nApparently being of Jewish background doesn't matter much when it comes to \"antisemitism\" accusations, the only thing that matters is being a powerful banker.\n\nIt's so incredible because this pisses me off, I consider Carasso a disgusting sickening person, and at the same time I'm not trying to incite some anti Jewish pogrom or something. \n\nIf Adolf Hitler had an influential Dutch banker as his mentor, and this mentor influenced his anti Jewish/Roma/Polish genocides, I have no doubt we'd hear about him and we wouldn't have to attack all Dutch people as responsible.\nAnd yet the media makes it almost impossible to differentiate the two with this narrative gatekeeping.\n\n", "score": 2, "send_replies": true, "subreddit": "armenia", "date_year_month": "2018-11", "created_utc_converted": "2018-11-22 20:25:26", "score_overall": 14, "words": "jewish jewish jewish jewish jewish conspiracy jewish scapegoat holocaust holocaust holocaust jewish jewish jewish", "shared_words": "jewish conspiracy scapegoat holocaust", "socre_distint": 4}
{"archived": false, "author": "fuckchuck69", "body": "Totally not blind hatred.\n\nhttps://en.wikipedia.org/wiki/Bobby_Fischer\n&gt;Fischer made numerous antisemitic statements and professed a general hatred for Jews since at least the early 1960s.[430][442] Jan Hein Donner wrote that at the time of Bled 1961, \"He idolized Hitler and read everything about him that he could lay his hands on. He also championed a brand of anti-semitism that could only be thought up by a mind completely cut off from reality.\"[186] \n\n&gt;From the 1980s on, Fischer's comments about Jews were a major theme in his public and private remarks.[443] He openly denied the Holocaust, and called the United States \"a farce controlled by dirty, hook-nosed, circumcised Jew bastards\".[444] Between 1999 and 2006, Fischer's primary means of communicating with the public was radio interviews. He participated in at least 34 such broadcasts, mostly with radio stations in the Philippines, but also in Hungary, Iceland, Colombia, and Russia. In 1999, he gave a radio call-in interview to a station in Budapest, Hungary, during which he described himself as the \"victim of an international Jewish conspiracy\". In another radio interview, Fischer said that it became clear to him in 1977, after reading The Secret World Government by Count Cherep-Spiridovich, that Jewish agencies were targeting him.[445] Fischer's sudden reemergence was apparently triggered when some of his belongings, which had been stored in a Pasadena, California, storage unit, were sold by the landlord, who claimed it was in response to nonpayment of rent.[446] Fischer was also upset that UBS bank had liquidated his assets and closed his account without his permission. When asked who he thought was responsible for the actions UBS had taken Fischer replied, \"There's no question that the Jew-controlled United States is behind this — that's obvious.\"[447][448]\n\n&gt;Fischer's library contained antisemitic and racist literature such as Mein Kampf, The Protocols of the Elders of Zion, and The White Man's Bible and Nature's Eternal Religion by Ben Klassen, founder of the World Church of the Creator.[449][450] A notebook written by Fischer contains sentiments such as \"12/13/99 It's time to start randomly killing Jews\".[451] Despite his views, Fischer remained on good terms with Jewish chess players.\n\n&gt;Shortly after midnight on September 12, 2001, Philippines local time (approximately four hours after the September 11, 2001 attacks in the US), Fischer was interviewed live by Pablo Mercado on the Baguio City station of the Bombo Radyo network. Fischer stated that he was happy that the airliner attacks had happened, while expressing his view on United States and Israeli foreign policy, saying \"I applaud the act. Look, nobody gets ... that the US and Israel have been slaughtering the Palestinians ... for years.\"[462][463][464][465] He also said \"The horrible behavior that the US is committing all over the world ... This just shows you, that what goes around, comes around even for the United States.\"[462][463] Fischer also referenced the movie Seven Days in May and said he hoped for a military coup d'état in the US, \"[I hope] the country will be taken over by the military—they'll close down all the synagogues, arrest all the Jews, execute hundreds of thousands of Jewish ringleaders.\"[466][467] In response to Fischer's statements about 9/11, the US Chess Federation passed a motion to cancel his right to membership in the organization.[468] Fischer's right to become a member was reinstated in 2007.[469]", "score": 2, "send_replies": true, "subreddit": "news", "date_year_month": "2018-11", "created_utc_converted": "2018-11-23 17:06:48", "score_overall": 8, "words": "holocaust jew jewish conspiracy jewish jew jewish jewish", "shared_words": "holocaust jew jewish conspiracy", "socre_distint": 4}
{"archived": false, "author": "gojaejin", "body": "&gt; People will often say that colonization was a result of white supremacy; but isn't it the opposite? Colonialists were motivated by greed and power, and used the stigmatisation of foreign populations to justify their inhumane actions. Think of it the same way Hitler raised the masses against the jewish and the gipsies before the holocaust; dehumanize and vilify a cotagory of humans for your own interest and never have anyone oppose your decision to treat them like cattle.\n\nHaving studied 20th century German history quite a bit, I have to disagree with this analogy. It seems pretty clear to me from his writings and speeches that Hitler actually believed that some Jewish/Bolshevist/anarchist conspiracy was trying to destroy civilization as he knew it. From the top leadership, at least, Naziism was sincere, i.e. it wasn't primarily Macchiavellian scapegoating in order to gain power.\n\nI don't really know enough to speak about European colonialism as a whole. You may be right that greed was usually the driver and racism the rationalization, even though at all points in history we can find what seem to be very strident, apparently sincere ideological racists.", "score": 6, "send_replies": true, "subreddit": "changemyview", "date_year_month": "2018-11", "created_utc_converted": "2018-11-24 07:43:00", "score_overall": 6, "words": "greed jewish holocaust jewish conspiracy greed", "shared_words": "greed jewish holocaust conspiracy", "socre_distint": 4}
{"archived": false, "author": "darthhayek", "body": "I'm a Trump supporter, so I'm pretty happy with the progress that our movement has made since the Bush days. I don't think you would have had a Trump without a lot of people being angry about seeing other anti-establishment candidates being smacked down or destroyed in the past. There's also the rules change in 2012 that ironically ended up helping Donald Trump in 2016 at the Republican National Convention, since they were such radically different kinds of candidates (in terms of electoral strategy).\n\nRand Paul hasn't been completely sycophantic, but I think that he's been a strong ally to the president on a lot of important issues, such as foreign policy with Russia. You have other strong libertarians in the House now such as Amash and Massie. So, I'm pretty satisfied. Ron Paul doesn't have to have had a strong legislative record to have made an impact in other ways, such as changing the culture (or the conservative movement).\n\nI don't particularly agree that Pat Buchanan is an anti-Semite or a racist. I think that the kinds of people who say that have the blood of tens of thousands of brown people on their hands, as well as thousands of young American patriots, and are responsible for taking away or limiting many of our constitutional rights, so it's hard for me to care about their opinions. \"I helped commit a genocide, but at least I'm not a *racist!*\" Buchanan has lots of Jewish colleagues that I'm aware of, such as Ron Unz or [Paul Gottfried](https://www.lewrockwell.com/1970/01/paul-gottfried/churchill-buchanan-and-the-neocons/), so he can't possibly be some kind of a vapid Jew-hater. Maybe those are just \"bad Jews\", but in that case, who's the real anti-Semites here?\n\nI don't think that Pat Buchanan or other paleocons like him are the equivalent of a man [who compares Jews to termites](https://www.newsbusters.org/blogs/techwatch/corinne-weaver/2018/10/17/farrakhan-calling-jewish-people-termites-not-twitter), but even pretending I accepted that were true, so what? I think it's still a valid question to ask why the Farrakhans of the right seem to be far more targeted and persecuted than the Farrakhans of the left. You cited earlier being worried about \"leftists thinking we are bigots\", but that is a good joke, as if there is anything you can do for leftists to stop calling us bigots. If the Jewish lobby and our alliance with Israel are really in the interests of the United States, then it is confusing why so-called \"anti-Semites\" of the right, who at least represent the traditional culture of the United States and the West and style themselves as America First, are far more persecuted and marginalized than the anti-Semites of the left, who hate the United States and everything she stands for, hates freedom, and does not even believe Israel has a right to exist because it's an apartheid state. It confuses people why the conservative, Christian white gentile, who have done such an admirable job of supporting and protecting Israel for the last 70 years, is treated as the greatest enemy *of the right* by our self-proclaimed allies, and this makes people feel taken advantage of. And why wouldn't it? That's basically being pissed on and told you should be thankful.\n\nWhen people on the right ask \"Why is our current relationship with Israel beneficial to America?\", they should be entitled to a facts-based, respectful response, not being targeted and smeared and attacked, fired from their jobs or expelled from schools, censored from social media, and called an anti-Semite or a Nazi who likes to see synagogue shootings. This isn't anti-Semitism or hatred of Jews for being Jews. These are valid, thoughtful questions, and if the relationship between conservative Jews and conservative gentiles was a healthy one, then we should be able to discuss it openly, not in the shadows. Who cares what you're afraid the left would call us. What seems unfair to a lot of people on the right is being told that we essentially have to put the interests of a foreign nation and a small minority above our own, at a time when the hatred, bigotry, and in some cases, *overt persecution* of white gentiles is [more normalized and mainstream](https://www.foxnews.com/us/new-york-public-college-offering-course-called-abolition-of-whiteness) than it ever has been in our memories. I could go into the weeds and demonstrate this at length, but it'd be easier if you just concede that anti-whiteness does exist and is a real phenomenon, since we're both conservatives. I understand that some mainstream Jewish conservatives do a decent job of shining a spotlight on this and arguing against it, such as Ben Shapiro, but on the other hand, when someone like Bill Kristol, the architect of the Iraq War, tweets that he's [extremely disappointed with his \"fellow white\" men over 55](https://twitchy.com/jacobb-38/2018/08/05/guys-its-officially-over-bill-kristol-is-not-happy-with-his-fellow-white-men-over-55/), I shouldn't have to feel like a bad person for noticing that he's a Jewish racist against white people. He should be considered the bad person for being a racist. Do you understand where I'm coming from here? You're so concerned about people like Ron Paul and Pat Buchanan being \"anti-Semites\" and \"insane conspiracy theorists\", or whatever, when in my opinion, there's a lot more nuance here surrounding these issues, and Jews need to be more willing to tolerate discussion about these issues or else there's going to be more problems. Do you think that there's any similarities between modern anti-whiteness and anti-Semitism, or is it heinous and anti-Semitic of me to even consider such comparisons?\n\nTo be clear, I'm not any kind of an Israel-hater or an anti-Semite. I think that that Israel is the greatest state in the Middle East, and I grew up with Jews on Long Island. I consider myself extraordinarily thoughtful about these issues and try to see both sides of any story. The list of things I *don't* know about Jewish power, Israeli-US relations, etc. is far greater than the list of things I do know, and I don't like to jump to conclusions and assume things that I don't have evidence for. I think I had a very philosemitic upbringing for a young white gentile in modern-day America; basically, I just considered them fellow whites with another religion than me and got along as well with them as I did with anyone of any other race and background. \n\nHowever, I feel a profound sense of betrayal when I see [the fellow white crowd](https://i.imgur.com/xsOUjpl.jpg) on Twitter, academics and Hollywood celebrities and the like who bash on *my* people all day and happen to be disproportionately. Not all Jewish people are like that and I know this for a fact; some of the most passionate advocates of the kind of views that I support have been *proud, Zionistic Jews themselves*. It's not like cooperation can't exist. However, when people tell me about how beneficial our alliance with Israel is, I wonder why Netanyahu or whatever influence networks he might have access to aren't doing more to tone down the parts of their diaspora doing and saying shit like this. It makes me feel like we're not getting enough out of our alliance in return for what we put in. I don't understand why essentially being compelled to support a foreign country or else be called a \"Nazi anti-Semite\" is evidence that we actually have a mutually beneficial relationship, rather than an abusive or a parasitic one. Look at the International Holocaust Remembrance Alliance's [\"working definition\"](https://www.holocaustremembrance.com/working-definition-antisemitism) of anti-Semitism, which has been signed into [US law](https://www.breakingisraelnews.com/110752/s-carolina-sign-anti-semitism-proviso/) in some states (such as under Nikki Haley or her Republican successor) and which Corbyn was famously [pressured](https://www.theguardian.com/news/2018/sep/05/jeremy-corbyn-labour-and-the-ihra-definition-of-antisemitism) to adopt *unconditionally, without qualifications* as Labour Party policy over this summer (Theresa May had already done so of her own initiative).\n\nCan you imagine if the Russians acted like that? Imagine if businesses which receive government contracts and universities weren't allowed support sanctions on Russia or platform anyone who did. Imagine if Russia tried to make it *literally illegal to criticize them* under European hate speech laws, which (obviously) isn't even a standard that the countries of Europe even hold *themselves* to. Allies who try to enforce loyalty at gunpoint don't sound like very good allies to me, that sounds more like conquerors.\n\n", "score": 1, "send_replies": true, "subreddit": "Conservative", "date_year_month": "2018-11", "created_utc_converted": "2018-11-24 19:50:54", "score_overall": 10, "words": "jewish jew jewish jewish jewish jewish conspiracy jewish jewish holocaust", "shared_words": "jewish jew conspiracy holocaust", "socre_distint": 4}
{"archived": false, "author": "dsal1829", "body": "Feminism and anti-feminism are two sides of the gynocentric globalist illuminati muslim-jewish conspiracy preventing you from getting laid.", "score": 26, "send_replies": true, "subreddit": "ChapoTrapHouse", "date_year_month": "2018-11", "created_utc_converted": "2018-11-26 14:55:11", "score_overall": 4, "words": "globalist illuminati jewish conspiracy", "shared_words": "globalist illuminati jewish conspiracy", "socre_distint": 4}
{"archived": false, "author": "MrRonObvious", "body": "One of the main problems is that in the Middle Ages and onwards, Jews were forbidden from owning land in most countries in Europe, and they were forbidden from joining most guilds.  \nSo if you can't become a farmer, and you can't become a tradesman, then what is left?  Merchant or Banker.   That's the only way they were allowed to make a living, so they were forced into those areas.  Obviously, over the centuries they have been doing it, they have gotten very good at it.   \nSo it stands to reason that many of them would have been elevated to the highest positions due to their work ethic and long family traditions, obviously, if your family has had a jewelry store for 500 years, when you take over, you don't want to be the \"guy who botched it up\" so there's a heavy pressure to succeed and do better than your dad did, right?\nJews were also randomly prosecuted, expelled from countries en masse for no reason, had their wealth taxed or confiscated unfairly, and numerous other indignities, for being good at what they did.  The Nazis were just the most blatant about it, but every country in Europe is anti-semetic.   Even to this day they are.   \nAnd there are dozens of reasons the non Jews use to decry their behavior, conspiracy theories, Illuminati, Tri-Lateral Commission, Bilderbergers, Rockefellers, and on and on.   If Jews really DID run the world it would be running a lot better than it does, I can guarantee you that.  \nJewish culture has evolve over the centuries to be very money focused, for these obvious reasons.  Back in the day, it was important to have a big stash of money that you could use to escape if a mob appeared outside your door in the middle of the night all carrying torches and screaming \"Kill the Jews\" so that sort of mindset still prevails to a certain degree.   It's kinda not their fault, they are a product of the hardships they have endured. ", "score": 3, "send_replies": true, "subreddit": "explainlikeimfive", "date_year_month": "2018-11", "created_utc_converted": "2018-11-26 21:03:03", "score_overall": 4, "words": "merchant conspiracy illuminati jewish", "shared_words": "merchant conspiracy illuminati jewish", "socre_distint": 4}
{"archived": false, "author": "c9joe", "body": "This is a huge tangent sorry. I just hate the comparison between these nations and Israel!\n\nRhodesia and SA is just a different thing overall. It wasn't Boer vs Bantu it was White vs Black. Racial based identity is inherently far more unfair. You can't control how you were born. On the other hand, anyone can be Jewish. I don't know if you are Jewish, but if you aren't, you could be. Is a tribe, it's multi-racial. \n\nI'm not saying there is no problem with racism between Jews and Arabs, but it exists *within* Jews too. Jews tend to often over obsesses over their \"lineage\" (Ashkenazi/European, Mizrahi/Arabic, etc.) which is honestly just a surrogate for race. Early in Israel's history, the racism was a problem. You can maybe find lots of examples of Ashkenazim being pretty racist to Mizrahim in history. But we kind of settled into our niches and it's not really very bad anymore, we get along well. \n\nNow I think Mizrahi have it easiest actually. Ashkenazi get so much hurtful racism especially from anti-Zionists, who often claim they are fake Jews or Khazars, both untrue. In many ways Ashkenazi are the biggest victims, which doesn't fit the typical narrative of white oppressor vs brown/black victim. Of course, Europe is an Ashkenazi graveyard. They were the victims of the Holocaust. Mizrahi never had the suffering that the Ashkenazi Jew had throughout history, on any level. It's very sad honestly, they are overall very benevolent and noble people, but they can never seem to catch a break.\n\nAll this rambling is kinda proving a point that Jews are kind of like a nation, and even a pretty multi-racial one. Yet we still have like a deep empathy for one another even though backgrounds can be wildly different. Also of course, since Jews are more of a \"nation\" or a \"people\" than a race, it provides a different lens to the conflict. It feels a bit less  wrong to exclude foreigners from a nation. \n\nAnd the tangent is over.\n\n", "score": 2, "send_replies": true, "subreddit": "IsraelPalestine", "date_year_month": "2018-11", "created_utc_converted": "2018-11-27 04:00:58", "score_overall": 5, "words": "jewish jewish khazars holocaust jew", "shared_words": "jewish khazars holocaust jew", "socre_distint": 4}
{"archived": false, "author": "BeBa420", "body": "yeah, i honestly dont get the history of jewish persecution by christians\n\n&amp;#x200B;\n\nthey spend all day going around killing jews, in the name of another jew (a rabbi at age 13 by all accounts), then go to church to pray to said jew..... weird AF\n\n&amp;#x200B;\n\nAlso the whole thing about blood libels. In order to get local villagers all motivated and bloodlusty theyd tell em that jews kill christian children and drink their blood (blood of any variety is not kosher and is forbidden to consume). Didnt they even once think \"well if thats part of the jewish religion that means our lord also drank blood\"???\n\nVery fucking confused by this\n\n&amp;#x200B;\n\nEDIT: alright so i got a lot of replies to this, cant see them for some reason, got notifications on my phone and when i clicked em the replies were gone. But a lot of people are telling me i know nothing of jewish christian relations for the past few thousand years. Guys PLEASE DO SOME FUCKING RESEARCH. Jews were slaughtered by christians throughout europe for hundreds of years (at the very least, could go back even further). the spanish inquisition, the expulsion from england, blood libels, countless pogroms, jews were even killed for \"desecration of the host\" (ie poking holes in fucking communion wafers, most jews back then probably wouldnt have even known what the fuck communion or wafers were, let alone why they were being burned alive), not even counting the holocaust here because, whilst some nazis may have undoubtedly been christians, im fairly certain hitler wasnt (he believed in the occult and i dont think he cared much for jesus) and the holocaust was not done in christs name (as opposed to the other atrocities that were!)\n\nSo please dont try to lecture me on how im wrong, because i fucking studied this shit, you clearly did not. And NEVER deny atrocities that have happened, it makes ya look like a complete cunt", "score": 37, "send_replies": true, "subreddit": "TwoXChromosomes", "date_year_month": "2018-11", "created_utc_converted": "2018-11-28 01:44:37", "score_overall": 8, "words": "jewish jew jew kosher jewish jewish holocaust holocaust", "shared_words": "jewish jew kosher holocaust", "socre_distint": 4}
{"archived": false, "author": "GhostofCircleKnight", "body": "A lot can be garnered from sources on Wikipedia in the references section. Essentially, in the mid 19th century, Armenians and other minorities sought to reform the Ottoman legal system since they were second class citizens who did not possess the same legal rights, security protections, economic privileges, and also obligations of Muslims. Some Ottoman officials agreed that adhering to the Islamic system of believers and 2nd class dhimmis was the reason for the Empire's decline in competitiveness when compared to Europe. Upon lobbying by said groups, efforts began to institute the Tanzimat reform of modernizing the Ottoman Empire and moving it away from its Islamic legal system, though it also shirked nationalism and sought to redefine Ottomanism, integrating minorities and being socially liberal (decriminalizing homosexuality, women's rights, etc). This was the golden age of freedom and liberty in the Ottoman empire and minorities were given a voice and a place in parliament. \n\nThe Ottoman authorities sought to redefine the policy called Ottomanism, now meant to unite all the different peoples living in Ottoman territories, \"Muslim and non-Muslim, Turkish and Greek, Armenian and Jewish, Kurd and Arab\". The policy officially began with the Edict of Gülhane of 1839, declaring equality before the law for both Muslim and non-Muslim Ottomans.\n\nHowever, this policy was not beloved by most Ottoman Turks. Many still adhered to the Islamic system and didn't want the already economically successful minorities of the Empire to be given greater rights. One such person was Abdul Hamid 2nd who deposed his brother Murad and became a tyrant who absolved the Ottoman constitution and parliament. He was beloved by Islamic conservatives, yet his anti-democratic policies only led to rebellions in the Balkans once Tanzimat fell. After a loss of territory, he decided that massacres would be the best way to prevent future rebellions and to punish those he scapegoated as responsible for the the Tanzimat reforms in the first place, most especially the Armenians. \n\nThis led to him ordering the Hamidian massacres and adding greater fuel to the fire in the Eastern provinces where unpunished Kurdish raids of Armenian villages was already commonplace. The massacres of up to 200k Armenians led these Armenian villagers to lose faith in their government, and a small % (1 to 5) began to take up arms to defend their villages from further Kurdish or Ottoman military attacks. Hamid wasn't seeking to exterminate the Armenians, however, because he still saw a place for them in his system, albeit one of utmost servitude. \n\nThe problem with Turkish denial is also it is denial of the terrible state minorities faced within the empire. It's also one of pride and greed. \n\nWhen Abdul Hamid 2 redefined Ottomanism as Islamic Orthodoxy, this also provoked reactions from more 'moderate' figures, who seeking to regain power lost when parliament was absolved, eventually overthrew Hamid. This is the group, the Committee of Union and Progress, which was heralded by Armenians and others as the saviors who would bring about a new parliament and a potential new Tanzimat. But the reality is these guys were one (but not the only) group of Turkish nationalists who sought to modernize the country in such a way that Tanzimat is not reinstated and Ottoman from so forth becomes associated with Turkishness and solely Turkishness, not necessarily Islam (which they saw as a tool to control the masses. It is also why the head shiek of the OE opposed the genocide to little avail). \n\nArmenian political leaders (pre-April 24) tried to make deals with the new authorities to reinstitute the freedoms Tanzimat once gave them, but the CUP was unwilling to make those concessions, fearing giving power to minorities would lead to an eventual breakup of their empire (not realizing the loss of the Balkans was Abdul Hamid's fault, not Tanzimat's). However, the CUP didn't know how to deal with the Armenian question... and following losses in winter of 1914, early 1915 where Eastern Armenians recruited into Russia's army helped play a role in Russian victories, the CUP decided to scapegoat all Ottoman Armenians, alongside Ottoman Assyrians and Anatolian Greeks, and begin a system of massacre, property confiscation, and deportation. Once Talaat decided that a few Ottoman governors (Aleppo) had been too easy on the Armenian deportee/prisoners, a change in administrative leadership was authorized. It became okay to kill all the women and children in the concentration camps via death marches, and at that point it became a genocide because there was no hope for return of the survivors whereas before it was very slim.   \n\nFor the Holocaust, Germany adopted the deportation train, minorities in labor camp where they'd be shot upon completion, and concentration camp model, except making it more mechanical and efficient, harder to escape from. Though the end result was the same, with over half of Armenians, Greeks, Assyrians dying in one, and Jews and Romani in the other.\n\nPre-1915 is important, because the CUP were well aware of how to expand what was done during the Hamidian massacres. \n", "score": 8, "send_replies": true, "subreddit": "armenia", "date_year_month": "2018-11", "created_utc_converted": "2018-11-28 06:06:39", "score_overall": 4, "words": "jewish greed scapegoat holocaust", "shared_words": "jewish greed scapegoat holocaust", "socre_distint": 4}
{"archived": false, "author": "vegatr0n", "body": "The serious answer is that there's a massive right-wing propaganda machine that churns out BS to create the false narrative that guns aren't a problem in the US. Some of that BS takes the form of racialized coverage of violence on, say, Fox News - where you focus only on violence committed by certain groups of people in order to give the impression that only those groups commit violence, and that they do it for reasons unrelated to easy access to guns. \n\nOther BS takes the form of Alex Jones and other wingnuts claiming shocking acts of violence not only aren't a problem, they didn't even happen in the first place. The explanations for how everyone else has been duped are generally deeply anti-semitic, as this is part of a long history of believing in an international Jewish conspiracy to run the world (this is what the term \"globalist\" is a dogwhistle for: Jew).", "score": 1, "send_replies": true, "subreddit": "AskReddit", "date_year_month": "2018-11", "created_utc_converted": "2018-11-28 17:55:31", "score_overall": 4, "words": "jewish conspiracy globalist jew", "shared_words": "jewish conspiracy globalist jew", "socre_distint": 4}
{"archived": false, "author": "Alithinos", "body": "At the times before Hitler got to power, Germany had a huge economic crisis. Even worse than that of Greece. The most rich people at the time (and still) where the Rothschild family, that it's said they are Jews.\n\nSo Hitler came up saying that Germany's economic crisis was a result of a Jewish conspiracy led by Rothschild, who wants to take over the world. The fact that Rothschild is the most rich man in the world, and that from what they say is a Jew, is used as a justification to scapegoat Jews,  and to claim that Jews secretely rule the world.", "score": 0, "send_replies": true, "subreddit": "europe", "date_year_month": "2018-11", "created_utc_converted": "2018-11-29 10:22:31", "score_overall": 4, "words": "jewish conspiracy jew scapegoat", "shared_words": "jewish conspiracy jew scapegoat", "socre_distint": 4}
{"archived": false, "author": "Shadowex3", "body": "And yet perfectly in line with the ideology of the writers' movement, which basically follows one universal pattern: Start with the conclusion single thing men do is evil and wrong, work backwards from there. It's always the same.\n\nSee that's the thing, hate movements all follow the same pattern. They need the object of their hate to be terrifying but also pathetic. Members of the movement need to be genuinely fearly and hateful of the target group as a collective while still feeling superior and aggrieved enough to lash out. \n\nMen-The-Class are a terrifying evil group that brutally oppress women everywhere. Every man is schrodinger's rapist and abuser, all women need to fear all men at all times. Men control every institution. Every lost promotion, crime against any woman, financial struggle, or simple personal inconvenience or letdown is due to men colluding as part of The Patriarchy to control and oppress women. Masculinity and Males-The-Individuals however are fragile, pathetic, and weak. \n\nThe Jews are a terrifying dangerous oppressive power that all goyim must fear every moment of every day. Every Jew is out to get rip you off. They control the banks, the government, the media. Everything wrong with your life is because of a Jewish conspiracy. Jews the individuals however are weak, pathetic, and cowardly.\n\n", "score": 1, "send_replies": true, "subreddit": "AskMen", "date_year_month": "2018-11", "created_utc_converted": "2018-11-29 17:11:55", "score_overall": 4, "words": "goyim jew jewish conspiracy", "shared_words": "goyim jew jewish conspiracy", "socre_distint": 4}
{"archived": false, "author": "LeeDoverwood", "body": "&gt; the talmud is a very complex document unless you look at it from the correct angle and then it becomes simple. they wont tell you this shit because Zionism is an antisemitic atheist anti-abrahamic judaeofascist terrorist ideology whose goal is to commit crimes against humanity in the name of jews and judaism and the tribes of israel and the followers of moses, because they are the chosen people and there is power in sympathy for the suffering of the holocaust.\n\n\n\nDo you not see how you mix facts with fantasy? The Talmud came long before the holocaust of the Nazis. Yes to much of what you state but gee, the fantasy part is just crazy stuff. \n\n\n &gt;it is the responsibility of every christian to watch for false prophets and prophecy from the angle of the doctrines of Jesus Christ who instruct us to love all including ones enemies the same way Jesus did when he said \"forgive them father for they know not what they do\".\n\n\n\nTrue enough\n\n\n&gt;the state of israel is not a state.\n\n\nPretty sure it is but you don't show any proof for what you say. \n\n\n&gt;jews who dont follow judaism are not jews,\n\n\nIt all depends on who you consider a Jewish person. Ethnic Jewish? Jewish convert? What is Judaism? I can ask ten different people about what is Judaism and get ten different answers. You're being very general here and not paying attention to detail. My opinion is that a person can be an ethnic Jew such as Soros and Karl Marx and not be a believer in biblical Judaism. What is Judaism? Does the Talmud represent biblical Judaism? It certainly represents modern Orthodox Judaism. Ultra Orthodox I guess so. Reformist Jew? Conservative Jew? \n\n\n\n&gt; the proper interpretation of the talmud is that a) it is not holy biblical scripture in the form of the word of god or something like that.\n\n\nAnd that's all I need to know. I don't need to read it to get that. Jesus spoke enough about the Oral Traditions which is where the Talmud comes from. \n\n\n &gt;its just a captains log spanning many centuries and B) just because something is in the talmud doesnt mean you should do it. for example imagine hypothetically if in the times of nazi germany the jews would have to refer to the talmud for guidance on propaganda to protect themselves it would be understandable. but it wouldnot be understandable for them to do that when there is nothing wrong. a recipe for a bomb in your documentation doesnt mean you have to make bombs and use them. the talmud is a buffet that includes dangerous weaponized secret knowledge of multiple generations of rabbi. some jews however are not hip to all of this and they just want to murder all the goyim (thats you and me)\n\n\nFair enough. The problem with most modern Judaism is that most Jewish people just don't understand this. Goyim is a horrible concept that conflicts with biblical Judaism. \n\n", "score": 1, "send_replies": true, "subreddit": "freeworldnews", "date_year_month": "2018-11", "created_utc_converted": "2018-11-30 01:21:10", "score_overall": 11, "words": "holocaust holocaust jewish jewish jewish jew jew jew goyim jewish goyim", "shared_words": "holocaust jewish jew goyim", "socre_distint": 4}
{"archived": false, "author": "poshpotdllr", "body": "&gt;Do you not see how you mix facts with fantasy? The Talmud came long before the holocaust of the Nazis. Yes to much of what you state but gee, the fantasy part is just crazy stuff.\n\n\ni dont see why you just said all that? what did i mix? i never made the claim that zionism predated the talmud. i said the jews today wont tell you about the talmud today because of zionism today. \n\n&gt;Pretty sure it is but you don't show any proof for what you say.\n\nthe reason why israel is a state is because of the following:\n\n1- where are the borders of israel? there are none. even israel cant tell you where they are. nobody can because it would destroy decades of bullshit zionist reasoning and undo all of their propaganda. the borders of israel are effectively wherever the idf murders palestinian children. idf goes into some area, kills everybody, says it was because thy got too close to the new border they just made up 10 minutes ago, and then they build a settlement there. this is the greatest cause of tension between the united states and israel for the past 40 years.\n\n2- what is israel? is it a democracy? then what about the arabs? if most of the arabs arent israeli, then where are the borders of palestine? why do jews who have never been there being given the right of return while refugees who were expelled by zionists cant return to the homes their families had for over a thousand years? is israel an ethnostate? if it is then was the forced expulsion of palestinians from their homes ethnic cleansing? is israel a theocracy? then why cant all jewish converts be counted as jews? \n\nisrael cannot be a state because israel is a shape-shifting propaganda operation that cant get its story straight. israel will be a state when ALL major world powers  and its neighbors recognize it. iran, syria, lebanon, iraq, turkey, and pakistan see israel as a terrorist piracy operation. man they really fucked up with turkey they had that one in the bag.\n\n&gt;It all depends on who you consider a Jewish person. Ethnic Jewish? Jewish convert? What is Judaism? I can ask ten different people about what is Judaism and get ten different answers. You're being very general here and not paying attention to detail. My opinion is that a person can be an ethnic Jew such as Soros and Karl Marx and not be a believer in biblical Judaism.What is Judaism? Does the Talmud represent biblical Judaism? It certainly represents modern Orthodox Judaism. Ultra Orthodox I guess so. Reformist Jew? Conservative Jew?\n\ni am being very consistent. here is what i believe about judaism and if you watch this and reread what i wrote youlll see i dont contradict myself unless im mixing in some zionist language for the sake of context or because i just made an error. \n\nhttps://www.youtube.com/watch?v=NcjO2nNz09k\n\n\n\n&gt;And that's all I need to know. I don't need to read it to get that. Jesus spoke enough about the Oral Traditions which is where the Talmud comes from.\n\nBINGO\n\n&gt;Fair enough. The problem with most modern Judaism is that most Jewish people just don't understand this. Goyim is a horrible concept that conflicts with biblical Judaism.\n\nzionism and israel is anti semitic and anti-abrahamic and it needs to commit crimes against humanity in the name of jews and judaism so we attack the wrong people in retaliation, and the best way to do that is to convince jews that the talmud tells them to do blood rituals on goyim babies. that way jews play along.", "score": 0, "send_replies": true, "subreddit": "freeworldnews", "date_year_month": "2018-11", "created_utc_converted": "2018-11-30 11:17:28", "score_overall": 11, "words": "holocaust jewish jewish jewish jewish jew jew jew jewish goyim goyim", "shared_words": "holocaust jewish jew goyim", "socre_distint": 4}
{"archived": false, "author": "ValueBasedPugs", "body": "Obscene victim blaming here. It's not Ukraine's fault that Russia illegally annexed Crimea. It's not Ukraine's fault that Russia is illegally interfering with international law again to prevent free navigation through the Kerch Strait.\n\nAnd honestly, I'm not interested in the flood of articles trying to prove Russian propaganda talking points, this article from Unz being one of the most obvious and pathetic of the various attempts I've seen on this subreddit.\n\nSide bar:\n\n&gt; The Unz Review is an alt-right website ....[2] It contains articles and content that promote white nationalism, the international Jewish conspiracy, Holocaust denial, the white genocide conspiracy theory, racialism pseudoscience and eugenics.\n\nIt's also *obviously* linked with the Russia propaganda network. In example, the Unz review article \"It's Time to Drop the Jew Taboo\" written by Charles Bausman was originally published in Russia Insider. They also deny the Holocaust on occasion. Fuck me for not respecting the dialogue under one of their articles, right? On the other hand, if this is representative of non \"Main Stream Media\" articles, maybe you need to get into main stream media, because this sucks. And your poor choice of media consumption speaks volumes about your character ... not in a good way.\n\nMaybe even more than this, I'm not interested in hearing a new variation on Russian propaganda talking point that Ukraine is at fault for Russia's imperialistic aggression. It just isn't.", "score": 14, "send_replies": true, "subreddit": "geopolitics", "date_year_month": "2018-11", "created_utc_converted": "2018-11-30 21:37:31", "score_overall": 6, "words": "jewish conspiracy holocaust conspiracy jew holocaust", "shared_words": "jewish conspiracy holocaust jew", "socre_distint": 4}
{"archived": false, "author": "gmsteel", "body": "The definition from the IRHA has eleven points\n\n1. ***Calling for, aiding, or justifying the killing or harming of Jews in the name of a radical ideology or an extremist view of religion.***\n2. ***Making mendacious, dehumanising, demonising, or stereotypical allegations about Jews as such or the power of Jews as collective — such as, especially but not exclusively, the myth about a world Jewish conspiracy or of Jews controlling the media, economy, government or other societal institutions.***\n3. ***Accusing Jews as a people of being responsible for real or imagined wrongdoing committed by a single Jewish person or group, or even for acts committed by non-Jews.***\n4. ***Denying the fact, scope, mechanisms (e.g. gas chambers) or intentionality of the genocide of the Jewish people at the hands of National Socialist Germany and its supporters and accomplices during World War II (the Holocaust).***\n5. ***Accusing the Jews as a people, or Israel as a state, of inventing or exaggerating the Holocaust.***\n6. ***Accusing Jewish citizens of being more loyal to Israel, or to the alleged priorities of Jews worldwide, than to the interests of their own nations.***\n7. ***Denying the Jewish people their right to self-determination, e.g., by claiming that the existence of a State of Israel is a racist endeavor.***\n8. ***Applying double standards by requiring of it a behavior not expected or demanded of any other democratic nation.***\n9. ***Using the symbols and images associated with classic antisemitism (e.g., claims of Jews killing Jesus or blood libel) to characterise Israel or Israelis.***\n10. ***Drawing comparisons of contemporary Israeli policy to that of the Nazis.***\n11. ***Holding Jews collectively responsible for actions of the state of Israel.***\n\nThis was what the UK labour party reluctantly adopted earlier this year, despite reservations it had about it limiting criticism of the State of Israel and its actions. ", "score": 13, "send_replies": true, "subreddit": "europe", "date_year_month": "2018-11", "created_utc_converted": "2018-11-30 22:29:49", "score_overall": 9, "words": "jewish conspiracy jewish jewish holocaust holocaust jewish jewish libel", "shared_words": "jewish conspiracy holocaust libel", "socre_distint": 4}
