{"author": "BigSnicker", "body": "I asked you to name one single historian who has said, anywhere in the globe, that the laws should be relaxed for serious academic inquiry, or merely that there are any valid unexplored questions on the subject.\n\nI know free speech laws.. you can get away with a LOT before the law gets involved.  And I mean a huge amount... you can definitely raise legitimate academic questions without being immediately thrown in jail for denialism.\n\nI told you that everyone who wants to pursue Holocaust denial, *and I mean literally everyone*, is simply looking to develop justifications for an anti-Jewish agenda, the totally normal starting point for any demagogic movement that's decided to use Jews (as opposed to Muslims, Albanians, Gypsies, Mexicans or whomever) as it's chosen minority scapegoat to rile up its hate mob.\n\nYou took this challenge and you came up with one name, Ernst Zundel, whom we both know.. but let's look him up just the same.\n\nFrom: https://en.wikipedia.org/wiki/Ernst_Z%C3%BCndel\n\n&gt; In 1977, Zündel founded a small press publishing house called Samisdat Publishers, which issued such neo-Nazi pamphlets as his co-authored **The Hitler We Loved and Why** and Richard Verrall's Did Six Million Really Die? The Truth At Last, which were both significant documents to the Holocaust denial movement. Verrall's pamphlet should not be confused with Barbara Kulaszka's book Did Six Million Really Die? Report on the Evidence in the Canadian \"False News\" Trial of Ernst Zündel, 1988. \n\nSo, you seem to have proven my point?  \n\nYou begin by being tricked into the anti-Judaism... the Holocaust denial flows from there.  It's never the reverse (e.g. **\"Hey, I'm just an average Jew loving non-historian and I've discovered something bizarre that no one is talking about\"**).  And that trick has worked for centuries (see: blood libel/protocols of the elders of zion)\n\nI assume you know about Blood Libel? https://www.bbc.com/news/world-us-canada-12176503\n\nI don't need to see the Holocaust denial literature, I'm just telling you that any serious historian has as much need to explore that as they do a faked moon landing.\n\nAgain... you can prove me wrong simply by pointing to legitimate areas of inquiry that are unresolved... which you won't be able to given the massive amount of research that has gone into the topic.\n\n&gt; Some of them are even jewish\n\nYa, Stephen Miller is Jewish and is the torch bearer of nativism.  That doesn't buy as much credibility as you might think.\n\n&gt; exonerate the Germans\n\nOh, PLEASE.  Do you realize how patronizing that is?\n\nGermany is one of the most sophisticated countries on the planet... you REALLY think a bunch of American neo-Nazis trying to push historical revisionism is being done in the interest of the GERMANS?  \n\nI can't even begin to get my brain around how someone could believe that. Any familiarity with the Germans AT ALL and you'd just instantly realize how totally incoherent it is that they'd collectively participate in some kind of perfectly executed massive plan involving the disappearance of millions of people, creation of historical records, total secrecy on the part of millions of survivors and then... oh god, I just can't.\n\nCome on.  We weren't born yesterday... that's a line they came up with for the rubes.\n\nTry some REAL reading instead: https://www.bac-lac.gc.ca/eng/holocaust/Pages/holocaust-research-guide.aspx", "score": 2, "send_replies": true, "subreddit": "metacanada", "date_year_month": "2019-06", "created_utc_converted": "2019-06-01 04:03:25", "score_overall": 13, "words": "holocaust jewish scapegoat holocaust holocaust jew libel libel holocaust jewish jewish holocaust holocaust", "shared_words": "holocaust jewish scapegoat jew libel", "socre_distint": 5}
{"author": "croxybel", "body": "A lot of people on the extreme ends of the political spectrum seem to base their worldview on century-old White Movement propaganda. It usually goes along the lines of a secret society of Jews/Imperialists that control the world and want to destroy or enslave other religions/countries. When antisemitism went out of fashion, they started using terms like the Illuminati, masonic conspiracy, new world order, globalists or just vilifying individual Jews like Soros, Murdoch, Zuckerberg, Rothschild, Bilderberg. As modern economic theories developed, they started claiming the Jews (in the form of the IMF/World Bank) control all the central banks in the world except Russia.\n\nIf you look deep enough there's all sorts of conspiracy theories linked to it. People believe Israeli Jews are actually descendants of the Mongol hoards, the Holocaust was a Jewish hoax, Communism was a Jewish hoax,\nHebrew is a fictional language. They believe capitalism, fractional reserve banking, foreign currency reserves of USD, Bretton Woods, IMF loans and a whole host of other things are all zionist conspiracies to try and take over the world. \n\nMost people lack the esoteric knowledge to understand how the use of the USD as the world's prefered reserve currency allows the Fed to expand the domestic money supply at a faster rate than other central banks, due to some of the inflation created being exported overseas. It's a complicated subject and not everybody in a democracy has years to go and learn about it. The anti-Western propaganda exploits this type of complexed nuance in a democracy to try and convince people all their problems are due to a Jewish conspiracy, imperialist conspiracy, capitalist conspiracy, globalist conspiracy or whatever they will believe. For some people it just fits with so many other conspiracies they've heard that they believe it. \n\nThe solution is always to rebel against the establishment as a means to an end. The reason the solution's always the same is because the only end-goal of the propaganda is to destabilise the west by making western societies question the political and economic processes they've established since the enlightenment.", "score": 2, "send_replies": true, "subreddit": "ukpolitics", "date_year_month": "2019-06", "created_utc_converted": "2019-06-01 13:00:11", "score_overall": 12, "words": "illuminati conspiracy conspiracy holocaust jewish jewish jewish conspiracy conspiracy conspiracy globalist conspiracy", "shared_words": "illuminati conspiracy holocaust jewish globalist", "socre_distint": 5}
{"author": "accountforfilter", "body": "&gt; I asked you to name one single historian who has said, anywhere in the globe, that the laws should be relaxed for serious academic inquiry, or merely that there are any valid unexplored questions on the subject.\n\n*I didn't mention Ernst Zundel in the context of a historian*, but as an example that Holocaust denial/revisionism is criminalized. **Any material of a revisionist nature is illegal in Canada.**   \n\n&gt;I know free speech laws.. you can get away with a LOT before the law gets involved. And I mean a huge amount... you can definitely raise legitimate academic questions without being immediately thrown in jail for denialism.    \n  \nNo you really can't that's why essentially nobody does it. Even if you were to raise such questions openly good luck explaining to zealots that your research is academic in nature. You would suffer massive reputational damage as they instantly label you a Nazi without ever reading your thesis and slander you to every media outlet that will listen, then they hound your employer till you are fired. Nobody would ever read your book because it would be banned by every major seller, no libraries would carry it. You don't seem to have a very good grasp of how social people are. People are more social than they are rational.   \n\n&gt;I told you that everyone who wants to pursue Holocaust denial, and I mean literally everyone, is simply looking to develop justifications for an anti-Jewish agenda   \n    \nYes that's what you said. There are people who have an academic, non-antisemitic interest in a correct understanding of history, who believe in a totally rational manner that events did not occur as is popularly believed. These people present their findings in a  compelling rational manner that any one with an open rational mind could be convinced by. It's not conspiracy theory tier tripe in other words.        \n\nSo there's no need to harp on Ernst Zundel as I didn't float his name as a historian, and you know I didn't, so it's *very disingenuous bad faith argument to use him as \"proof\" there is no one with a scholarly interest in these events*.    \n\n&gt;I assume you know about Blood Libel? https://www.bbc.com/news/world-us-canada-12176503    \n   \nYes. Assuming Jews are intrinsically bad and do bad things unless their behaviour is controlled is pretty bad, it's a bit like assuming that all white people are racist and intrinsically evil and unless their speech and thoughts are policed and they aren't allowed to read illegal books they'll become evil. It's a bit like calling white people Nazi's here in Canada when they aren't Nazis. It's a bit like blood libel isn't it?   \n\n&gt;I don't need to see the Holocaust denial literature, I'm just telling you that any serious historian has as much need to explore that as they do a faked moon landing.      \n   \nYou don't have an open mind about this subject, nor I suspect, many subjects at all. There's no reason for you to read it because expressing an opinion counter to the orthodox one has zero benefits and carries significant risk. It's a bit like being an atheist in the early 20th century, something you would have to keep to yourself almost.\n\n&gt;Germany is one of the most sophisticated countries on the planet... you REALLY think a bunch of American neo-Nazis trying to push historical revisionism is being done in the interest of the GERMANS?    \n  \nAgain, a simplistic smear, not everyone who disagrees with the known events of the holocaust is a neo-Nazi or a nazi of any kind or necessarily has any kind of anti-semitic feelings. Here we can see that YOU have these same attitudes, I'm not even showing you the literature and describing the ideas (which would clearly be a waste of time) and at this point **YOU won't even accept the mere possibility that somebody could dispute the official events and also not be fundamentally evil.**", "score": 0, "send_replies": true, "subreddit": "metacanada", "date_year_month": "2019-06", "created_utc_converted": "2019-06-01 13:15:47", "score_overall": 8, "words": "holocaust holocaust jewish conspiracy libel libel holocaust holocaust", "shared_words": "holocaust jewish conspiracy libel", "socre_distint": 4}
{"author": "feanor0815", "body": "TIL that ALL Jews were sent to Siberia... must have missed that... have you any sources for that? (and again even if that were true, the Nazis were still worse, but thankfully the Russians didn't send all Jews to camps, not even close...) yes Jews weer persecuted under Stalin like millions others as well he was a paranoid psychopath... but please admit these 3 points:\n\n1. the Jewish persecution under Stalin was not even close to the persecution under Hitler\n2. Stalin-ism is not all of communism\n3. Jews were also persecuted in many other countries through-out history, they were always a easy scapegoat, but there is literally NOTHING in the communistic litterateur that calls for a Jewish persecution, at most for the elimination of religion (not the people but the ideology) \n\n&gt; *didn't wanted to point out the jew-part over the others (like like everybody knows about the 6 millions Jews killed in the Holocaust but the about 11 million other victims aren't so well known...)*    \n&gt;  \n&gt;Fucking what? When you say things like that, it only makes you look more like an anti-Semitic douche canoe (which you actually probably are). Jews were the racial group that suffered the most during the Holocaust, and were Hitler's primary targets. \n\naccording to right-wingers I am anti-Semitic ... i don't like Israels occupation of the Palestinians lands and the continuous building of settlements against international law, i don't like the apartheid state Israel is right now and i don't like religion in general (which includes Judaism) if you believe that makes me anti-Semitic so be it, you opinion is wrong... because i don't like apartheid states in general no matter what religion the people advocating for the apartheid proclaim to have... i don't like any religion because it is ALL BULLSHIT. and fundamentalists of all religions are responsible for many of the horrors in our world, and i think countries shouldn't be allowed to break international law (which also makes me obviously anti-american, because i think their ongoing war-crimes are not OK) \n\nbut you are the perfect \"centrist\" unable to actually think for yourself... \n\nyes STALIN WAS A HORRIBLE PERSON HOW BETRAYED COMMUNISM IN MY EYES, but he was not as bad as Hitler, as a matter of fact... if you cant agree to this simple fact you are ignorant to reality, it's that simple", "score": 0, "send_replies": true, "subreddit": "enoughpetersonspam", "date_year_month": "2019-06", "created_utc_converted": "2019-06-02 15:13:00", "score_overall": 6, "words": "jewish scapegoat jewish jew holocaust holocaust", "shared_words": "jewish scapegoat jew holocaust", "socre_distint": 4}
{"author": "databody", "body": "I think it is important to include historical details that dispel myths about Jews.\n\n1) The history of diaspora from ancient times to today. The first Jews in the levant. The spread of Jews to Europe. Sephardi vs Ashkenazi. But also highlight Ethiopian Jews. There are a number of Jewish communities in Asia and theyre not simply the product of missionary work. Theres not one type of Jew. There are white, black, brown, asian etc. there is a pretty old Jewish community in India, in China, and was a sizeable one in Penang Malaysia, despite Mahathir...but he’s another story...\n\n2) Should provide some coverage of antisemitism. The Spanish Inquisition is partly responsible for our having Sephardim in many locations around the world. Many other expulsions. Pogroms are why many Ashkenazim migrated from Europe.\n\nI worry that many Asians have never heard of the Holocaust. Many of them really believe the Jews are just a super successful minority that faces little actual oppression. Thus some are fascinated and want to learn our “ways” to success or even buy lucky Jew figurines. The protocols of the elders of zion have been republished in many countries in the region. Despite the absence of Jews, there is a dangerous philosemitism based on these ideas in many parts, and a conspiracy theory laden antisemitism at its worst in many parts. All this exists despite the fact that there are “no Jews”...which isn’t a fact! So I think it is really important to cover antisemitism and the Holocaust even though it isn’t our “culture”. (Though we do call it the Shoah and have a holiday for remembering it in many of our Siddurs!)\n\n3) important to highlight again there is not one type of Jew: Hasidim, modern orthodox, reform, conservative,they all look different. Provide pictures of them, and black ethiopian jews. Google yemenite jews in their traditional attire. Show them that. Theres so many different ways of being Jewish and so many beautiful cultures of Judaism.\n\n4) historical contributions of Jews (in America for example) to civil rights movement, feminism. I think this is important to include today again to dispel stereotypes. Mention Betty Friedan for example.\n\nAlso cover this person\nhttps://www.google.com/amp/s/www.jta.org/2019/04/16/lifestyle/meet-the-korean-american-woman-who-leads-the-jewish-renewal-movement/amp", "score": 1, "send_replies": true, "subreddit": "Judaism", "date_year_month": "2019-06", "created_utc_converted": "2019-06-03 11:39:05", "score_overall": 10, "words": "jewish jew jewish holocaust jew conspiracy holocaust jew jewish jewish", "shared_words": "jewish jew holocaust conspiracy", "socre_distint": 4}
{"author": "zed1207", "body": "&gt; I know for a fact that globalism is not a universal synonym for Jew, because I use it to describe those in favour of a global political system, as opposed to a world of nation states.\n\nStraw man, again. Nobody is saying that globalist is a universal synonym for Jew, just like nobody is saying that \"Jew\" is necessarily associated with \"globalist\". I've already explained that anti-Semites use the word \"globalist\" as a dog-whistle for \"Jew\" with the associated anti-Semitic tropes around banking, shadowy control etc. \n\n&gt; Farage uses it in that sense, everyone fucking knows it, and all you're engaged in right now is a smear campaign to paint him as an anti-Semite because you disagree with his politics.\n\n\"Everyone knows it\" isn't an argument. The fact is that he's going on a far-right conspiracy nut's talk show, associating himself with the views of Alex Jones (!) and repeating anti-Semitic dog-whistles to an audience conditioned to hear them is the basis of criticism of Farage. Saying \"everyone knows\" otherwise is completely inadequate.\n\nThe idea that people need to make anything up in order to smear Farage is ludicrous. The man is a constant source of ready material. \n\nSince you missed the key point in the Atlantic, here it is: \n\n&gt; Despite the seemingly joking use of the term “globalist” by Trump and Mulvaney, many were quick to point to the word’s unseemly past as an anti-Semitic slur, embraced in alt-right circles before spreading into broader political discourse. As the Anti-Defamation League’s Jonathan Greenblatt put it, “Where the term originates from is a reference to Jewish people who are seen as having allegiances not to their countries of origin like the United States, but to some global conspiracy.” \n\nThe article then explores the background of the term in 1940s right-wing America, for example as used by Gerald Nye.\n\n&gt; He openly states: “globalist” had not yet achieved the dog-whistle status\"\n\nThis is simply mendacious. The full sentence is: Perhaps that was merely a coincidence, as “globalist” had not yet achieved the dog-whistle status that it would 75 years later.\n\nObviously it takes time for dog-whistles to become entrenched. The entire point of the article is that it now is. \n\nI see you've completely failed to respond to the ADL article. \n\n&gt; This is absolutely pathetic.\n\nAbout as convincing as \"everyone knows\".", "score": 0, "send_replies": true, "subreddit": "ukpolitics", "date_year_month": "2019-06", "created_utc_converted": "2019-06-03 11:44:34", "score_overall": 13, "words": "jew globalist jew jew globalist globalist jew conspiracy globalist jewish conspiracy globalist globalist", "shared_words": "jew globalist conspiracy jewish", "socre_distint": 4}
{"author": "croxybel", "body": "That tweet says it's related to antisemitism, not that it's the same thing. See my earlier comment for some background:\n\n&gt;A lot of people on the extreme ends of the political spectrum seem to base their worldview on century-old White Movement propaganda. It usually goes along the lines of a secret society of Jews/Imperialists that control the world and want to destroy or enslave other religions/countries. When antisemitism went out of fashion, they started using terms like the Illuminati, masonic conspiracy, new world order, globalists or just vilifying individual Jews like Soros, Murdoch, Zuckerberg, Rothschild, Bilderberg. As modern economic theories developed, they started claiming the Jews (in the form of the IMF/World Bank) control all the central banks in the world except Russia.\n\n&gt;If you look deep enough there's all sorts of conspiracy theories linked to it. People believe Israeli Jews are actually descendants of the Mongol hoards, the Holocaust was a Jewish hoax, Communism was a Jewish hoax, Hebrew is a fictional language. They believe capitalism, fractional reserve banking, foreign currency reserves of USD, Bretton Woods, IMF loans and a whole host of other things are all zionist conspiracies to try and take over the world.\n\n&gt;Most people lack the esoteric knowledge to understand how the use of the USD as the world's prefered reserve currency allows the Fed to expand the domestic money supply at a faster rate than other central banks, due to some of the inflation created being exported overseas. It's a complicated subject and not everybody in a democracy has years to go and learn about it. The anti-Western propaganda exploits this type of complexed nuance in a democracy to try and convince people all their problems are due to a Jewish conspiracy, imperialist conspiracy, capitalist conspiracy, globalist conspiracy or whatever they will believe. For some people it just fits with so many other conspiracies they've heard that they believe it.\n\n&gt;The solution is always to rebel against the establishment as a means to an end. The reason the solution's always the same is because the only end-goal of the propaganda is to destabilise the west by making western societies question the political and economic processes they've established since the enlightenment.", "score": 1, "send_replies": true, "subreddit": "ukpolitics", "date_year_month": "2019-06", "created_utc_converted": "2019-06-03 19:02:47", "score_overall": 12, "words": "illuminati conspiracy conspiracy holocaust jewish jewish jewish conspiracy conspiracy conspiracy globalist conspiracy", "shared_words": "illuminati conspiracy holocaust jewish globalist", "socre_distint": 5}
{"author": "croxybel", "body": "&gt; Because of this, and because of a broken planning system and speculative inflation, land in the UK has in recent years risen dramatically in value, from around £1trn in 1995 to over £5trn today.\n\nThis is intentionally misleading. I did the maths and it works out at 6.6% annually compounded, [the FTSE 100](https://www.schroders.com/en/uk/private-investor/insights/markets/how-reinvesting-dividends-has-affected-returns-over-25-years/) long-term average was 7.8% over roughly the same period. Contrary to the author's claims, investments in land have not \"risen dramatically in value\", they've performed worse than average.\n\n&gt;It cannot be right that a small elite exercises more influence over local neighbourhoods, or benefits from the wealth of land, than the majority of people who live on it\n\nFFS stop reading left-wing conspiracies. See my earlier comment:\n\n&gt;A lot of people on the extreme ends of the political spectrum seem to base their worldview on century-old White Movement propaganda. It usually goes along the lines of a secret society of Jews/Imperialists/elites that control the world and want to destroy or enslave other religions/countries or lower classes. When antisemitism went out of fashion, they started using terms like the Illuminati, masonic conspiracy, new world order, globalists or just vilifying individual Jews like Soros, Murdoch, Zuckerberg, Rothschild, Bilderberg. As modern economic theories developed, they started claiming the Jews (in the form of the IMF/World Bank) control all the central banks in the world except Russia.\n\n&gt;If you look deep enough there's all sorts of conspiracy theories linked to it. People believe Israeli Jews are actually descendants of the Mongol hoards, the Holocaust was a Jewish hoax, Communism was a Jewish hoax, Hebrew is a fictional language. They believe capitalism, fractional reserve banking, foreign currency reserves of USD, Bretton Woods, IMF loans and a whole host of other normal aspects of life in a developed country are all zionist/Imperialist conspiracies to try and take over the world.\n\n&gt;Most people lack the esoteric knowledge to understand how the use of the USD as the world's prefered reserve currency allows the Fed to expand the domestic money supply at a faster rate than other central banks, due to some of the inflation created being exported overseas. It's a complicated subject and not everybody in a democracy has years to go and learn about it. The anti-Western propaganda exploits this type of complexed nuance in a democracy to try and convince people all their problems are due to a Jewish conspiracy, imperialist conspiracy, capitalist conspiracy, globalist conspiracy or whatever they are prepared to believe. For some people it just fits with so many other conspiracies they've heard about that they believe it.\n\n&gt;The solution is always to rebel against the establishment as a means to an end. The reason the solution's always the same is because the only end-goal of the propaganda is to destabilise the west by making western societies question the political and economic processes they've established since the enlightenment.", "score": -12, "send_replies": true, "subreddit": "ukpolitics", "date_year_month": "2019-06", "created_utc_converted": "2019-06-04 19:40:29", "score_overall": 12, "words": "illuminati conspiracy conspiracy holocaust jewish jewish jewish conspiracy conspiracy conspiracy globalist conspiracy", "shared_words": "illuminati conspiracy holocaust jewish globalist", "socre_distint": 5}
{"author": "darthhayek", "body": "&gt; Yeah, you know... and that carries some weight because I'm not some jerky shitlord over on frenworld talking about...\n&gt; \n&gt; https://www.reddit.com/r/frenworld/comments/bw7sxl/goldberg_say_6_long_nose_died_in_unga_bunga_but/\n&gt; \n&gt; Holocaust denial. That anyone that isn't a RETARD knows is holocaust denial.\n&gt; \n&gt; And I'm not gonna sit here and act like it's FINE for them to do that and pretend that it's innocent.\n\nI'm not a Holocaust denier or any kind of a revisionist. I just don't see it's fair for representatives of Jewish organizations, like Eileen Hershenov of the ADL, to testify about how \"white genocide is a racist and antisemitic conspiracy about nonwhites exterminating the white race via outbreeding and blahblahblah\" at house committee hearings.\n\nhttps://youtu.be/hb9nprOW6NQ?t=7980\n\nIt's like, even if that *were* true, why is that even her place to *say* it on the floor of the US Congress? How about, like, \"Uh, thank you to the American people for saving my grandparents and great-grandparents from the Holocaust\"? Nativism is a very serious issue, and it's beyond clear that people like this aren't trying to address that issue with empathy or compassion, they are coming at this from a position of malice in their hearts. When they hold about hearings like this and talk about \"white nationalism\", \"online hate\", etc. in such incendiary, inflammatory language, what they are doing is *intimidating* people into silence with the threat of imminent legal action if they do not shut up. (This is the same \"Candace Owens and Dennis Prager are Nazis\" hearing, of course)\n\nIt's perfectly reasonable for any group of people to look at the protection that Jewish people get by having a strong shared identity revolving around being the survivors of great hardships and want to say, \"Huh, I want to have that for myself\", so I consider this to be a great evil. That's not antisemitism against all Jews, that's criticizing *these specific Jewish people* (and gentiles) for being incredibly shitty people.\n\nConsider the strong contrast that's provided by looking at the behavior of actual Holocaust remembrance organizations when they choose to go after *literal children* for the \"crimes\" of, say, maybe-waving-goodbye-to-their-parents-or-maybe-it-was-seig-heiling in a prom photograph or for playing \"nazi flip cup\" at a party.\n\n&gt;As the picture spread Monday on Twitter, outrage was widely registered, including from the Auschwitz Memorial account. Auschwitz was the site of a Nazi concentration and extermination camp in occupied Poland. \n\n&gt;“It is so hard to find words,” the memorial’s tweet said. “This is why every single day we work hard to educate. We need to explain what is the danger of hateful ideology rising. Auschwitz with its gas chambers was at the very end of the long process of normalizing and accommodating hatred.”\n\nhttp://archive.is/7GUSR\n\n&gt;Rabbi Abraham Cooper, associate dean at the Simon Wiesenthal Center in Los Angeles, said that the images shouldn’t be taken lightly and that all students involved should be suspended.\n\n&gt;“This is an insult to the 6 million Jews who died in the Holocaust,” Cooper said. “It’s also an insult to the many thousands of families in Southern California whose loved ones in the Greatest Generation fought, bled and died to defeat the Nazis and defeat the swastika.”\n\nhttps://thedreidel.com/nazi-beer-pong-newport-beach-area-high-schools-show-outrage/\n\nIt's like, hello, is this a responsible judgment of picking on someone your own size? Is this a fair fight? I have shown these stories to another right-wing Jew on reddit who I don't *always* get along best with, and, well, he agreed that this is an overreach too.\n\nIt just tends to strike me as sick that we still have to live in fear, 70 years later, of something that was supposed to be a point of national pride for us. This isn't Germany. This isn't Italy. This is *America.* Is it any wonder, when you've been told your entire life how brave and awesome your grandparents were for \"killing a tonna Nazis\", yet you're *treated* like one, that you want to respond by making jokes about it? It's like complaining that gay or trans* people make fun of Christians, imho.\n\nFrenWorld is gonna be what FrenWorld is because it's a CA and MDE offshoot, but if you look at the more professional activistic side of things, there are are more interesting things going on there, I think, and they are starting to handle themselves with a level of decorum that I've been waiting to see for a while. For example, David Horowitz, a Jewish conservative who needs no introduction, recently appeared on *The Patrick Coffin Show*, a podcast which also platformed E. Michael Jones twice in the last two months, a traditionalist Catholic intellectual who seems to have become beloved in paleoconservative circles, and, by the way, other mainstream figures as well, before you assume that this is some alt-right internet thing.\n\nSo, while I do try to avoid jumping down toxic rabbit holes, when I do see reasonable figures who I can respect trending in a certain direction, I feel more like I can trust their judgment.", "score": 5, "send_replies": true, "subreddit": "ShitPoliticsSays", "date_year_month": "2019-06", "created_utc_converted": "2019-06-04 23:39:11", "score_overall": 12, "words": "holocaust holocaust holocaust jewish conspiracy holocaust jewish jewish holocaust holocaust jew jewish", "shared_words": "holocaust jewish conspiracy jew", "socre_distint": 4}
{"author": "tk_woods", "body": "I am going to address the article and its unique interpretation of Israel's laws at the end. First, let me acknowledge the absurdity of having a discussion about the Israeli-Palestinian conflict on a Radiohead Subreddit.\n\n&gt; I'm not going to say that Israel is solely to blame\n\nAnd I am not saying Palestine is the only one to blame. \n\n&gt; but if you truly have no idea of how aggressively Israel's right-wing government has curtailed the rights of the non-jews living inside its borders, you ought to educate yourself more on the situation\n\nPlease don't patronize me. I am an Israeli citizen. I know very well what's going on in my country. I am quite aware of the dangers of the current right-wing coalition and I am being affected by it a lot more than you do. I have no problem admitting that there is discrimination against the Arab population in Israel just like there is discrimination against minorities in most countries.\n\n &gt;  Besides, there is plenty of media coverage on how terrible Russia, China, and SA are. Just google China human rights abuses. Just because there are other countries that abuse human rights don't make the right-wing Israeli government's policies any more palatable\n\nI didn't say that there isn't coverage against countries like Russia, China, SA, and the US(do not forget about them). I was talking about these groups like the BDS movement who single out one country and ignore the rest mainly because it is an easy scapegoat and it is easy to spread libel against it. Take Roger Waters for example. One of the biggest supporters of the BDS movement threatened Radiohead for months to cancel their concert in Israel but a week after Radiohead's performance, he had no problem performing in Russia. In my opinion the biggest human rights violator in the world right not. \n\n &gt;I am a non-zionist Jew\n\nIf you are talking about the actual Meaning of the term Zionist and not on the interpatation so many people have on that word than on a personal note it makes me really sad that there are Jews who are Anti-Zionist. Zionism is the belief for Jewish self-interpretation. It is the belief that Jews after thousands of years of persecution deserve a place they can be free of persecution and live there life without the threat of imminent doom. The Zionist movement and the state of Israel saved the lives of millions of Jews. The millions of Holocaust Survivors who had no place to go after 1945 and the almost one million Mizrahi Jews who were kicked out of Arab and Muslim lands and also and no place to go. My own parents had to flee Ukraine because it was not safe for them there anymore. That is why Hearing a Jew saying Israel should have never existed breaks my heart. \n\n&gt; disgusted by how the proto-fascist Israeli regime tries to use our religion as a rallying cry to excuse their inhuman behavior.\n\nLike I said. I am very much against the current Israeli regime but lets not involved religion into it. This is probably the biggest myth regarding the Israeli Palestinian conflict. That it is about religion it is not. It is about land. Pure and simple. Religion elements will be thrown into the conflict but at its basis, it was always about one thing. Tow groups fighting for the same land.\n\n&gt; The truth is that the proto-fascists who lead the Knesset have no incentive to create peace\n\nThe current one definitely. But I am 100% sure that the Palestinians are not interested in peace either.   \n\n&gt; They win election after election based on the fact that all the Arabs want to destroy the country and Palestinians want to overrun them\n\nWell, this is going to be tough to hear but that is true. The Palestinians are being led by two groups. Hamas who will Never, Ever, Ever give up their plans to annihilate Israel and the PA who has rejected countless of peace deals by Israel when it actually had a reasonable coalition. The things you are saying about the Israeli leadership can easily be applied to the Palestinian leadership. The biggest difference is that the Israeli leadership can be change in an election but elections are prohibited in Gaza and in the West Bank.\n\n&gt; Israel has not genuinely tried to create peace with their Arab neighbors since Rabin was assassinated by his own countrymen for being too nice to the big bad Arabs\n\n100% not true and that is the most infuriation thing you wrote. the 2000 camp David accords which were rejected by the Palestinians, Israeli disengagement from Gaza which resulted in Hamas taking over Gaza and over 15000 rockets being launched at Israeli cities, the 2008 Realignment plan which again was rejected by the Palestinians.\n\n&gt; I know my response goes far beyond the scope of your question, but once I realized you didn't even know about the quasi-apartheid policies of the Israeli government, I wanted to expand a little bit.\n\nI think this is the right time to tell you I have a degree in political science and I did my final paper on the first intifada. Again please don't patronize me by saying you know more about the conflict than I do.\n\nNow has for the article. I think the fact that your source is Al-Jazeera might give you a clue that what you are reading may not be \"objective\" or \"true\"\n\nRight to acquire, lease land\nThe first line here is that Arabs Cant buy or lease land from the JNF. They couldn't in the past when Israel was founded but the can since the 1960s. There are also tones of Arabs actually working for the JNF. some of them even do it as part of their Sherut Leumi. I do believe there is discrimination against Arabs when it comes to leasing and purchasing land from the state. Meaning it will probably take them more time to do so than Jews but there is no law which prohibits the leasing of land against Arabs.\n\nRight to residency\nThe Issue of residency in Jerusalem results in the fact that the Palestinians living there do not want to have Israeli citizenship. It is their own choice and as such they have issues regarding residence in those areas. it is sorted of like the issues with the dreamers in the US who will have problems returning to the US if they leave. \n\nRight to family life\nOK, so this one is kinda stupid. a Jewish person who was married to a Palestinian person living in the West Bank cannot reunite either. It is not a law against Arabs.\n\nRight to commemorate Nakba\nTo Israelis, the Nakba is not the tragedy of the Palestinian people being expelled to their homes but the failure of the Arabs to either kill or expel the Jews living in Israel. When the Arabs decided to attack Israel on the day of its foundation there were only two ways the war could have ended, The expulsion of the Jews or the expoltion of the Arabs. Obviously not all of the hundreds of thousands of Arabs who chose not to fight remained in Israel and became Israeli citizens. By acknowledging the Nakba you are asking Jews to mourn the fact that they were not annihilated. BTW Arabs can commemorate the Nakba as much as they want. They just can't do it with state money. \n\nNow, I think that there are laws that differentiate Arabs and Jews living in Israel. Arabs, for example, don't have to spend 3 years serving in the Army. they can start their higher education straight after Highschool. Also they have less chance of doing in colege that in the Army. Speaking of higher education several universities in Israel have Affirmative action Laws which require a certain percentage of students to be Arabs.", "score": 0, "send_replies": true, "subreddit": "radiohead", "date_year_month": "2019-06", "created_utc_converted": "2019-06-05 16:51:52", "score_overall": 7, "words": "scapegoat libel jew jewish holocaust jew jewish", "shared_words": "scapegoat libel jew jewish holocaust", "socre_distint": 5}
{"author": "CatOfGrey", "body": "No, you are fine there.  No Jew I've ever met, including those who keep kosher, would ever have an issue with this.  It's not like putting ketchup on pastrami, or butter on a bagel.  Seriously, those are actually felonies.\n\nWhat would be disrespectful is to demand the cheeseburger be prepared in a kosher kitchen, or by a kosher business.  Doing it yourself is actually respectful.  \n\nI would file this with the concept of a 'Sabbath Goy', which is a non-Jew which might perform non-kosher functions for Jewish people, like drive them somewhere which might not be necessarily appropriate *for Jews* on the Sabbath, but there is often no such restriction on non-Jews (Goys or Goyim) doing the same thing.", "score": 1, "send_replies": true, "subreddit": "NoStupidQuestions", "date_year_month": "2019-06", "created_utc_converted": "2019-06-05 21:16:44", "score_overall": 8, "words": "jew kosher kosher kosher jew kosher jewish goyim", "shared_words": "jew kosher jewish goyim", "socre_distint": 4}
{"author": "sh125itonlysmellz", "body": "You are just as bas as the people who blame us for drinking children's blood\n\nNo it is fuck all to do with criticising Israel\ndown\n\nhttps://www.thesun.co.uk/news/8809459/labour-anti-semitism-activists-jeremy-corbyn/\n\nLabour activists who blamed 9/11 on Jews and claimed Theresa May bombed Manchester are allowed to stay in party\n\nabour activist shared neo-Nazi material, is still embraced by local party - and now elected councillor A Labour activist who shared the claim “the Jews declared war on Germany in 1933” has been elected a councillor - amid confusion over whether she was even investigated over it despite numerous complaints. https://www.thejc.com/news/uk-news/labour-activist-rachel-abbott-shared-neo-nazi-material-about-how-jews-declared-war-on-germany-1.483859\n\nSadiq Khan poses with Labour councillor he called anti-Semitic over Facebook posts 'blaming Zionist Jews for 9/11' and claiming 'Israel and the US created ISIS'\n\nNational Union of Journalists investigates after board member tweets Jewish politicians don't have 'human blood' https://www.thejc.com/news/uk-news/national-union-of-journalists-looking-into-complaints-against-anti-israel-board-member-1.468260 https://www.dailymail.co.uk/news/article-6981063/Pictured-Sadiq-Khan-poses-Labour-councillor-called-anti-Semitic.html\n\nhttps://www.walesonline.co.uk/news/politics/swansea-labour-party-member-understood-16275738\n\nAlan Bull, who was selected by @uklabour as a candidate, in the full knowledge he is a Holocaust denier https://twitter.com/AntisemitismOut/status/976383308308283392 Muslim peer Lord Ahmed blames Jewish conspiracy for jailing him\n\nhttps://www.thetimes.co.uk/article/muslim-peer-lord-ahmed-blames-jewish-conspiracy-for-jailing-him-nkcxnk892wj\n\nCorbyn-supporting candidate deselected over Israel-ISIS article http://jewishnews.timesofisrael.com/corbyn-supporting-candidate-deselected-over-israel-isis-article/\n\nLABOUR REFUSES TO SAY WHAT WILL HAPPEN TO COUNCILLOR WHO POSTED CARICATURE OF HOOK-NOSED BLOODTHIRSTY JEW https://antisemitism.uk/labour-refuses-to-say-what-will-happen-to-councillor-who-posted-image-of-hook-nosed-bloodthirsty-jew/\n\n“You do know Hitler was ‘only defending’ Germany from Jews right?.Another Labour Councillor Has Been Suspended Over Alleged Anti-Semitic Comments https://www.buzzfeed.com/hannahalothman/another-labour-councillor-has-been-suspended-over-alleged?utm_term=.leAlqKma3#.lp3Gr8Vlm\n\nAysegul Gurbuz: Labour councillor suspended after praising Hitler on social media The 20-year-old called the German dictator the 'greatest man in history' on Twitte https://www.independent.co.uk/news/uk/politics/aysegul-gurbuz-labour-councillor-suspended-after-praising-hitler-on-social-media-a6977611.html\n\nIT’S THE SUPER RICH FAMILIES OF THE ZIONIST LOBBY THAT CONTROL THE WORLD”, AS COUNCIL CANDIDATE https://antisemitism.uk/labour-selects-billy-wells-who-defends-ken-livingstone-and-says-its-the-super-rich-families-of-the-zionist-lobby-that-control-the-world-as-council-candidate/ Don’t give your soul energy to the parasitical Rothschild-Zion-Jesuit-Vati-lunatic nonce controllers.\n\nAnti-Semitic row Newcastle councillor WILL stand for Labour at local elections screenshots of Mr Ahad’s Facebook page show him saying he voted against a planning application for a Marks &amp; Spencer store “on principal (sic)” – also saying the store was “directly killing innocent Palestinian people by directly funding the Zionist regime”. https://www.chroniclelive.co.uk/news/north-east-news/anti-semitic-row-newcastle-councillor-14500732.amp?__twitter_impression=true\n\nGeorge McManus was suspended in August over an alleged anti-Semitic Facebook post. In his post, Mr McManus claimed Mr Watson had \"received £50,000+ from Jewish donors\" before adding: \"At least Judas only got 30 pieces of silver\". https://www.hulldailymail.co.uk/news/hull-east-yorkshire-news/labour-party-suspension-lifted-george-2051241\n\n“There are only nine countries left in the world without a Rothschild central bank: Russia, China, Iceland, Cuba, Syria, Iran, Venezuela, North Korea and Hungary. Isn’t it funny we are always at war with these countries?” https://www.heraldscotland.com/news/16369930.scottish-labour-leader-richard-leonard-criticised-over-delayed-probe-into-allegedly-anti-semitic-post-by-councillor/\n\nFormer Mayor of Shrewsbury Cllr Ioan Gruffydd Jones, shared http://Smoloko.com a far-right/Nazi apologist/neo-fascist/white nationalist/white supremacist/anti-Semitic propaganda website on Facebook, among other unpleasant posts.\n\nhttp://jewishnews.timesofisrael.com/ilyas-aziz-readmitted/ Anti-Semitic’ Labour councillor readmitted to party\n\nIrfan Javed @UKLabour candidate in Woodfield in Stevenage. He has ranted on Facebook about “Jew propaganda” and commented: “I am just suspicious. This is what Jewish dominated western media usually does. https://order-order.com/2018/05/01/labour-candidate-ranted-jew-propaganda/\n\nJohn Clarke @UKLabour Cllr &amp; PPC in Essex, berated Jewish victims of the holocaust, saying we should have \"fought back\" &amp; the Rothschild's have \"used usury as an imperial instrument to take over the world and all of its resources, including you and I” https://antisemitism.uk/racist-labours-councillor-clarke-found-berating-holocaust-victims-for-not-fighting-back/\n\nCllr Luke Cresswell. Who was reported to @UKLabour for antisemitism &amp; rewarded with a council seat. He tweeted a blood-drenched Israeli flag, captioned “Moses must be proud of you https://www.telegraph.co.uk/politics/2018/03/29/labour-quietly-reinstated-six-councillors-posted-anti-semitic/\n\na councillor from Fife, suggested in a Facebook post that headlines critical of @UKlabour position could be the work of the Israeli security services. https://www.bbc.co.uk/news/uk-scotland-scotland-politics-45018653\n\nwant more?", "score": -3, "send_replies": true, "subreddit": "ukpolitics", "date_year_month": "2019-06", "created_utc_converted": "2019-06-05 21:49:42", "score_overall": 15, "words": "jewish holocaust jewish conspiracy jewish conspiracy jew jew jewish jew jewish jew jewish holocaust holocaust", "shared_words": "jewish holocaust conspiracy jew", "socre_distint": 4}
{"author": "sh125itonlysmellz", "body": "Oh hey. It's the guy who deleted his comment about there being no anti semeitism non the labour party. Are you ready to acknowledge there is yet?\ndown\n\nhttps://www.thesun.co.uk/news/8809459/labour-anti-semitism-activists-jeremy-corbyn/\n\nLabour activists who blamed 9/11 on Jews and claimed Theresa May bombed Manchester are allowed to stay in party\n\nabour activist shared neo-Nazi material, is still embraced by local party - and now elected councillor A Labour activist who shared the claim “the Jews declared war on Germany in 1933” has been elected a councillor - amid confusion over whether she was even investigated over it despite numerous complaints. https://www.thejc.com/news/uk-news/labour-activist-rachel-abbott-shared-neo-nazi-material-about-how-jews-declared-war-on-germany-1.483859\n\nSadiq Khan poses with Labour councillor he called anti-Semitic over Facebook posts 'blaming Zionist Jews for 9/11' and claiming 'Israel and the US created ISIS'\n\nNational Union of Journalists investigates after board member tweets Jewish politicians don't have 'human blood' https://www.thejc.com/news/uk-news/national-union-of-journalists-looking-into-complaints-against-anti-israel-board-member-1.468260 https://www.dailymail.co.uk/news/article-6981063/Pictured-Sadiq-Khan-poses-Labour-councillor-called-anti-Semitic.html\n\nhttps://www.walesonline.co.uk/news/politics/swansea-labour-party-member-understood-16275738\n\nAlan Bull, who was selected by @uklabour as a candidate, in the full knowledge he is a Holocaust denier https://twitter.com/AntisemitismOut/status/976383308308283392 Muslim peer Lord Ahmed blames Jewish conspiracy for jailing him\n\nhttps://www.thetimes.co.uk/article/muslim-peer-lord-ahmed-blames-jewish-conspiracy-for-jailing-him-nkcxnk892wj\n\nCorbyn-supporting candidate deselected over Israel-ISIS article http://jewishnews.timesofisrael.com/corbyn-supporting-candidate-deselected-over-israel-isis-article/\n\nLABOUR REFUSES TO SAY WHAT WILL HAPPEN TO COUNCILLOR WHO POSTED CARICATURE OF HOOK-NOSED BLOODTHIRSTY JEW https://antisemitism.uk/labour-refuses-to-say-what-will-happen-to-councillor-who-posted-image-of-hook-nosed-bloodthirsty-jew/\n\n“You do know Hitler was ‘only defending’ Germany from Jews right?.Another Labour Councillor Has Been Suspended Over Alleged Anti-Semitic Comments https://www.buzzfeed.com/hannahalothman/another-labour-councillor-has-been-suspended-over-alleged?utm_term=.leAlqKma3#.lp3Gr8Vlm\n\nAysegul Gurbuz: Labour councillor suspended after praising Hitler on social media The 20-year-old called the German dictator the 'greatest man in history' on Twitte https://www.independent.co.uk/news/uk/politics/aysegul-gurbuz-labour-councillor-suspended-after-praising-hitler-on-social-media-a6977611.html\n\nIT’S THE SUPER RICH FAMILIES OF THE ZIONIST LOBBY THAT CONTROL THE WORLD”, AS COUNCIL CANDIDATE https://antisemitism.uk/labour-selects-billy-wells-who-defends-ken-livingstone-and-says-its-the-super-rich-families-of-the-zionist-lobby-that-control-the-world-as-council-candidate/ Don’t give your soul energy to the parasitical Rothschild-Zion-Jesuit-Vati-lunatic nonce controllers.\n\nAnti-Semitic row Newcastle councillor WILL stand for Labour at local elections screenshots of Mr Ahad’s Facebook page show him saying he voted against a planning application for a Marks &amp; Spencer store “on principal (sic)” – also saying the store was “directly killing innocent Palestinian people by directly funding the Zionist regime”. https://www.chroniclelive.co.uk/news/north-east-news/anti-semitic-row-newcastle-councillor-14500732.amp?__twitter_impression=true\n\nGeorge McManus was suspended in August over an alleged anti-Semitic Facebook post. In his post, Mr McManus claimed Mr Watson had \"received £50,000+ from Jewish donors\" before adding: \"At least Judas only got 30 pieces of silver\". https://www.hulldailymail.co.uk/news/hull-east-yorkshire-news/labour-party-suspension-lifted-george-2051241\n\n“There are only nine countries left in the world without a Rothschild central bank: Russia, China, Iceland, Cuba, Syria, Iran, Venezuela, North Korea and Hungary. Isn’t it funny we are always at war with these countries?” https://www.heraldscotland.com/news/16369930.scottish-labour-leader-richard-leonard-criticised-over-delayed-probe-into-allegedly-anti-semitic-post-by-councillor/\n\nFormer Mayor of Shrewsbury Cllr Ioan Gruffydd Jones, shared http://Smoloko.com a far-right/Nazi apologist/neo-fascist/white nationalist/white supremacist/anti-Semitic propaganda website on Facebook, among other unpleasant posts.\n\nhttp://jewishnews.timesofisrael.com/ilyas-aziz-readmitted/ Anti-Semitic’ Labour councillor readmitted to party\n\nIrfan Javed @UKLabour candidate in Woodfield in Stevenage. He has ranted on Facebook about “Jew propaganda” and commented: “I am just suspicious. This is what Jewish dominated western media usually does. https://order-order.com/2018/05/01/labour-candidate-ranted-jew-propaganda/\n\nJohn Clarke @UKLabour Cllr &amp; PPC in Essex, berated Jewish victims of the holocaust, saying we should have \"fought back\" &amp; the Rothschild's have \"used usury as an imperial instrument to take over the world and all of its resources, including you and I” https://antisemitism.uk/racist-labours-councillor-clarke-found-berating-holocaust-victims-for-not-fighting-back/\n\nCllr Luke Cresswell. Who was reported to @UKLabour for antisemitism &amp; rewarded with a council seat. He tweeted a blood-drenched Israeli flag, captioned “Moses must be proud of you https://www.telegraph.co.uk/politics/2018/03/29/labour-quietly-reinstated-six-councillors-posted-anti-semitic/\n\na councillor from Fife, suggested in a Facebook post that headlines critical of @UKlabour position could be the work of the Israeli security services. https://www.bbc.co.uk/news/uk-scotland-scotland-politics-45018653", "score": -1, "send_replies": true, "subreddit": "ukpolitics", "date_year_month": "2019-06", "created_utc_converted": "2019-06-06 22:55:31", "score_overall": 15, "words": "jewish holocaust jewish conspiracy jewish conspiracy jew jew jewish jew jewish jew jewish holocaust holocaust", "shared_words": "jewish holocaust conspiracy jew", "socre_distint": 4}
{"author": "Tatumisgod1022", "body": "Christianity was intent on replacing Judaism by making its own particular message universal. The New Testament was seen as fulfilling the “Old” Testament (the Hebrew Bible); Christians were the new Israel, both in flesh and in spirit. The God of justice had been replaced by the God of love. Thus, some early Church Fathers taught that God had finished with the Jews, whose only purpose in history was to prepare for the arrival of his Son. According to this view, the Jews should have left the scene. Their continued survival seemed to be an act of stubborn defiance. Exile was taken as a sign of divine disfavour incurred by the Jews’ denial that Jesus was the Messiah and by their role in his crucifixion.\n\nAs Christianity spread in the first centuries CE, most Jews continued to reject that religion. As a consequence, by the 4th century, Christians tended to regard Jews as an alien people who, because of their repudiation of Christ and his church, were condemned to perpetual migration (a belief best illustrated in the legend of the Wandering Jew). When the Christian church became dominant in the Roman Empire, its leaders inspired many laws by Roman emperors designed to segregate Jews and curtail their freedoms when they appeared to threaten Christian religious domination. As a consequence, Jews were increasingly forced to the margins of European society.\n\nEnmity toward the Jews was expressed most acutely in the church’s teaching of contempt. From St. Augustine in the 4th century to Martin Luther in the 16th, some of the most eloquent and persuasive Christian theologians excoriated the Jews as rebels against God and murderers of the Lord. They were described as companions of the Devil and a race of vipers. Church liturgy, particularly the scriptural readings for the Good Friday commemoration of the Crucifixion, contributed to this enmity. Such views were finally renounced by the Roman Catholic Church decades after the Holocaust with the Vatican II declaration of Nostra aetate (Latin: “In Our Era”) in 1965, which transformed Roman Catholic teaching regarding Jews and Judaism.\n\nReligious attitudes were reflected in the economic, social, and political life of medieval Europe. In much of Europe during the Middle Ages, Jews were denied citizenship and its rights, barred from holding posts in government and the military, and excluded from membership in guilds and the professions. To be sure, some European rulers and societies, particularly during the early Middle Ages, afforded Jews a degree of tolerance and acceptance, and it would be an error to conceive of Jews as facing an unchanging and unceasing manifestation of anti-Jewish oppression throughout this period. In 1096, however, knights of the First Crusade unleashed a wave of anti-Semitic violence in France and the Holy Roman Empire, including massacres in Worms, Trier (both now in Germany), and Metz (now in France). Unfounded accusations of ritual murder and of host desecration and the blood libel—allegations of Jews’ sacrifice of Christian children at Passover to obtain blood for unleavened bread—appeared in the 12th century. The most famous example of these accusations, that of the murder of William of Norwich, occurred in England, but these accusations were revived sporadically in eastern and central Europe throughout the medieval and modern periods. In the 1930s the blood libel became part of Nazi propaganda. Another instrument of 12th-century anti-Semitism, the compulsory yellow badge that identified the wearer as a Jew, was also revived by the Nazis. The practice of segregating the Jewish populations of towns and cities into ghettos dates from the Middle Ages and lasted until the 19th and early 20th centuries in much of Europe.\n\nAs European commerce grew in the late Middle Ages, some Jews became prominent in trade, banking, and moneylending, and Jews’ economic and cultural successes tended to arouse the envy of the populace. This economic resentment, allied with traditional religious prejudice, prompted the forced expulsion of Jews from several countries and regions, including England (1290), France (14th century), Germany (1350s), Portugal (1496), Provence (1512), and the Papal States (1569). Intensifying persecution in Spain culminated in 1492 in the forced expulsion of that country’s large and long-established Jewish population. Only Jews who had converted to Christianity were allowed to remain, and those suspected of continuing to practice Judaism faced persecution in the Spanish Inquisition. As a result of these mass expulsions, the centres of Jewish life shifted from western Europe and Germany to Turkey and then to Poland and Russia.\n\nBut where they were needed, Jews were tolerated. Living as they did at the margins of society, Jews performed economic functions that were vital to trade and commerce. Because premodern Christianity did not permit moneylending for interest and because Jews generally could not own land, Jews played a vital roleas moneylenders and traders. Where they were permitted to participate in the larger society, Jews thrived. During the Middle Ages in Spain, before their expulsion in 1492, Jewish philosophers, physicians, poets, and writers were among the leaders of a rich cultural and intellectual life shared with Muslims and Christians. In collaboration with Arab scholars and thinkers in the tolerant society of Muslim Spain, they were instrumental in transmitting the intellectual heritage of the Classical world to medieval Christendom.\n\nThe idea that the Jews were evil persisted during the Protestant Reformation. Although Martin Lutherexpressed positive feelings about Jews, especially earlier in his life, and relied on Jewish scholars for his translation of the Hebrew scriptures into German, he became furious with Jews over their rejection of Jesus. “We are at fault for not slaying them,” he wrote. “Rather we allow them to live freely in our midst despite their murder, cursing, blaspheming, lying and defaming.” Such views were emphasized by the Nazis. They were renounced by the", "score": 1, "send_replies": true, "subreddit": "pics", "date_year_month": "2019-06", "created_utc_converted": "2019-06-07 01:58:16", "score_overall": 11, "words": "jew holocaust jewish libel libel jew jewish jewish jewish jewish jewish", "shared_words": "jew holocaust jewish libel", "socre_distint": 4}
{"author": "AlsoColuphid", "body": "Cool. \n\nLet's talk about the Talmud shall we?\n\nWhoever's reading this now, join me in a thought experiment. \n\nGo to your fridge and start pulling items out. Count how many have a Kosher or other Jewish compatibility symbol on the container. Now do the same for your pantry. \n\nNow consider that Jews are less than 2% of the US population and much less of the total Earth population. \n\nNow, the Talmud is essentially a manual on how to be Jewish. It teaches the core bedrock of their racial and cultural ideology. Every single Jew is raised on it and it's teachings. Note that it is not a religious text so much as a manual of doctrine. \n\nAnd yet, you cannot find a complete and unabridged version of it in English. \n\nIsn't that odd? Their presence is so pervasive in society and yet you cannot easily find a complete version of their ideological manifesto. \n\nA while back some Intrepid soul took it upon himself to find and translate a Hebrew version. Here are some interesting excerpts. \n\n&gt;*A Jew should and must make a false oath when the Goyim asks if our books contain anything against them.*\n\n(Btw Goyim is a word they use for non Jews, it's meaning is like N*gger but much worse because it implies that non Jews are not humans, but animals who should be enslaved and murdered at will)\n\n&gt;*To communicate anything to a Goy about our religious relations would be equal to the killing of all Jews, for if the Goyim knew what we teach about them, they would kill us openly.*\n\nIf that has piqued your curiosity, please, [read on.](https://rense.com/general86/talmd.htm)\n\n[Also this](https://i.imgur.com/3gbVhWB.jpg)", "score": 7, "send_replies": true, "subreddit": "MGTOW", "date_year_month": "2019-06", "created_utc_converted": "2019-06-07 13:36:25", "score_overall": 8, "words": "kosher jewish jewish jew jew goyim goyim goyim", "shared_words": "kosher jewish jew goyim", "socre_distint": 4}
{"author": "[deleted]", "body": "The point I'm trying to address is jewish power and their tendency to takeover and monopolize their control over the ruling institutions, markets and industries of their host countries by whatever means necessary in the most discreet manner possible. Evidently my comments in this post are typically long walls of text and thus deter reading.\n\n[http://prntscr.com/nz2uki](http://prntscr.com/nz2uki)\n\nThe people on here don't believe judaism is supremacist in nature, it is never suppressed; meanwhile anything that tries to oppose it is falsely labelled as \"bigoted\", \"hateful\" and \"fear mongering\". Since third-position ideologies are heavily demonized by the government, media and the deliberate decline in the overall quality of the public education system combined with the toxic aspects of the economy such as the vice industry, they tend to attract a lot of the wrong kinds of people who end up serving as useful idiots and therefore make these ideologies appear even worse than they're already portrayed by the consolidated mainstream media, government and academia.\n\nIf you ever wondered why the vice industry and cultural degeneration it causes really began to pick up stream in the 1920s, especially from the 1960s onward, is because dissolves the moral fabric of society and the cultural cohesion that holds it together; one's own pursuit of pleasure and material gain becomes their main focus, any real sense of patriotism and in-group loyalty is eroded by artificial pop culture that places hedonism on a pedestal. I'm not against people pursuing their dreams and passions, however radical individualism to the point that their own people suffer because is harmful and ends up rendering us easier to exploit.\n\nThere is a difference between being a mindless member of the crowd and being an individual while at the same time maintaining cultural cohesiveness with one's own people. Jews thrive because they form a tight cohesive group that aggressively pursues its own interests above everyone else, as is natural throughout history with any group. They've mastered the art of rhetoric and dominate the field of public relations (propaganda), any ideology that threatens the usurious grip of their banking elite is a threat to their mastery over their hosts.\n\nThe symbolic meaning of the Fasces bundle of sticks with its origins in ancient Rome come to mind – Imagine of people were sticks, a single stick is easy to break, but the Fasces bundle of sticks is much harder to snap in half. Therefore united we are stronger, divided we fall. The jewish-led establishment knows this and works to constantly sow discord and disunity between the gentiles, particularly in the Western world, whilst at the same time constantly working to strengthen the unity of the jews.\n\n“Jęws need Jęw haters to define them, so they create Antisemites” – David Cole: [https://twitter.com/Chili\\_Cannon/status/1109870114747236352](https://twitter.com/Chili_Cannon/status/1109870114747236352)\n\nA rabbi says mass immigration to the west and the mass miscegenation between Edom (Europe) and Ishmael (Arabs) fulfills an ancient \"prophecy\": [https://www.bitchute.com/video/FSYBun3Tgnyb/](https://www.bitchute.com/video/FSYBun3Tgnyb/)\n\nThe intended result of this alleged \"prophecy\" of theirs: [http://prntscr.com/nz2ztb](http://prntscr.com/nz2ztb)\n\nFrom another Rabbi: \"All Things Are Mortal But The Jew\": [https://www.bitchute.com/video/1DkOy\\_K9nos/](https://www.bitchute.com/video/1DkOy_K9nos/)\n\n\\[This Rabbi does indeed make an interesting point as to why the Jews  are still around... the 109 expulsions were just really that. Pogroms  were minor in the grand scheme of things, and we all know about the  Holocaust...On another note, we must point out his hypocrisy. While he and his ilk advocate for \"unity of their people\", they in turn advocate for \"diversity is our strength\" for the Goyim. Isn't that racism, Rabbi Glick?\n\n\\#Hypocrisy #Racism #Supremacy\\]", "score": 1, "send_replies": true, "subreddit": "JordanPeterson", "date_year_month": "2019-06", "created_utc_converted": "2019-06-08 00:35:26", "score_overall": 5, "words": "jewish jewish jew holocaust goyim", "shared_words": "jewish jew holocaust goyim", "socre_distint": 4}
{"author": "RowanBerryFairy", "body": "He wasn’t sent to a death camp because he wasn’t Jewish, the Nazis needed the labour and being a Slav was better than being an ethnic Jew in the eyes of a racist. My great aunt was raped, my grandfather had to eat rats to survive - Jewish prisoners in different camps were obviously treated much differently and outright killed. \n\nHe was punished for giving his rations to his mom and young brother by having to carry his father’s body to the crematorium. \n\nYou are clearly either a soulless troll or a plant if you genuinely don’t believe the holocaust happened at all. Do you seriously think there’s this mass conspiracy just because a woman faked her family history? People fake being black, being rich, being white, anything but what they actually are - this doesn’t point to a conspiracy, it just means some people are desperate for attention/money/pity. \n\nHere’s the real conspiracy: in the west there is so much emphasis placed on the holocaust and Hitler because the USA got to play the hero even though they initially didn’t care if Hitler was rounding up Jewish and disabled people, or those in the backwood Balkans. It’s the only war Americans and Canadians feel morally justified about, even though American foreign policy has killed countless innocent people themselves.", "score": 1, "send_replies": true, "subreddit": "conspiracy", "date_year_month": "2019-06", "created_utc_converted": "2019-06-10 13:26:43", "score_overall": 9, "words": "jewish jew jewish holocaust conspiracy conspiracy conspiracy holocaust jewish", "shared_words": "jewish jew holocaust conspiracy", "socre_distint": 4}
{"author": "commiespaceinvader", "awarders": [], "body": "This is not a misunderstanding. This claim concerning Lukács by adherents of the anti-semitic conspiracy theory of \"cultural Marxism\" is not accidental but rather something done with utmost purpose. At the same time, it is almost hilarious how the reproduction of this claim about Lukács and the Hungarian Soviet Republic by modern day believers in the existence of \"cultural Marxism\" reveals the fascist intellectual roots of those beliefs and their underlying ideology. More on the insidious shit that is the \"cultural marxism\" conspiracy theory more [here](https://www.reddit.com/r/AskHistorians/comments/5gm75q/where_did_the_frankfurt_school_cultural_marxism/) and [here](https://www.reddit.com/r/AskHistorians/comments/4ivbfo/were_the_original_members_of_the_frankfurt_school/) by /u/kieslowskifan and myself.\n\nFirst: György Lukács, also known as George Lukács. Lukács is generally best known as a prominent Marxist philosopher, literary historian and theorist of aesthetics. Especially his early theoretical works are his best known for it was them that were taken up by his contemporaries Theordor Adorno and May Horkheimer in their development of what would eventually become the Frankfurt School as well as by other philosophers who would develop what is known – in my opinion somewhat wrongly named – Western Marxism. Western Marxism describes a philosophy of Marxism that developed originally after the Bolshevik Revolution of 1917 and stood in opposition to both methods and distinct form as well as socialist model advocated by the Soviets, first under Lenin and then specifically under Stalin. Lukács together with German colleague Karl Korsch and their respective works *History and Class Consciousness: Studies in Marxist Dialectics* (written by Lukács in 1923) and *Marxism and Philosophy* (published by Korsch also in 1923). Their theory, primarily, aimed at highlighting the Hegelian aspects of Marxism, stressing its dialectics, focusing on processes such as reification, and understanding Marxism as a Marxism as a critique and a self-conscious transformation of society.\n\nLukács' opposition to the Soviet model was heavily criticized in official communist circles, especially the Third Internationale. Lenin and others such as Zinovev denounced it as \"ultra leftism\" and highlighting the wrong aspects of Marx's writing. Lukács would go on to see himself forced into exile in the Soviet Union but managed to escape the Stalinist terror narrowly. He would then go on to be involved in post-war Hungary's socialist transformation though he still kept his contrarian streak as he was majorly involved in the Hungarian uprising of 1956 where an attempt by Hungarian socialist Imre Nagy to transform the Hungarian regime and open it up was crushed by Soviet tanks (something for which Lukács was celebrated – almost ironically – by American conservative commentators back then). He was then deported to Romania and for the second time in his life narrowly escaped execution. He would go on to return to Budapest, be exiled from the communist party but still work on his theoretical work until his death in 1971, though he was still openly critical of the Soviet invasion of Czechoslovakia in 1968 and openly said so.\n\nNow, Lukács early position on the failures of Bolshevik style socialism and Leninist theory can be traced back almost directly to his own involvement in the short lived Hungarian Soviet Republic in 1919. When Béla Kun and the communist party seized power in the post-war revolutionary wave, Lukács – who at the time was already an established cultural theorist who had spent hist time with Max Weber f.ex. – was People's Commissar for Education and Culture as deputy to the Commissar for Education Zsigmond Kunfi. This lasted only a short time. The Soviet Republic in Hungary lasted from 21 March to 1 August 1919 and already in May Lukács became the political commissar of the 5th Hungarian Red Army Division in the Hungarian civil war following the establishment of the Soviet Republic.\n\nIt was during this time that Lukács wrote one article in which he agitated for revolutionary violence (\"The possession of the power of the state is also a moment for the destruction of the oppressing classes. A moment, we have to use.\" – as he wrote in one article in the socialist newspaper Népszava). It was also during the time of the Republic that Lukács participated in violence. It's historically proven – and Lukács would later talk openly about it – that as political commissar he ordered six of the soldiers of his division shot – a decision that as he himself would later go on to say, he regretted and that lead him to think intensively about developing a model of Marxist revolutionary theory that was different and in opposition to the Bolshevik model he himself participated in.\n\nBut on to the meat of the question: During his two months (March-May 1919) as People's Commissar for Education and Culture Lukacs did indeed change the school curriculum (he also famously socialized classical theaters): He replaced Catholic religious education with sociology and introduced sex education in Hungarian schools for the first time. There are two sources describing in more detail what form that took: Historian Werner Jung's work on Lukács published in 1989 and sociologists Michael Löwy's George Lukács - from romanticism to Bolshevism. published in 1979.\n\nWhat they described as the content of the sex education classes introduced by Lukács is fairly tame by European standard of modern sex ed, which is rather unsurprising given that we are talking about the early 20th century here. Instead of pornography, it consisted of explaining human reproductive organs, introducing students to safe sex and talking about sex outside of the structure of human reproduction as something that people do for pleasure. Which is a far cry from pornography, \"denouncing the family\" and such things.\n\nHowever, anti-semitic, fascist, and similarly reactionary took up Lukács short lived tenure extremely early in its existance. In fact, a whole lot of propaganda against the Hungarian Soviet Republic was based on the conspiracy of Bolshevism being a Jewish conspiracy to destroy the superior white race and all it held dear. \"The Jews Kun, Rothziegel, and Lukács\" were early figures of this whole slew of anti-semitic propaganda inside and outside of Hungary and took on an almost myth-like quality in how evil they were portrayed, only really eclipsed by Lenin and Trotsky themselves. Austrian newspapers would write about one of the most famous Austrian authors of the early 20th century, Egon Erwin Kisch, only in terms of the \"Jew Kisch\" and his connections to the \"Jews Kun and Lukács\" still in 1929 and beyond so deep was the hatred for the Hungarian Soviet Republic and its proponents.\n\nNext to the various authoritarian, extreme right-wing, and fascist movements that spread this particular form of hatred, another major proponent of the \"Jewish Bolshevism\" conspiracy myth – that would later go on to become the most central foundation of Nazism – was the Catholic Church. And it was them who started early with the myth of George Lukács coming to destroy the minds of Hungarian children with pornography. The first appearance of these claims can be traced back to Catholic newspapers published with Church money during the Horthy regime in Hungary (the reactionary regime that toppled the Hungarian Soviet Republic with help from the Romanians).\n\nIt was these claims that Hungarian emigrées picked up during the post-war era and used as ammunition against the theories of Adorno and Horkheimer or Lukács himself. The claim of Lukács \"evil sex ed\" was popularized in the English-speaking world by Hungarian emigre and professor of political science at Maryland University, Victor Zitta, who in one of his works about Lukásc and his biography relied almost exclusively on official histories of the Hungarian post-war period by the Horthy regime – a regime known for its anti-Semitic and fascist policies and for its collaboration with Nazi Germany.\n\nThis was right around the time, Pat Buchanan and William S. Lind re-discrovered the old Nazi Bolshevism as a Jewish conspiracy and Cultural Bolshevism conspirarcy theories and introduced them to the American right-wing discourse. And they ate up claims like the ones made by the Horthy regime and propagated post-war by emigres like Zitta. The more Jewish intellectuals like Adorno, Horkheimer and Lukács could be made out as evil and eating children, the better for them.\n\nFrom there the myth of \"cultural marxism\" spread and the lie about Lukács pornography along with it. And so it was picked up by the European Neo-Nazi scene, the identitarians, the alt-right, and – famously – mass murder Anders Breivik who mentioned \"cultural marxism\" in his manifesto. Like \"Judeo-Bolshevism\" and \"cultural Bolshevism\" of the Nazis of old, the modern day Nazis and their reactionary allies are able to use \"cultural bolshevism\" as the scapegoat for all that they perceive as challenging to them and their racist utopia of society: The reactionary front from Breivik to Jordan Peterson, from Viktor Orban to Paul Jospeh Watson will use \"cultural marxism\" as the underlying basis for everything from feminism to post-modernism, when really it is just a dog whistle for what they really mean: anti-semitic conspirarcy theory.\n\nAnd this is why people will say, George Lukács peddled pornography to children in 1919, despite the fact that it is clearly not true and most of these people will most likely have never read anything about or by Lukács.", "score": 22, "send_replies": true, "subreddit": "AskHistorians", "date_year_month": "2019-06", "created_utc_converted": "2019-06-11 08:20:07", "score_overall": 12, "words": "conspiracy conspiracy conspiracy jewish conspiracy jew jewish conspiracy jewish conspiracy jewish scapegoat", "shared_words": "conspiracy jewish jew scapegoat", "socre_distint": 4}
{"author": "dangerbird2", "awarders": [], "body": "For starters, a big portion of the content on /r/conspiracy is outright antisemetic blood libel and Holocaust denial. I want to hear about bigfoot and aliens, not about how a reddit mod isn't a huge fan of Jewish people.", "score": 19, "send_replies": true, "subreddit": "AskReddit", "date_year_month": "2019-06", "created_utc_converted": "2019-06-11 13:03:48", "score_overall": 4, "words": "conspiracy libel holocaust jewish", "shared_words": "conspiracy libel holocaust jewish", "socre_distint": 4}
{"author": "nidarus", "awarders": [], "body": "I mean, sure. That's how racist symbolism and dog whistles work, in general.\n\nAs I mentioned in a previous comment, some people might interpret Trump's talk about Mexican rapists to be just a legitimate criticism of *some* illegal immigrants. Not even a slight against illegal immigrants as a whole, let alone Mexicans as a whole. Some claim that the liberals are nuts for not liking when Obama was described as \"eloquent\" - it's a complement after all, right?\n\nBack to the actual Star of David, what do you think about [this cartoon?](http://fathomjournal.org/wp-content/uploads/cache/2019/05/Anti-Zionist-caricature-from-the-Soviet-magazine-Krokodil-1972-800x992/3695483047.jpg) Or [this one?](https://www.tabletmag.com/wp-content/uploads/2019/06/7-Zionist-spider-at-his-work.jpg) Or [this sculpture?](https://www.tabletmag.com/wp-content/uploads/2019/06/1.jpg) Would you have any trouble believing it's from the Nazi tabloid Der Stürmer, or at least from some Russian-language Nazi version thereof? But if you read the text, you'd read that they're actually \"just\" about \"anti-Zionism\". The spider-Jew actually has \"Zionism\" written on his back. Their authors, and the Soviet regime at large, would deny that the Star of David, the hook noses, and the classic Nazi symbolism of octopuses and spiders, is anything but legitimate criticism of Israel. The same goes for when they denied the holocaust (either by minimizing the Jewish casualties, or claiming it was a Zionist plot all along), or when they revived classic antisemitic myths like the Jews controlling the media, the banks and the Western governments. The moment it's in the service of \"anti-Zionism\", all antisemitism suddenly became kosher.\n\nAnd on the other side of the map, actual Neo-Nazis revel in this ambiguity to this day. \"Zionist\" as a code word for \"Jew\" or \"Jew-lover\" existed in the American Neo-Nazi parlance since at least the 1970's, and the idea of the [Zionist Occupation Government](https://en.wikipedia.org/wiki/Zionist_Occupation_Government_conspiracy_theory). This leads to weird shows of \"bipartisanship\" like David Duke [gushing praise of Ilhan Omar](https://twitter.com/drdavidduke/status/1103710728064847877?lang=en) and defence of [Marc Lamont Hill.](https://twitter.com/drdavidduke/status/1068647480320057345?lang=en)", "score": 6, "send_replies": true, "subreddit": "worldnews", "date_year_month": "2019-06", "created_utc_converted": "2019-06-11 17:34:10", "score_overall": 6, "words": "jew holocaust jewish kosher jew jew", "shared_words": "jew holocaust jewish kosher", "socre_distint": 4}
{"author": "Morgolol", "awarders": [], "body": "No no. That seems completely off. The bibles various chapters(Inuding many, _many_ that the various popes and kings removed or heavily edited to fit the political narrative of the times) were written anywhere from 800 BC to 300AD or somesuch.\n\nhttps://www.biblegateway.com/blog/2016/02/when-was-each-book-of-the-bible-written/\nhttps://en.m.wikipedia.org/wiki/Dating_the_Bible\n\nPick whoever. But again, even the oldest estimated puts the first Bible chapters at possibly 2700bc. Considering the Greeks(and therefore romans) and Egyptians knew the earth was round. I think the general consensus wasn't about whether it was round or flat(except for a few way out there loons that were hard to disprove) but whether or not the sun rotated around the earth or not, which was the central Christian issue and why Galileo got into shit. That whole issue around heliocentrism is also something you'll see crop up a lot among conspiracy theorists(illuminati or globalist, read: jew, and other bullshit).\n\nAlso also, because the various disciple chapters were written so far apart from each other it explains why there's so many inconsistencies to the stories when comparing them. Who knows what's changed between 300Ad And middle ages when the kings James Bible and printing became the norm", "score": 1, "send_replies": true, "subreddit": "flatearth", "date_year_month": "2019-06", "created_utc_converted": "2019-06-13 11:15:21", "score_overall": 4, "words": "conspiracy illuminati globalist jew", "shared_words": "conspiracy illuminati globalist jew", "socre_distint": 4}
{"author": "WilyTybur", "awarders": [], "body": "You speak like you are some kind of expert talking down to the masses, like nobody else here has studied WW2 history in depth. Yet from my point of view you’ve managed to miss the forest for the trees. The Eldian = Jew parallel is destroyed because Jews don’t turn into giant man eating monsters when injected with spinal fluid. And not even gobbels would be able to sell that as a lie. \n\nSo the difference in this story is that people do have a legitimate, direct reason to fear the Eldian race that isn’t political or social, it’s far more basic than that. Nobody wants to get eaten alive. Which goes far beyond any kind of “conspiracy”.\n\nThat already deletes the premise of the entire argument but let’s keep going.\n\nFirstly, in my opinion, Marley is NOT Germany, lthey are more of a hybrid of Italy/America, it is the Eldians who are the hybrid German/Japanese in the story. Marley uses Italian names, Italian weaponry, has similar technological deficiencies like 1930s Italy and even consume a meditarranian, seafood based cruisine. Hell, they even like coffee which must be brewed even on the road. All we need is the mafia and pizza and we have the full truck load of Italian stereotypes.\n\nEldia? Advanced in science, “believed in eugenics”, royal family across the pond in Marley are Eldian, like how every royal family (even now) is german. Great at engineering (basically already made the panzerfaust with the thunder spears), German architecture, German names. They just left the Hugo boss uniforms and tiger tanks behind. So you are likely right, they are probably German.\n\nAre there Jews in this story? Not really, apart from Levi Ackermann being an almost stereotypically Jewish name. \n\nSay you took away the armbands similarity to the Armbands used by the nazis. For me, the similarities between the holocaust and this situation dissipates entirely. Yes, there is racism and camps. Not exclusive to the nazis, there was plenty of racism in 1930s Europe. Internment camps were invented by the British. Or maybe they weren’t, it could be an even older idea really.\n\nIf you studied japanese history, there are similar parallels. Or French history. Or to be frank, a lot of history. I don’t feel that this is the point of the story. The story is examining the human condition that causes all these histories to repeat and happen in the first place. So if it’s predictable and boring for you, that’s great. It means isayama’s examination of philosophy and humanity is 100% spot on.\n\nThe rest of us can appreciate how a seemingly simple story of black vs white can turn into a great philosophical dissection of what life is, while you can feel smug about “knowing more than these kneelers”. I see that as an absolute win.\n\nEdit: also timeskips are bad but it’s understandable, isayama has never had problems with sacrificing characters for plot and making up for it later on in the story.\n\nMarley in general is disorganised and a rabble. “Enemies being dumb” is a bit of a cop out, but, exploring deeper than that would again, drag out the story for the casual audience. Side stories could fill this gap.", "score": 31, "send_replies": true, "subreddit": "ShingekiNoKyojin", "date_year_month": "2019-06", "created_utc_converted": "2019-06-14 00:21:18", "score_overall": 4, "words": "jew conspiracy jewish holocaust", "shared_words": "jew conspiracy jewish holocaust", "socre_distint": 4}
{"author": "Readdeadmeatballs", "awarders": [], "body": "At the time a book called ‘Protocols of the Elders of Zion’ came that claimed that there was a giant international cabal of Jewish capitalists sabotaging countries by being sneaky. (Hint this is basically the foundation of the illuminati conspiracy theory, and why almost all right wing conspiracy theories lead back to anti-semitism). The book was total bullshit but it still spread like wildfire. Rich people used that as a scapegoat when capitalism started to fail leading up to the great depression. Better then redistributing their wealth right. Henry Ford was the main spreader of this bullshit in the US and he made his dealerships stock his antisemitic magazines. Can pretty much thank Ford for bringing Nazism to America.", "score": 4, "send_replies": true, "subreddit": "BlackPeopleTwitter", "date_year_month": "2019-06", "created_utc_converted": "2019-06-14 11:30:49", "score_overall": 5, "words": "jewish illuminati conspiracy conspiracy scapegoat", "shared_words": "jewish illuminati conspiracy scapegoat", "socre_distint": 4}
{"author": "The_Sinnermen", "awarders": [], "body": "If you're looking for a detailed answer, I think it all starts with the \"chosen people\" term.\nHumans are generally not very fond of a people that claims it is \"the chosen people\".\n\nFast forward the numerous tries at eradicating them and kicking them out of the middle east, jews started to migrate to survive.\nAgain keeping that community mindset, Jews meet up with Jews and marry Jews. Others get assimilated ofc.. \n\nBy that point it becomes very easy to design them and their practices as witchcraft, and scapegoats for any and all evil. \n\nTake away the right to own land, and you have a roaming people, \"believed\" to bring diseases. \n\nFast forward Jews starting to be in the money biz because they can't own land, and little by little you build stigmas, fear and the Jews are now rich/diseased/parasites. \n\nFast forward massacres and many Jews making real money and actually starting to reach the top of certain sectors, and all that old shit is recycled into the \"Jewish conspiracy/Jews control the world\". \n\nIsrael was supposed to be the Jew's insurance policy on top of having a home, to also have a nation that would care about Jewish people and ensure their safety, like they did with the Ethiopian Jews. (If someone starts a holocaust tomorrow, You got the Israeli army coming at least). But with politics being what they are, and blood feuds being what they are, we can see what's going on with that.", "score": 1, "send_replies": true, "subreddit": "iamatotalpieceofshit", "date_year_month": "2019-06", "created_utc_converted": "2019-06-16 13:13:08", "score_overall": 5, "words": "jewish conspiracy jew jewish holocaust", "shared_words": "jewish conspiracy jew holocaust", "socre_distint": 4}
{"author": "[deleted]", "awarders": [], "body": "Typical conspiracy-theorist talk. Of course any pushback to your conspiracy is evidence of the conspiracy itself.\n\nFor example, any jew that gets mad at Holocaust deniers? Clearly part of the jewish conspiracy. Anyone questioning that the world trade center came down via explosives? Clearly a government agent or paid by the government to protect the \"truth\". \n\nIt's the sort of defense mechanism every conspiracy theorist develops, or they would go mad over their cognitive dissonance.", "score": -10, "send_replies": true, "subreddit": "TopMindsOfReddit", "date_year_month": "2019-06", "created_utc_converted": "2019-06-16 19:04:38", "score_overall": 8, "words": "conspiracy conspiracy conspiracy jew holocaust jewish conspiracy conspiracy", "shared_words": "conspiracy jew holocaust jewish", "socre_distint": 4}
{"author": "UnpaidWhirlybirdTour", "awarders": [], "body": "Oh, he's got plenty more:  \n\n\"Zyklon Ben\" Garrison  \nBen \"One Man Klan\" Garrison  \nBen \"The Walking Holocaust\" Garrison  \nBen \"Nigger Grave Digger\" Garrison  \nBen \"Chimp Choking Champion\" Garrison  \nBen \"Gook Gutter\" Garrison  \nBen \"Six Million More\" Garrison  \nBen \"The Real Holocaust\" Garrison  \nBen \"Pull the Trigger on Every Nigger\" Garrison  \nBen \"The Man who will impale the Shemale\" Garrison  \nBen \"The Sheboon Destroyer\" Garrison  \nBen \"One Man Genocide\" Garrison  \nBen \"Kike Killing Kommando\" Garrison  \nBen \"Montana Merchant Mangler\" Garrison  \nBen \"One Man Auschwitz\" Garrison  \nBen \"The Ten Ton Terror of Tel-Aviv\" Garrison  \nBen \"The 500 pound Führer of Ferguson\" Garrison  \nBen \"The Racial Pain Hurricane\" Garrison  \nBen \"I Ain't Afraid of no ZOG\" Garrison  \nBen \"The Beast that will destroy the Middle East\" Garrison  \nBen \"Defile the Jewish Virgin\" Garrison  \nBen \"Holocauster Tycoon\" Garrison  \nBen \"Aryan Vs. Predator\" Garrison  \nBen \"Beaner Cleaner\" Garrison  \nBen \"Nuke the Spooks\" Garrison  \nBen \"Frag the Fags\" Garrison  \nBen \"The real final solution\" Garrison  \nBen \"Going Rambo on Sambo\" Garrison  \nBen \"Kebab Shishkebab\" Garrison  \nBen “Sharjah Distinction Award” Garrison  \nBen \"Three Reichs and You're Out\" Garrison  \nBen \"Master of the Aryan race\" Garrison  \nBen \"Awakening the Aryan people\" Garrison  \nBen \"Morning in White America\" Garrison  \nBen \"Securing a future for white children\" Garrison  \nBen \"Patron Saint of ethnic cleansing\" Garrison  \nBen \"Gas The Kikes, Even The Tykes\" Garrison  \nBen \"Killin' Schlomo in Slo-Mo\" Garrison  \nBen \"Kike on a Spike\" Garrison  \nBen \"If it's not white, it's not right\" Garrison  \nBen \"14/88 BLAZE IT\" Garrison  \nBen \"Slope Slicer\" Garrison  \nBen \"Aboriginal War Criminal\" Garrison  \nBen \"The Handicapper of any Rapper\" Garrison  \nBen \"Mash the Marxists\" Garrison  \nBen \"Roma in a Coma\" Garrison  \nBen \"Radical racist\" Garrison  \nBen \"having Mossad on the run\" Garrison  \nBen \"Causing hysteria in every black area\" Garrison  \nBen \"Filler of the prisons\" Garrison  \nBen \"Threw a Rock at a POC\" Garrison  \nBen \"Sending every black to Iraq\" Garrison  \nBen \"Destroyer of every Diaspora\" Garrison  \nBen \"Peeing on every Korean\" Garrison  \nBen \"Killing spics with bricks\" Garrison  \nBen \"The Meanie to the Sheeny\" Garrison  \nBen \"Let's Get this Shoah on the Road\" Garrison  \nBen \"Y'all Gonna Panic When You See This Germanic\" Garrison  \nBen \"Asians will be terrified when they see this Caucasian\" Garrison  \nBen \"Goin' Mental on the Oriental\" Garrison  \nBen \"The Divider of US and Mexico\" Garrison  \nBen \"The Jackal of Jerusalem\" Garrison  \nBen \"Drowned the Chink in the Kitchen Sink\" Garrison  \nBen \"Unloading my Nine at the Welfare Line\" Garrison  \nAdolf Hitler, Jr.  \nPez, after an incident in which he, according to Tom Metzger, \"turned some sheboon into a Pez dispenser.\" Ben doesn't like to talk about it.  \nBen \"Putting a .22 in every Jew\" Garrison  \nBen \"Making a Kite out of a Kike\" Garrison  \nBen \"Blood and Iron\" Garrison  \nBen \"Fuck the Korean, be with this European\" Garrison  \nBen \"Make every Spic into a toothpick\" Garrison  \nBen \"Drive by shooter of Compton\" Garrison  \nBen \"The Cambodian Cannibalizer\" Garrison  \nBen \"Mad Dog\" Garrison  \nBen \"Muslim Mutilator\" Garrison  \nBen \"Stabbing ice picks at Bolsheviks\" Garrison  \nBen \"The Fourth Reich\" Garrison  \nBen \"Spookbuster\" Garrison  \nBen \"The White cornea of Suburbia\" Garrison  \nBen \"Breaking the jaw of every nigger in Crenshaw\" Garrison  \nBen \"The real Zodiac Killer\" Garrison  \nBen \"Givin a stuffin to Dindu Nuffin\" Garrison  \nBen \"Aryan Assassin from America\" Garrison  \nBen \"Getting every hooked nose bastard to be plastered\" Garrison  \nBen \"Everything is going to be all white\" Garrison  \nBen \"dug a hole for every thug\" Garrison  \nBen \"Pop goes the Nigger\" Garrison  \nBen \"One Lunatic, One Iced Spic\" Garrison  \nBen \"Breakdown of the Multiculturalism\" Garrison  \nBen \"Wetting every little Aryan teen girls panties\" Garrison  \nBen \"River to the sea, Aryans will be free\" Garrison  \nBen \"Turning Emos into perfect little whites\" Garrison  \nBen \"The Canadian Cripper of the first world nations\" Garrison  \nBen \"Holocausting the Homosexuals\" Garrison  \nBen \"Unload a Mag in Every Fag\" Garrison  \nBen \"Running over illegals in El Caminos\" Garrison  \nBen \"The Sadist to the Marxist Soviets\" Garrison  \nBen \"You can run but you can't hide\" Garrison  \nBen \"Homophobic Hero\" Garrison  \nBen \"Makes niggers go into shivers\" Garrison  \nBen \"Hurting minorities from breakfast, lunch and dinner\" Garrison  \nBen \"Blowing the Lids off the Yids\" Garrison  \nBen \"Nightmare of Blacks from Ghana to Atlanta\" Garrison  \nBen \"Killing non-whites from left to Reich\" Garrison  \nBen \"The Bigger the Nigger the More he Pulls the Trigger\" Garrison  \nBen \"Huey Lewis and the Noose\" Garrison  \nBen \"Shooting the Beaner with a Repeater\" Garrison  \nBen \"The Mongoloid Murdering Maniac\" Garrison  \nBen \"Dragging Shmuley behind my Dually\" Garrison  \nBen \"Pulled a KA-BAR at the Gay Bar\" Garrison  \nBen \"Wrecking Ball the Wailing Wall\" Garrison  \nBen \"The Montanan Grand Dragon\" Garrison  \nBen \"The Anglo-Saxon Purity Klaxon\" Garrison  \nBen \"Ran over a kike with my bike\" Garrison  \nBen \"Nigger Neck-breaking Nightmare\" Garrison  \nBen \"Happy Concentration Camper\" Garrison  \nBen \"Gassing a bunch before lunch\" Garrison  \nBen \"Latino Life Leecher\" Garrison  \nBen \"A holocaust a day keeps Mossad away\" Garrison  \nBen \"Itching for a lynching\" Garrison  \nBen \"Running down cucks with monster trucks\" Garrison  \nBen \"Not white, shoot on sight\" Garrison  \nBen \"Stabbed a Jew and drank a Mountain Dew\" Garrison", "score": 31, "send_replies": true, "subreddit": "virginvschad", "date_year_month": "2019-06", "created_utc_converted": "2019-06-17 19:56:58", "score_overall": 7, "words": "holocaust holocaust merchant jewish jew holocaust jew", "shared_words": "holocaust merchant jewish jew", "socre_distint": 4}
{"author": "Totally_a_Banana", "awarders": [], "body": "As a Jewish American, who had relatives perish in concentration camps and am only alive today because my own great grandparents saw the writing on the wall soon enough to get the fuck out of Poland to go to south america, YOUR comment is insulting.\n\nMy whole life I was raised to remember the Holocaust, to remember how it STARTED so we don't let it happen again. Well let me tell you, friend, it's happening again. This is exactly how it started. They didn't start mass murdering Jews on day 1. They threw them in ghettos and in camps. They tore them apart from their families. They treated them like vermin. THEN they began experimenting on them. When the camps started getting too full they started shooting them after making them dig their own graves. When that wasn't efficient enough, they started gassing them en mass.\n\n8 stages of Genocide:  [http://www.genocidewatch.org/images/8StagesBriefingpaper.pdf](http://www.genocidewatch.org/images/8StagesBriefingpaper.pdf)\n\nEducate yourself. It doesn't start with mass murders. It stats with dehumanization and camps:\n\n**1. CLASSIFICATION:** All cultures have categories to distinguish people into “us and them” by ethnicity, race, religion, or nationality: German and Jew, Hutu and Tutsi. Bipolar societies that lack mixed categories, such as Rwanda and Burundi, are the most likely to have genocide. The main preventive measure at this early stage is to develop universalistic institutions that transcend ethnic or racial divisions, that actively promote tolerance and understanding, and that promote classifications that transcend the divisions. The Catholic church could have played this role in Rwanda, had it not been riven by the same ethnic cleavages as Rwandan society. Promotion of a common language in countries like Tanzania has also promoted transcendent national identity. This search for common ground is vital to early prevention of genocide.\n\n**2. SYMBOLIZATION:** We give names or other symbols to the classifications. We name people “Jews” or “Gypsies”, or distinguish them by colors or dress; and apply the symbols to members of groups. Classification and symbolization are universally human and do not necessarily result in genocide unless they lead to the next stage, dehumanization. When combined with hatred, symbols may be forced upon unwilling members of pariah groups: the yellow star for Jews under Nazi rule, the blue scarf for people from the Eastern Zone in Khmer Rouge Cambodia. To combat symbolization, hate symbols can be legally forbidden (swastikas) as can hate speech. Group marking like gang clothing or tribal scarring can be outlawed, as well. The problem is that legal limitations will fail if unsupported by popular cultural enforcement. Though Hutu and Tutsi were forbidden words in Burundi until the 1980’s, code-words replaced them. If widely supported, however, denial of symbolization can be powerful, as it was in Bulgaria, where the government refused to supply enough yellow badges and at least eighty percent of Jews did not wear them, depriving the yellow star of its significance as a Nazi symbol for Jews.\n\n**3. DEHUMANIZATION:** One group denies the humanity of the other group. Members of it are equated with animals, vermin, insects or diseases. Dehumanization overcomes the normal human revulsion against murder. At this stage, hate propaganda in print and on hate radios is used to vilify the victim group. In combating this dehumanization, incitement to genocide should not be confused with protected speech. Genocidal societies lack constitutional protection for countervailing speech, and should be treated differently than democracies. Local and international leaders should condemn the use of hate speech and make it culturally unacceptable. Leaders who incite genocide should be banned from international travel and have their foreign finances frozen. Hate radio stations should be shut down, and hate propaganda banned. Hate crimes and atrocities should be promptly punished.\n\n**4. ORGANIZATION:** Genocide is always organized, usually by the state, often using militias to provide deniability of state responsibility (the Janjaweed in Darfur.) Sometimes organization is informal (Hindu mobs led by local RSS militants) or decentralized (terrorist groups.) Special army units or militias are often trained and armed. Plans are made for genocidal killings. To combat this stage, membership in these militias should be outlawed. Their leaders should be denied visas for foreign travel. The U.N. should impose arms embargoes on governments and citizens of countries involved in genocidal massacres, and create commissions to investigate violations, as was done in post-genocide Rwanda.\n\n**5. POLARIZATION:** Extremists drive the groups apart. Hate groups broadcast polarizing propaganda. Laws may forbid intermarriage or social interaction. Extremist terrorism targets moderates, intimidating and silencing the center. Moderates from the perpetrators’ own group are most able to stop genocide, so are the first to be arrested and killed. Prevention may mean security protection for moderate leaders or assistance to human rights groups. Assets of extremists may be seized, and visas for international travel denied to them. Coups d’état by extremists should be opposed by international sanctions.\n\n**6. PREPARATION:** Victims are identified and separated out because of their ethnic or religious identity. Death lists are drawn up. Members of victim groups are forced to wear identifying symbols. Their property is expropriated. They are often segregated into ghettoes, deported into concentration camps, or confined to a famine-struck region and starved. At this stage, a Genocide Emergency must be declared. If the political will of the great powers, regional alliances, or the U.N. Security Council can be mobilized, armed international intervention should be prepared, or heavy assistance provided to the victim group to prepare for its self-defense. Otherwise, at least humanitarian assistance should be organized by the U.N. and private relief groups for the inevitable tide of refugees to come.\n\n**7. EXTERMINATION** begins, and quickly becomes the mass killing legally called “genocide.” It is “extermination” to the killers because they do not believe their victims to be fully human. When it is sponsored by the state, the armed forces often work with militias to do the killing. Sometimes the genocide results in revenge killings by groups against each other, creating the downward whirlpool-like cycle of bilateral genocide (as in Burundi). At this stage, only rapid and overwhelming armed intervention can stop genocide. Real safe areas or refugee escape corridors should be established with heavily armed international protection. (An unsafe “safe” area is worse than none at all.) The U.N. Standing High Readiness Brigade, EU Rapid Response Force, or regional forces -- should be authorized to act by the U.N. Security Council if the genocide is small. For larger interventions, a multilateral force authorized by the U.N. should intervene. If the U.N. is paralyzed, regional alliances must act. It is time to recognize that the international responsibility to protect transcends the narrow interests of individual nation states. If strong nations will not provide troops to intervene directly, they should provide the airlift, equipment, and financial means necessary for regional states to intervene.\n\n**8. DENIAL** is the eighth stage that always follows a genocide. It is among the surest indicators of further genocidal massacres. The perpetrators of genocide dig up the mass graves, burn the bodies, try to cover up the evidence and intimidate the witnesses. They deny that they committed any crimes, and often blame what happened on the victims. They block investigations of the crimes, and continue to govern until driven from power by force, when they flee into exile. There they remain with impunity, like Pol Pot or Idi Amin, unless they are captured and a tribunal is established to try them. The response to denial is punishment by an international tribunal or national courts. There the evidence can be heard, and the perpetrators punished. Tribunals like the Yugoslav or Rwanda Tribunals, or an international tribunal to try the Khmer Rouge in Cambodia, or an International Criminal Court may not deter the worst genocidal killers. But with the political will to arrest and prosecute them, some may be brought to justice.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nLearn this. Understand it. Don't fucking let it happen again!", "score": 24, "send_replies": true, "subreddit": "Political_Revolution", "date_year_month": "2019-06", "created_utc_converted": "2019-06-18 15:54:57", "score_overall": 4, "words": "jewish holocaust jew silencing", "shared_words": "jewish holocaust jew silencing", "socre_distint": 4}
{"author": "Totally_a_Banana", "awarders": [], "body": "Sharing this again as a parent comment per my response to another troll (due to popular request from others) here trying to downplay the fact that these ARE concentration camps) :  \n\n\nAs a Jewish American, who had relatives perish in concentration camps and am only alive today because my own great grandparents saw the writing on the wall soon enough to get the fuck out of Poland to go to south america, YOUR comment is insulting.\n\nMy whole life I was raised to remember the Holocaust, to remember how it STARTED so we don't let it happen again. Well let me tell you, friend, it's happening again. This is exactly how it started. They didn't start mass murdering Jews on day 1. They threw them in ghettos and in camps. They tore them apart from their families. They treated them like vermin. THEN they began experimenting on them. When the camps started getting too full they started shooting them after making them dig their own graves. When that wasn't efficient enough, they started gassing them en mass.\n\n8 stages of Genocide: [http://www.genocidewatch.org/images/8StagesBriefingpaper.pdf](http://www.genocidewatch.org/images/8StagesBriefingpaper.pdf)\n\nEducate yourself. It doesn't start with mass murders. It stats with dehumanization and camps:\n\n**1. CLASSIFICATION:** All cultures have categories to distinguish people into “us and them” by ethnicity, race, religion, or nationality: German and Jew, Hutu and Tutsi. Bipolar societies that lack mixed categories, such as Rwanda and Burundi, are the most likely to have genocide. The main preventive measure at this early stage is to develop universalistic institutions that transcend ethnic or racial divisions, that actively promote tolerance and understanding, and that promote classifications that transcend the divisions. The Catholic church could have played this role in Rwanda, had it not been riven by the same ethnic cleavages as Rwandan society. Promotion of a common language in countries like Tanzania has also promoted transcendent national identity. This search for common ground is vital to early prevention of genocide.\n\n**2. SYMBOLIZATION:** We give names or other symbols to the classifications. We name people “Jews” or “Gypsies”, or distinguish them by colors or dress; and apply the symbols to members of groups. Classification and symbolization are universally human and do not necessarily result in genocide unless they lead to the next stage, dehumanization. When combined with hatred, symbols may be forced upon unwilling members of pariah groups: the yellow star for Jews under Nazi rule, the blue scarf for people from the Eastern Zone in Khmer Rouge Cambodia. To combat symbolization, hate symbols can be legally forbidden (swastikas) as can hate speech. Group marking like gang clothing or tribal scarring can be outlawed, as well. The problem is that legal limitations will fail if unsupported by popular cultural enforcement. Though Hutu and Tutsi were forbidden words in Burundi until the 1980’s, code-words replaced them. If widely supported, however, denial of symbolization can be powerful, as it was in Bulgaria, where the government refused to supply enough yellow badges and at least eighty percent of Jews did not wear them, depriving the yellow star of its significance as a Nazi symbol for Jews.\n\n**3. DEHUMANIZATION:** One group denies the humanity of the other group. Members of it are equated with animals, vermin, insects or diseases. Dehumanization overcomes the normal human revulsion against murder. At this stage, hate propaganda in print and on hate radios is used to vilify the victim group. In combating this dehumanization, incitement to genocide should not be confused with protected speech. Genocidal societies lack constitutional protection for countervailing speech, and should be treated differently than democracies. Local and international leaders should condemn the use of hate speech and make it culturally unacceptable. Leaders who incite genocide should be banned from international travel and have their foreign finances frozen. Hate radio stations should be shut down, and hate propaganda banned. Hate crimes and atrocities should be promptly punished.\n\n**4. ORGANIZATION:** Genocide is always organized, usually by the state, often using militias to provide deniability of state responsibility (the Janjaweed in Darfur.) Sometimes organization is informal (Hindu mobs led by local RSS militants) or decentralized (terrorist groups.) Special army units or militias are often trained and armed. Plans are made for genocidal killings. To combat this stage, membership in these militias should be outlawed. Their leaders should be denied visas for foreign travel. The U.N. should impose arms embargoes on governments and citizens of countries involved in genocidal massacres, and create commissions to investigate violations, as was done in post-genocide Rwanda.\n\n**5. POLARIZATION:** Extremists drive the groups apart. Hate groups broadcast polarizing propaganda. Laws may forbid intermarriage or social interaction. Extremist terrorism targets moderates, intimidating and silencing the center. Moderates from the perpetrators’ own group are most able to stop genocide, so are the first to be arrested and killed. Prevention may mean security protection for moderate leaders or assistance to human rights groups. Assets of extremists may be seized, and visas for international travel denied to them. Coups d’état by extremists should be opposed by international sanctions.\n\n**6. PREPARATION:** Victims are identified and separated out because of their ethnic or religious identity. Death lists are drawn up. Members of victim groups are forced to wear identifying symbols. Their property is expropriated. They are often segregated into ghettoes, deported into concentration camps, or confined to a famine-struck region and starved. At this stage, a Genocide Emergency must be declared. If the political will of the great powers, regional alliances, or the U.N. Security Council can be mobilized, armed international intervention should be prepared, or heavy assistance provided to the victim group to prepare for its self-defense. Otherwise, at least humanitarian assistance should be organized by the U.N. and private relief groups for the inevitable tide of refugees to come.\n\n**7. EXTERMINATION** begins, and quickly becomes the mass killing legally called “genocide.” It is “extermination” to the killers because they do not believe their victims to be fully human. When it is sponsored by the state, the armed forces often work with militias to do the killing. Sometimes the genocide results in revenge killings by groups against each other, creating the downward whirlpool-like cycle of bilateral genocide (as in Burundi). At this stage, only rapid and overwhelming armed intervention can stop genocide. Real safe areas or refugee escape corridors should be established with heavily armed international protection. (An unsafe “safe” area is worse than none at all.) The U.N. Standing High Readiness Brigade, EU Rapid Response Force, or regional forces -- should be authorized to act by the U.N. Security Council if the genocide is small. For larger interventions, a multilateral force authorized by the U.N. should intervene. If the U.N. is paralyzed, regional alliances must act. It is time to recognize that the international responsibility to protect transcends the narrow interests of individual nation states. If strong nations will not provide troops to intervene directly, they should provide the airlift, equipment, and financial means necessary for regional states to intervene.\n\n**8. DENIAL** is the eighth stage that always follows a genocide. It is among the surest indicators of further genocidal massacres. The perpetrators of genocide dig up the mass graves, burn the bodies, try to cover up the evidence and intimidate the witnesses. They deny that they committed any crimes, and often blame what happened on the victims. They block investigations of the crimes, and continue to govern until driven from power by force, when they flee into exile. There they remain with impunity, like Pol Pot or Idi Amin, unless they are captured and a tribunal is established to try them. The response to denial is punishment by an international tribunal or national courts. There the evidence can be heard, and the perpetrators punished. Tribunals like the Yugoslav or Rwanda Tribunals, or an international tribunal to try the Khmer Rouge in Cambodia, or an International Criminal Court may not deter the worst genocidal killers. But with the political will to arrest and prosecute them, some may be brought to justice.\n\nLearn this. Understand it. Don't fucking let it happen again!", "score": 102, "send_replies": true, "subreddit": "Political_Revolution", "date_year_month": "2019-06", "created_utc_converted": "2019-06-18 17:10:35", "score_overall": 4, "words": "jewish holocaust jew silencing", "shared_words": "jewish holocaust jew silencing", "socre_distint": 4}
{"author": "ByzantineHeretic", "awarders": [], "body": "Hezbollah, Hamas, The Muslim Brotherhood, and the Quds force would probably beg to differ. \n\nIslamophobia is a fear of a religion, which supersedes nationality- Malay and Indonesian majorities are Muslim, while much of the fear is directed toward Arabs. \n\nAntisemitism generally speaking, advocates that any Jew regardless of nationality is more loyal to Israel over the country they hold citizenship in, and holds unique centuries old conspiracy theories and blood libels. I’d wager antisemitism is different from Islamophobia because it’s directed toward a group discouraged if not forbade to proselytise, is directed at a specific state, and finds persecution from both the far-right and far-left. \n\nWhile both forms of hatred are abhorrent, there is a difference in ideology when it comes to some sects advocating for dominionist and supremacist views versus simply wishing to be allowed to live. I do not and will not live under Islamic law, I would be executed for being gay, rape is justified by [some communities](https://youtu.be/y1cFoPFF-as)  in the UK for post-pubescent girls for not dressing modestly enough. This isn’t Breitbart talking either. Civil law should always be followed, and I have yet to hear of radical Jewish groups in the US or elsewhere demanding all women dress a certain way, or that the government mandate all meat be Kosher. \n\nThere is a difference. I do not hate Muslims, nor do I hate that they feel convicted by their beliefs. The point is that in a secular society, religion is a private ordeal and has no place in mandating how everyone else is allowed to live, just as evangelism should have no place in schools, religious ideology that seeks to find its way into politics is a threat. I want religious groups to be a protected class regardless of affiliation so long as they respect my right to disagree and to exist without persecution.", "score": 0, "send_replies": true, "subreddit": "TopMindsOfReddit", "date_year_month": "2019-06", "created_utc_converted": "2019-06-18 23:08:51", "score_overall": 4, "words": "jew conspiracy jewish kosher", "shared_words": "jew conspiracy jewish kosher", "socre_distint": 4}
{"author": "ghazellessuk", "awarders": [], "body": "&gt; People routinely stand up and say labour is being anti-semetic at its core and they never present evidence \n\naw shit here we go  again:\n\nhttps://www.thesun.co.uk/news/8809459/labour-anti-semitism-activists-jeremy-corbyn/\n\nLabour activists who blamed 9/11 on Jews and claimed Theresa May bombed Manchester are allowed to stay in party\n\n\nabour activist shared neo-Nazi material, is still embraced by local party - and now elected councillor\nA Labour activist who shared the claim “the Jews declared war on Germany in 1933” has been elected a councillor - amid confusion over whether she was even investigated over it despite numerous complaints.\nhttps://www.thejc.com/news/uk-news/labour-activist-rachel-abbott-shared-neo-nazi-material-about-how-jews-declared-war-on-germany-1.483859\n\nSadiq Khan poses with Labour councillor he called anti-Semitic over Facebook posts 'blaming Zionist Jews for 9/11' and claiming 'Israel and the US created ISIS'\n\nNational Union of Journalists investigates after board member tweets Jewish politicians don't have 'human blood'\nhttps://www.thejc.com/news/uk-news/national-union-of-journalists-looking-into-complaints-against-anti-israel-board-member-1.468260\nhttps://www.dailymail.co.uk/news/article-6981063/Pictured-Sadiq-Khan-poses-Labour-councillor-called-anti-Semitic.html\n\nhttps://www.walesonline.co.uk/news/politics/swansea-labour-party-member-understood-16275738\n\nAlan Bull, who was selected by @uklabour as a candidate, in the full knowledge he is a Holocaust denier\nhttps://twitter.com/AntisemitismOut/status/976383308308283392\n\n\nMuslim peer Lord Ahmed blames Jewish conspiracy for jailing him\n\nhttps://www.thetimes.co.uk/article/muslim-peer-lord-ahmed-blames-jewish-conspiracy-for-jailing-him-nkcxnk892wj\n\nCorbyn-supporting candidate deselected over Israel-ISIS article\nhttp://jewishnews.timesofisrael.com/corbyn-supporting-candidate-deselected-over-israel-isis-article/\n\nLABOUR REFUSES TO SAY WHAT WILL HAPPEN TO COUNCILLOR WHO POSTED CARICATURE OF HOOK-NOSED BLOODTHIRSTY JEW\nhttps://antisemitism.uk/labour-refuses-to-say-what-will-happen-to-councillor-who-posted-image-of-hook-nosed-bloodthirsty-jew/\n\n “You do know Hitler was ‘only defending’ Germany from Jews right?.Another Labour Councillor Has Been Suspended Over Alleged Anti-Semitic Comments\nhttps://www.buzzfeed.com/hannahalothman/another-labour-councillor-has-been-suspended-over-alleged?utm_term=.leAlqKma3#.lp3Gr8Vlm\n\n\nAysegul Gurbuz: Labour councillor suspended after praising Hitler on social media\nThe 20-year-old called the German dictator the 'greatest man in history' on Twitte\nhttps://www.independent.co.uk/news/uk/politics/aysegul-gurbuz-labour-councillor-suspended-after-praising-hitler-on-social-media-a6977611.html\n\n\nIT’S THE SUPER RICH FAMILIES OF THE ZIONIST LOBBY THAT CONTROL THE WORLD”, AS COUNCIL CANDIDATE\t\nhttps://antisemitism.uk/labour-selects-billy-wells-who-defends-ken-livingstone-and-says-its-the-super-rich-families-of-the-zionist-lobby-that-control-the-world-as-council-candidate/\nDon’t give your soul energy to the parasitical Rothschild-Zion-Jesuit-Vati-lunatic nonce controllers.\n\nAnti-Semitic row Newcastle councillor WILL stand for Labour at local elections\nscreenshots of Mr Ahad’s Facebook page show him saying he voted against a planning application for a Marks &amp; Spencer store “on principal (sic)” – also saying the store was “directly killing innocent Palestinian people by directly funding the Zionist regime”.\nhttps://www.chroniclelive.co.uk/news/north-east-news/anti-semitic-row-newcastle-councillor-14500732.amp?__twitter_impression=true\n\nGeorge McManus was suspended in August over an alleged anti-Semitic Facebook post.\nIn his post, Mr McManus claimed Mr Watson had \"received £50,000+ from Jewish donors\" before adding: \"At least Judas only got 30 pieces of silver\".\nhttps://www.hulldailymail.co.uk/news/hull-east-yorkshire-news/labour-party-suspension-lifted-george-2051241\n\n“There are only nine countries left in the world without a Rothschild central bank: Russia, China, Iceland, Cuba, Syria, Iran, Venezuela, North Korea and Hungary. Isn’t it funny we are always at war with these countries?”\nhttps://www.heraldscotland.com/news/16369930.scottish-labour-leader-richard-leonard-criticised-over-delayed-probe-into-allegedly-anti-semitic-post-by-councillor/\n\nFormer Mayor of Shrewsbury Cllr Ioan Gruffydd Jones, shared http://Smoloko.com  a far-right/Nazi apologist/neo-fascist/white nationalist/white supremacist/anti-Semitic propaganda website on Facebook, among other unpleasant posts.\n\nhttp://jewishnews.timesofisrael.com/ilyas-aziz-readmitted/\nAnti-Semitic’ Labour councillor readmitted to party\n\nIrfan Javed @UKLabour candidate in Woodfield in Stevenage. He has ranted on Facebook about “Jew propaganda” and commented: “I am just suspicious. This is what Jewish dominated western media usually does.\nhttps://order-order.com/2018/05/01/labour-candidate-ranted-jew-propaganda/\n\n\n John Clarke @UKLabour Cllr &amp; PPC in Essex, berated Jewish victims of the holocaust, saying we should have \"fought back\" &amp; the Rothschild's have \"used usury as an imperial instrument to take over the world and all of its resources, including you and I”\nhttps://antisemitism.uk/racist-labours-councillor-clarke-found-berating-holocaust-victims-for-not-fighting-back/\n\nCllr Luke Cresswell. Who was reported to @UKLabour for antisemitism &amp; rewarded with a council seat. He tweeted a blood-drenched Israeli flag, captioned “Moses must be proud of you\nhttps://www.telegraph.co.uk/politics/2018/03/29/labour-quietly-reinstated-six-councillors-posted-anti-semitic/\n\na councillor from Fife, suggested in a Facebook post that headlines critical of @UKlabour position could be the work of the Israeli security services.\nhttps://www.bbc.co.uk/news/uk-scotland-scotland-politics-45018653", "score": 4, "send_replies": true, "subreddit": "unitedkingdom", "date_year_month": "2019-06", "created_utc_converted": "2019-06-19 18:25:04", "score_overall": 15, "words": "jewish holocaust jewish conspiracy jewish conspiracy jew jew jewish jew jewish jew jewish holocaust holocaust", "shared_words": "jewish holocaust conspiracy jew", "socre_distint": 4}
{"author": "bacongoodforme", "awarders": [], "body": "As a foundation of the universe, this doctrine would bring about the end of any order intellectually conceivable to man. And as, in this greatest of all recognizable organisms, the result of an application of such a law could only be chaos, on earth it could only be destruction for the inhabitants of this planet.\n\nIf, with the help of his Marxist creed, the Jew is victorious over the other peoples of the world, his crown will be the funeral wreath of humanity and this planet will, as it did thousands of years ago, move through the ether devoid of men.\n\nEternal Nature inexorably avenges the infringement of her commands.\n\nHence today I believe that I am acting in accordance with the will of the Almighty Creator: by defending myself against the Jew, I am fighting for the work of the Lord\n\nOn the \"Big Lie\" [p.134]\n\nAll this was inspired by the principle - which is quite true in itself - that in the big lie there is always a certain force of credibility; because the broad masses of a nation are always more easily corrupted in the deeper strata of their emotional nature than consciously or voluntarily; and thus in the primitive simplicity of their minds they more readily fall victims to the big lie than the small lie, since they themselves often tell small lies in little matters but would be ashamed to resort to large-scale falsehoods. It would never come into their heads to fabricate colossal untruths, and they would not believe that others could have the impudence to distort the truth so infamously. Even though the facts which prove this to be so may be brought clearly to their minds, they will still doubt and waver and will continue to think that there may be some other explanation. For the grossly impudent lie always leaves traces behind it, even after it has been nailed down, a fact which is known to all expert liars in this world and to all who conspire together in the art of lying. These people know only too well how to use falsehood for the basest purposes. From time immemorial, however, the Jews have known better than any others how falsehood and calumny can be exploited. Is not their very existence founded on one great lie, namely, that they are a religious community, where as in reality they are a race? And what a race! One of the greatest thinkers that mankind has produced has branded the Jews for all time with a statement which is profoundly and exactly true. Schopenhauer called the Jew \"The Great Master of Lies\". Those who do not realize the truth of that statement, or do not wish to believe it, will never be able to lend a hand in helping Truth to prevail.\n\nOn the Protocols of the Elders of Zion [p.279]\n\nTo what an extent the whole existence of this people is based on a continuous lie is shown incomparably by the Protocols of the Elders of Zion, so infinitely hated by the Jews. They are based on a forgery, the Frankfurter Zeitung moans and screams once every week: the best proof that they are authentic ... For once this book has become the common property of a people, the Jewish menace may be considered as broken.\n\nOn the Weapons of the Jews [pp. 293-296]\n\nHis unfailing instinct in such things scents the original soul (die urspruengliche Seele) in everyone, and his hostility is assured to anyone who is not spirit of his spirit. Since the Jew is not the attacked but the attacker, not only anyone who attacks passes as his enemy, but also anyone who resists him. But the means with which he seeks to break such reckless but upright souls is not honest warfare, but lies and slander.\n\nHere he stops at nothing, and in his vileness he becomes so gigantic that no one need be surprised if among our people the personification of the devil as the symbol of all evil assumes the living shape of the Jew.\n\nThe ignorance of the broad masses about the inner nature of the Jew, the lack of instinct and narrow-mindedness of our upper classes, make the people an easy victim for this Jewish campaign of lies.\n\nWhile from innate cowardice the upper classes turn away from a man whom the Jew attacks with lies and slander, the broad masses from stupidity or simplicity believe everything. The state authorities either cloak themselves in silence or, what usually happens, in order to put an end to the Jewish press campaign, they persecute the unjustly attacked, which, in the eyes of such an official ass, passes as the preservation of state authority and the safeguarding of law and order.\n\nSlowly fear and the Marxist weapon of Jewry descend like a nightmare on the mind and soul of decent people.\n\nThey begin to tremble before the terrible enemy and thus have become his final victim.\n\nThe Jew’s domination in the state seems so assured that now not only can he call himself a Jew again, but he ruthlessly admits his ultimate national and political designs. A section of his race openly owns itself to be a foreign people, yet even here they lie. For while the Zionists try to make the rest of the world believe that the national consciousness of the Jew finds its satisfaction in the creation of a Palestinian state, the Jews again slyly dupe the dumb Goyim. It doesn’t even enter their heads to build up a Jewish state in Palestine for the purpose of living there; all they want is a central organization for their international world swindle, endowed with its own sovereign rights and removed from the intervention of other states: a haven for convicted scoundrels and a university for budding crooks.\n\nIt is a sign of their rising confidence and sense of security that at a time when one section is still playing the German, Frenchman, or Englishman, the other with open effrontery comes out as the Jewish race.\n\nHow close they see approaching victory can be seen by the hideous aspect which their relations with the members of other peoples takes on.\n\nWith satanic joy in his face, the black-haired Jewish youth lurks in wait for the unsuspecting girl whom he defiles with his blood, thus stealing her from her people. With every means he tries to destroy the racial foundations of the people he has set out to subjugate. Just as he himself systematically ruins women and girls, he does not shrink back from pulling down the blood barriers for others, even on a large scale. It was and it is Jews who bring the Negroes into the Rhineland, always with the same secret thought and clear aim of ruining the hated white race by the necessarily resulting bastardization, throwing it down from its cultural and political height, and himself rising to be its master.\n\nFor a racially pure people which is conscious of its blood can never be enslaved by the Jew. In this world he will forever be master over bastards and bastards alone.\n\nAnd so he tries systematically to lower the racial level by a continuous poisoning of individuals.\n\nAnd in politics he begins to replace the idea of democracy by the dictatorship of the proletariat.\n\nIn the organized mass of Marxism he has found the weapon which lets him dispense with democracy and in its stead allows him to subjugate and govern the peoples with a dictatorial and brutal fist.\n\nHe works systematically for revolutionization in a twofold sense: economic and political.\n\nAround peoples who offer too violent a resistance to attack from within he weaves a net of enemies, thanks to his international influence, incites them to war, and finally, if necessary, plants a flag of revolution on the very battlefields.\n\nIn economics he undermines the states until the social enterprises which have become unprofitable are taken from the state and subjected to his financial control.\n\nIn the political field he refuses the state the means for its self-preservation, destroys the foundations of all national self-maintenance and defense, destroys faith in the leadership, scoffs at its history and past, and drags everything that is truly great into the gutter.\n\nCulturally, he contaminates art, literature, the theater, makes a mockery of natural feeling, overthrows all concepts of beauty and sublimity, of the noble and the good, and instead drags men down into the sphere of his own base nature.\n\nReligion is ridiculed, ethics and morality represented as outmoded, until the last props of a nation in its struggle for existence in this world have fallen.\n\nNow begins the great last revolution. In gaining political power the Jew casts off the few cloaks that he still wears. The democratic people’s Jew becomes the blood-Jew and tyrant over peoples. In a few years he tries to exterminate the national intelligentsia and by robbing the peoples of their natural intellectual leadership makes them ripe for the slave’s lot of permanent subjugation.\n\nThe most frightful example of this kind is offered by Russia, where he killed or starved about thirty million people with positively fanatical savagery, in part amid inhuman tortures, in order to give a gang of Jewish journalists and stock exchange bandits domination over a great people.\n\nThe end is not only the end of the freedom of the peoples oppressed by the Jew, but also the end of this parasite upon the nations. After the death of his victim, the vampire sooner or later dies too.\n\nOn the Use of Propoganda [Chapter 6]\n\nThe function of propaganda does not lie in the scientific training of the individual, but in calling the masses' attention to certain facts, processes, necessities, etc., whose significance is thus for the first time placed within their field of vision ...\n\nAll propaganda must be popular and its intellectual level must be adjusted to the most limited intelligence among those it is addressed to. Consequently, the greater the mass it is intended to reach, the lower its purely intellectual level will have to be. But if, as in propaganda for sticking out a war, the aim is to influence a whole people, we must avoid excessive intellectual demands on our public, and too much caution cannot be extended in this direction.", "score": 1, "send_replies": true, "subreddit": "HistoryMemes", "date_year_month": "2019-06", "created_utc_converted": "2019-06-20 05:40:09", "score_overall": 24, "words": "jew jew jew jewish jew jew jew jewish cowardice jew jewish jew jew jew goyim jewish jewish jewish jew jew jew jew jewish jew", "shared_words": "jew jewish cowardice goyim", "socre_distint": 4}
{"author": "user12122262222", "awarders": [], "body": " \n\n“Gang stalking” is law enforcement engaging in counter-intelligence activities on civilians. In other words: “Gang stalking” is the slang term used to describe being subjected to global government surveillance and unlawful monitoring.. \n\nPeople think government surveillance is something that goes on without the target being aware- but that is not correct. Surveillance is magnitudes more effective when it is conspicuous and the target is repeatedly reminded that they are being monitored. Agents do it in ways that only the target will notice, and which nobody would believe. It can be terrifying and can neutralize anyone.\n\n“Gang stalking” is a slang term for the espionage authority granted to law enforcement at all levels as a result of the Patriot Act and FISA 702, which allows for warrantless, conspicuous surveillance to be conducted by both law enforcement and private security contractors. The security industry is booming and hiring “surveillance role players” constantly, and for good money, too: [https://www.glassdoor.com/Job/surveillance-role-players-jobs-SRCH\\_KO0,25.htm](https://www.glassdoor.com/Job/surveillance-role-players-jobs-SRCH_KO0,25.htm) (These people often don't realize they are actually doing surveillance work and not acting.)\n\n“Gang stalking” is simply a term for the counter-intelligence work that the three letter agencies have been engaged in since WWII, including McCarthyism and CointelPro. What is unique about the new widespread phenomenon of spying and espionage is that it is being carried out by regular police as well as normal civilians, criminal informants and through programs like Infraguard, Citizens Corps and database sharing via Fusion Centers. They even farm out the harassment- law enforcement will recruit your neighbors to spy on you based on the premise that you are a danger to society.\n\nCounter-Intelligence tactics:\n\n\\*HEAD GAMES - number one tactic is screwing with you\n\n\\*street theater harassment techniques (staged incidents calculated to upset and traumatize the Targeted Individual, a.k.a. TI,)\n\nhttps://www.youtube.com/watch?v=IQqfaFzSbIw\n\n&amp;#x200B;\n\n* Color harassment - flash mobbing in public using the color red worn by many people, surrounding the target, therefore conditioning the target to be “sensitized” to the color red.  \n\n\\*vehicular brighting (using high beams from vehicles to hurt and irritate the Target,)\n\n\\*vehicular mobbing - using a group of similarly colored vehicles to follow the target in public.\n\n\\* Managed Aggression - Strangers subjecting the target to repeated “accidental” physical assaults, such as bumping into and/or kicking the feet of the target from behind, sometimes as many as 20-50 times per day\n\n\\*overt and covert photographing of the target, either to destroy a targets’ reputation or if it’s overt, simply to make the target feel watched, intimidated\n\n\\* Synchronizing exit/entry to target’s housing or work, synchronizing movements/activity to the Target in an effort to irritate and intimidate them… Or as a form of street theater, synchronizing body movements in front of the target.\n\n[https://www.youtube.com/watch?v=1r8\\_UiKNa3A](https://www.youtube.com/watch?v=1r8_UiKNa3A)\n\n\\*Surveillance abuse — bugs and recording devices planted in targets’ home, work etc… result is the target being subjected to “directed conversation” while in public.\n\n[https://www.youtube.com/watch?v=o2XFeA7EA8g](https://www.youtube.com/watch?v=o2XFeA7EA8g)\n\n\\* mimcry- using surveillance to mimic a Tareget’s clothing, favorite colors, etc…\n\n\\*Jew Baiting - A Term with roots in the Holocaust, where Germans would bait, taunt and physically harass the Jewish people until they would have an outburst, then have them arrested and subsequently sent to camps. \n\n\\* audio spotlight harassment- using holosonic technology to harass and irritate targets.\n\nhttps://www.youtube.com/watch?v=0tY\\_EOYqoVs\n\n\\* Blocking of passage- “Gang stalkers” will block your passage through a hallway, entrance, exit, road, etc.. to make you go through another way they want you to pass and take the picture. \n\n\\*defamation of the character throughout the targets’ community and the TI's workplace as violent towards women, a pedophile, white supremacist, prostitute, human trafficker, or other type of highly stigmatizing label calculated to get the TI isolated, with neighbors readily involved in persecution. They recruit your neighbors to spy on you based on the premise that you are a danger to society.\n\n[https://www.youtube.com/watch?v=V1M1Hw9OzF8](https://www.youtube.com/watch?v=V1M1Hw9OzF8)\n\n\\*Noise synchronization -alarms, honks, yelling, people passing by at high speed, slamming of doors, coughing at target, training pet dog to bark when target is nearby\n\n\\*Gaslighting and frame-jobs\n\n[https://www.youtube.com/watch?v=IsY9vbGY1Rg](https://www.youtube.com/watch?v=IsY9vbGY1Rg)\n\nhttps://www.youtube.com/watch?v=iS85HjukNIo\n\nAmerica must take a hard look at what rights were given up as a result of 2001 attacks, and how they are currently disrupting the lives of innocent people over the years. These programs are being abused, as always happens when you contract civilians to spy on civilians. Presidents have referred to these programs as a new model for policing which involves “social justice” as well as throwing around phrases like “A Dramatic transformation of society.”\n\nThe sooner the masses discover what is causing many of the mass shootings, the sooner a dialogue can be opened. The basic goal is to neutralize you, to get you out of society. That could mean jail, psyche, or suicide. The psyop aspect includes all kinds of scare tactics, gaslighting, etc.. Just remember they are wrong for doing this, and people stood up and would not accept the Nazi holocaust or the Stasi Zersetzung period. So, hope is reasonable thing to have. Please try to spread awareness.\n\nDon't fall for any “conspiracy” nonsense- they aren't reptile people, nobody can read your mind, no synthetic telepathy, it's not the Illuminati, not \"the jews\", no V2K (it's holosonic) Satanists or reptilians, it's not the Freemasons (although some members of every community are freemasons and are therefore active in community policing) It's not the CIA, nothing esoteric.\n\nIt's police-driven community policing involving many levels of city municipality, first responders, law enforcement, and then everyone that you come in contact with has a chance of being recruited based on something slanderous told about you by a person of authority. To better understand what is happening, learn all you can about Zersetzung.\n\nAll the best, RH", "score": 1, "send_replies": true, "subreddit": "insanepeoplefacebook", "date_year_month": "2019-06", "created_utc_converted": "2019-06-20 10:13:28", "score_overall": 6, "words": "jew holocaust jewish holocaust conspiracy illuminati", "shared_words": "jew holocaust jewish conspiracy illuminati", "socre_distint": 5}
{"author": "0056", "awarders": [], "body": "Check your language: you don’t have a conversation with someone while insulting them. What I mean is that you should not respond to people by saying they are “entitled jewish brats” etc - you are inflaming the situation. Just don’t do this. \n\nGoyim just means non-Jew. It is not the insult you seem to believe it is, and it is a common way to refer to non-Jews - it is a bit slang-y, but doesn’t have “heat” to it. \n\nHitler giving the Jews a choice? Let’s just say that you’ve been given a choice to leave your country and go settle somewhere else, but you’ll have to leave your career, your assets, and everything behind. A lot of times people believe that some crazy who gets into power in a country will be temporary - no one had the foresight to predict the Holocaust. Who would really think that way, back then? Easy enough to think it’ll blow over, calmer times ahead, etc.", "score": 1, "send_replies": true, "subreddit": "IslamUnveiled", "date_year_month": "2019-06", "created_utc_converted": "2019-06-22 03:17:29", "score_overall": 4, "words": "jewish goyim jew holocaust", "shared_words": "jewish goyim jew holocaust", "socre_distint": 4}
{"author": "RafeHaab", "awarders": [], "body": "&gt; Goyim just means non-Jew.\n\nGoyim means \"beast\" or sometimes \"animal\", meaning \"non-human\". So yes, it is in fact an insult, and a way worse insult than \"spoiled brat\". I'm not going to pretend I wasn't insulted just because he's jewish. I don't have to watch my language after someone called me a non-english version of \"sub-human beast\". If you are a mod here, you should be warning him about his language, not me. I was provoked, he wasn't.\n\n&gt; Hitler giving the Jews a choice? Let’s just say that you’ve been given a choice to leave your country and go settle somewhere else, but you’ll have to leave your career, your assets, and everything behind.\n\nSo, let's analyse the situation you presented me with: The general athmosphere is very threatening, with people freely expressing that people like me are the cause of Germany's economic troubles, and the tension is rising until you can almost but it with a knife. Of course I would flee the country, I'm oviously not welcome here and everyone seems to be turning on me just to find a escapegoat. What's worse, the current government seems to be encouraging this. \n\nAlso, I don't have to leave all my assets if I can just smuggle them out of there. What's important is to keep my family alive. \n\nAnd about the others like me who are also potential escapegoats, I would advise them to take their chance too; Things are very likely to get worse in the near future given there's a crazy power tripper in power. Temporary or not, staying isn't worth risking our lives. You can't possibly predict something as big as the holocaust, but you can indeed predict that violence will escalate.\n\nJust look at the current situation in south africa, wich is mostly the same: A crazy power tripper who is blaming people like you for every problem in the nation. A lot of boers (which has a meaning as innocent as \"white farmer\") have already fled the country and settled somewhere else even before the murders started, and the remaining ones have moved themselves into self-made concentration camps where they can at least keep watch over each other to avoid conflicts while they wait for help leaving the country.\n\nAnd they got it, Australia is willing to take them in and even give them citizenship free of charge. Boers have truly dodged a bullet here.\n\nAnd for me, I'm pretty lucky. Violence is mostly allowed toward white argentinians, but the government isn't officially endorsing it, and there's still a façade of trying to minimise crime. So I moved from a medium city to a small town, and let me tell you I feel a lot safer here. And that I would definitely leave my life here behind if things escalated to a point where there's a crazy power-tripper in power trying to blame me for every problem i nthe country. I won't risk my life for a bunch of material belongings.", "score": 1, "send_replies": true, "subreddit": "IslamUnveiled", "date_year_month": "2019-06", "created_utc_converted": "2019-06-22 14:25:03", "score_overall": 5, "words": "goyim jew goyim jewish holocaust", "shared_words": "goyim jew jewish holocaust", "socre_distint": 4}
{"author": "user12122262222", "awarders": [], "body": "Surveillance, dum dum. You are under surveillance.\n\n&amp;#x200B;\n\nYour intimate details are being added to a dossier, by way of active surveillance- that means a combination of recording bugs in your flat, apps like spyzie to retrieve info from your phone, and  your browser history and internet usage being spied upon in real time, and jackass \"gang stalkers\" following you around everywhere you go, using a private whatsapp group to discuss you and relay info in real time.\n\n&amp;#x200B;\n\nUse a VPN at all times, don't ever check your email with your phone or use your phone for texting,  and be careful what you say in your flat.\n\n&amp;#x200B;\n\n“Gang stalking” is law enforcement engaging in counter-intelligence activities on civilians. In other words: “Gang stalking” is the slang term used to describe being subjected to global government surveillance and unlawful monitoring..\n\nPeople think government surveillance is something that goes on without the target being aware- but that is not correct. Surveillance is magnitudes more effective when it is conspicuous and the target is repeatedly reminded that they are being monitored. Agents do it in ways that only the target will notice, and which nobody would believe. It can be terrifying and can neutralize anyone.\n\n“Gang stalking” is a slang term for the espionage authority granted to law enforcement at all levels as a result of the Patriot Act and FISA 702, which allows for warrantless, conspicuous surveillance to be conducted by both law enforcement and private security contractors. The security industry is booming and hiring “surveillance role players” constantly, and for good money, too: [https://www.glassdoor.com/Job/surveillance-role-players-jobs-SRCH\\_KO0,25.htm](https://www.glassdoor.com/Job/surveillance-role-players-jobs-SRCH_KO0,25.htm) (These people often don't realize they are actually doing surveillance work and not acting.)\n\n“Gang stalking” is simply a term for the counter-intelligence work that the three letter agencies have been engaged in since WWII, including McCarthyism and CointelPro. What is unique about the new widespread phenomenon of spying and espionage is that it is being carried out by regular police as well as normal civilians, criminal informants and through programs like Infraguard, Citizens Corps and database sharing via Fusion Centers. They even farm out the harassment- law enforcement will recruit your neighbors to spy on you based on the premise that you are a danger to society.\n\nCounter-Intelligence tactics:\n\n\\*HEAD GAMES - number one tactic is screwing with you\n\n\\*street theater harassment techniques (staged incidents calculated to upset and traumatize the Targeted Individual, a.k.a. TI,)\n\n[https://www.youtube.com/watch?v=IQqfaFzSbIw](https://www.youtube.com/watch?v=IQqfaFzSbIw)\n\n&amp;#x200B;\n\n* Color harassment - flash mobbing in public using the color red worn by many people, surrounding the target, therefore conditioning the target to be “sensitized” to the color red.\n\n\\*vehicular brighting (using high beams from vehicles to hurt and irritate the Target,)\n\n\\*vehicular mobbing - using a group of similarly colored vehicles to follow the target in public.\n\n\\* Managed Aggression - Strangers subjecting the target to repeated “accidental” physical assaults, such as bumping into and/or kicking the feet of the target from behind, sometimes as many as 20-50 times per day\n\n\\*overt and covert photographing of the target, either to destroy a targets’ reputation or if it’s overt, simply to make the target feel watched, intimidated\n\n\\* Synchronizing exit/entry to target’s housing or work, synchronizing movements/activity to the Target in an effort to irritate and intimidate them… Or as a form of street theater, synchronizing body movements in front of the target.\n\n[https://www.youtube.com/watch?v=1r8\\_UiKNa3A](https://www.youtube.com/watch?v=1r8_UiKNa3A)\n\n\\*Surveillance abuse — bugs and recording devices planted in targets’ home, work etc… result is the target being subjected to “directed conversation” while in public.\n\n[https://www.youtube.com/watch?v=o2XFeA7EA8g](https://www.youtube.com/watch?v=o2XFeA7EA8g)\n\n\\* mimicry- using surveillance to mimic a Target’s clothing, favorite colors, etc…\n\n\\*Jew Baiting - A Term with roots in the Holocaust, where Germans would bait, taunt and physically harass the Jewish people until they would have an outburst, then have them arrested and subsequently sent to camps.\n\n\\* audio spotlight harassment- using holosonic technology to harass and irritate targets.\n\n[https://www.youtube.com/watch?v=0tY\\_EOYqoVs](https://www.youtube.com/watch?v=0tY_EOYqoVs)\n\n\\* Blocking of passage- “Gang stalkers” will block your passage through a hallway, entrance, exit, road, etc.. to make you go through another way they want you to pass and take the picture.\n\n\\*defamation of the character throughout the targets’ community and the TI's workplace as violent towards women, a pedophile, white supremacist, prostitute, human trafficker, or other type of highly stigmatizing label calculated to get the TI isolated, with neighbors readily involved in persecution. They recruit your neighbors to spy on you based on the premise that you are a danger to society.\n\n[https://www.youtube.com/watch?v=V1M1Hw9OzF8](https://www.youtube.com/watch?v=V1M1Hw9OzF8)\n\n\\*Noise synchronization -alarms, honks, yelling, people passing by at high speed, slamming of doors, coughing at target, training pet dog to bark when target is nearby\n\n\\*Gaslighting and frame-jobs\n\n[https://www.youtube.com/watch?v=IsY9vbGY1Rg](https://www.youtube.com/watch?v=IsY9vbGY1Rg)\n\n[https://www.youtube.com/watch?v=iS85HjukNIo](https://www.youtube.com/watch?v=iS85HjukNIo)\n\nAmerica must take a hard look at what rights were given up as a result of 2001 attacks, and how they are currently disrupting the lives of innocent people over the years. These programs are being abused, as always happens when you contract civilians to spy on civilians. Presidents have referred to these programs as a new model for policing which involves “social justice” as well as throwing around phrases like “A Dramatic transformation of society.”\n\nThe sooner the masses discover what is causing many of the mass shootings, the sooner a dialogue can be opened. The basic goal is to neutralize you, to get you out of society. That could mean jail, psyche, or suicide. The psyop aspect includes all kinds of scare tactics, gaslighting, etc.. Just remember they are wrong for doing this, and people stood up and would not accept the Nazi holocaust or the Stasi Zersetzung period. So, hope is reasonable thing to have. Please try to spread awareness.\n\nDon't fall for any “conspiracy” nonsense- they aren'ta reptile people, nobody can read your mind, no synthetic telepathy, it's not the Illuminati, not \"the jews\", no V2K (it's holosonic) Satanists or reptilians, it's not the Freemasons (although some members of every community are freemasons and are therefore active in community policing) It's not the CIA, nothing esoteric.\n\nIt's police-driven community policing involving many levels of city municipality, first responders, law enforcement, and then everyone that you come in contact with has a chance of being recruited based on something slanderous told about you by a person of authority. To better understand what is happening, learn all you can about Zersetzung.\n\nAll the best, RH", "score": 0, "send_replies": true, "subreddit": "Gangstalking", "date_year_month": "2019-06", "created_utc_converted": "2019-06-22 15:10:11", "score_overall": 6, "words": "jew holocaust jewish holocaust conspiracy illuminati", "shared_words": "jew holocaust jewish conspiracy illuminati", "socre_distint": 5}
{"author": "necessaryresponse", "awarders": [], "body": "&gt; Don’t try to paint me as someone who hates Jews based on genetics alone.\n\nHere, I pulled this from one of your comments elsewhere:\n\n&gt;Was I supposed to meditate on a mountain and wait for the image of the merchant to astral project me to the fact that Jews are selfish and sneaky?\n\nStop pretending you're digging at some deeper truth.\n\nEDIT:  Missed this one\n&gt;It’ll be alright, bub. All you have to do is ignore it.\n\nWhich part of history do I ignore?  Holocaust?  Blood libel?  Being blamed for the Black Death?  Protocols of the Elders of Zion?  When the fucking pope kidnaps a Jew?", "score": -4, "send_replies": true, "subreddit": "WatchRedditDie", "date_year_month": "2019-06", "created_utc_converted": "2019-06-22 21:49:31", "score_overall": 4, "words": "merchant holocaust libel jew", "shared_words": "merchant holocaust libel jew", "socre_distint": 4}
{"author": "anxiousballofmess", "awarders": [], "body": "&gt;The entire point of this post is to develop methods of dealing with anti semites.\n\n**NOPE: \"With the sudden rise of anti-Semitism can you explain the hatred of Jewish people to someone who doesn't understand it?\"**\n\n&gt;Just because people of your creed have been victims of aggression it doesn’t mean you understand their rationale.\n\n**We've studied it quite a bit, actually.**\n\n&gt; In fact it might obstruct you from seeing; my idea is certainly different to yours and we need to weigh them off against each other to see which is more accurate, \n\n**Wait, what? To see if Antisemitism is ok or not, we need to listen to antisemites and judge which of their conspiracy theories are more or less ok as a rationale for hatred and murder? This isn't \"which color shirt goes best with blue pants\" or \"do bonds pay off in the long run, yes or no.\"**\n\n&gt;so we can actually tackle the issues at their roots.  \n&gt;  \n&gt;They refuse to be debunked because nobody will talk to them in a constructive manner. \n\n**We've tried and it didn't work. Like, so so so many times. Google \"Disputation of Barcelona\" or \"Dezanification of Germany.\" You're bringing a decades-perspective knife to a millennia-long gun fight.**\n\n&gt;It’s a problem characteristic of modern politics as a whole. People ensconce themselves in groups with people who agree with them and enter illogical spirals and end up coming to poor conclusions, then becoming incandescent when they meet people who disagree with them, which instantly denies any possibility of proper debate or mind changing. Personally I don’t believe anybody who holds such abhorrent viewpoints is inherently bad - I believe there will be a cause for their perspective which can be addressed, and should be addressed to help alleviate the problems. \n\n**The \"problem to be addressed\" which has led to antisemitism in the past and the roots of it today have included no less than: the collapse of the Roman Empire, the Black Death, Modernity itself, and pretty much Every Wartime Ever.**\n\n&gt;Blistering and censorship will achieve nothing, as making things forbidden is not a universal solution.  \n&gt;  \n&gt;The nature of anti semitism has also changed over time too.   \n&gt;  \n&gt;**\\[**The 20th century is an excellent example, as it has highlighted the issue, created a new cause for the problem but also strengthened people against racism,**\\]**\n\n**\\^ I have no idea what you're arguing about here. The whole \"Israel is bad\" thing isn't new. It existed before the 1940s. It's just the physical representation of the overlap of two parts of the Great Antisemitism Venn Diagram, specifically \"Jews owning land,\" \"Jews having power\", and \"Jews specifically being in power over non-Jews\" with a dash of \"there must be a Jewish conspiracy here.\"**\n\n&gt; and resulted in the creation of Israel, which has seen a rise in anti semitism from the left and overall religious tension as, like we have both said before, people conflate the Jewish people with state of Israel. Saying it hasn’t changed as an issue is factually incorrect and I suspect you know that.\n\n**The fact that the left is guilty of antisemitism too is a great point, but it is not a new phenomenon by any means.**\n\n&gt;Furthermore, nothing is lost to you either. If you can’t convince them, well, they’re going to be an anti Semite anyway (as they were before) and will do whatever they would before the altercation. If you convince them or else cause them doubt, they might stop.  \n&gt;  \n&gt;**Essentially, your being a Jew does not mean you instantly understand all issues pertaining to this topic, and it can in fact result in you being blinded to solutions purely by your own indignation and outrage.**\n\n**Ok, I don't like saying things like this, but eff you. Seriously.** \n\n**How about: many non-Jews have great perspective on anti-semitism because they can see or hear about it from Jews, but they, like any group not subjected to a particular type of racism, don't and can't fully understand the depths and forms of that particular racism because it is not a salient and everyday part of their cultural landscape.** \n\n&gt;It takes real mettle to bite the bullet and overcome vitriol to elucidate a rational point calmly, but it is worth the effort to do so, as it defuses tension and change minds, rather than instigate an emotional shouting contest.\n\n**Please stop tone policing me and telling me not to have the valid emotions this topic causes me, or to spare you the expression of them.** \n\n&gt;The way we get past racism is not by strongly categorising everyone by race and religion, but by recognising that that is exactly the problem. We can’t consider people merely a product of their genetics or singular ideology, \n\n**Ok.** \n\n&gt;because all people are then is a representation of those things, and you grow to hate them for things that they haven’t done, may not have considered , or may be in too fragmented a state of mind to ever understand properly. **You don’t see why they believe things, only what they believe, and if you hate that, you hate them as a result.**\n\n**I fully know why they believe what they believe, but you seem to think I'm 100% nonsense and have no facts or understanding about this topic because I've expressed emotion. I \"pass\" where I grew up and have literally been handed white militia propaganda at a state fair. I read the flier. Apparently the Jews are part of a globalist conspiracy to deprive good and true white people of their proper economic due in life. Did you know?** \n\n&gt; People are much more sensible than you might think, if only you are willing to understand them. That means dealing with horrible ideologies and often inhospitable people so you can do something that will be beneficial in the long run.\n\n**Yikes.**", "score": 2, "send_replies": true, "subreddit": "AskReddit", "date_year_month": "2019-06", "created_utc_converted": "2019-06-23 00:59:37", "score_overall": 8, "words": "jewish conspiracy jewish conspiracy jewish jew globalist conspiracy", "shared_words": "jewish conspiracy jew globalist", "socre_distint": 4}
{"associated_award": null, "author": "Malaix", "awarders": [], "body": "pretty much. This is their stand against the gay-jewish-muslim-atheist-Mexican-EU-liberal-commie-vegan-feminist-satanic-fake news-globalist-pedophile-deep state-illuminati.  And I'm only half jesting, thats basically just a conglomeration of all their stupid ideas and reasons.\n\nThey have been brainwashed into thinking everyone who is different than them is in on some massive grand conspiracy to destroy America because they hate God and America or something.", "score": 4, "send_replies": true, "subreddit": "politics", "date_year_month": "2019-06", "created_utc_converted": "2019-06-25 02:39:54", "score_overall": 4, "words": "jewish globalist illuminati conspiracy", "shared_words": "jewish globalist illuminati conspiracy", "socre_distint": 4}
{"associated_award": null, "author": "RealTheAsh", "awarders": [], "body": "He started posting obsessively about the \"neo-palistinians\" (what he calls ashkenazi jews) and encouraging alt-rightism and holocaust denierism in the comments of his blog very often since he posted a so called expose on the Jewish religion (One that is 100% made up_ http://voxday.blogspot.com/2018/07/ron-unz-contemplates-his-childhood.html.\nWhat's amazing about this is that an Orthodox Jewish longtime fan (Shimshon) tried correcting all of Unz's mistakes in the comments and VD just accused him of lying (even when a nother Jew tried to back him up).\n\nThat's the problem. He read some antisemetic work, it confirmed his innermost biases, and if anyone else tries to refte it, they're just part of the conspiracy.\n\nAnother recent example is him calling Yaron Hazony, Dennis Prager and Jonah Goldberg \"Evil\" and \"Demonic\". These are all people who share a similar worldview to him and whom Vox has quoted numerous times in the past and has said he was a big fan of (read his earlier posts -2014 and earlier- about Prager and Jonah Goldberg - he idolized them). But now, simply because they're Jewish, he decided that they must be demonic and satanic.", "score": 2, "send_replies": true, "subreddit": "owenbenjamin", "date_year_month": "2019-06", "created_utc_converted": "2019-06-26 14:25:25", "score_overall": 6, "words": "holocaust jewish jewish jew conspiracy jewish", "shared_words": "holocaust jewish jew conspiracy", "socre_distint": 4}
{"associated_award": null, "author": "NicoleSimpsonCantRap", "awarders": [], "body": "[shitpoppinkreamsays](https://www.reddit.com/r/politics/comments/aqo7mp/trump_to_sign_spending_deal_and_declare_national/eghdfvi/)\n\n***\n\n**The President continues to peddle racist lies as he declares a National Emergency predicated on lies about illegal immigration.**\n\nAccording to the right wing think tank the CATO Institute, President Trump's administration has provided an incredibly misleading narrative about illegal immigration and crime.^[[1]](https://www.cato.org/blog/white-houses-misleading-error-ridden-narrative-immigrants-crime)\n\n&gt;But we should not tolerate the peddling of misleading statistics without context. What matters is how dangerous these subpopulations are relative to each other so the government can allocate resources to prevent the greatest number of murders possible. Thus, enforcing immigration law more harshly is an ineffective way to punish a population that is less likely to murder or commit crimes than native-born Americans. Illegal immigrants, non-citizens, and legal immigrants are less likely to be incarcerated, convicted, or arrested for crimes than native-born Americans are. \n\n&gt;\n\nThe Washington Post compiled statistical charts that indicate the Trump administration is lying when they claim illegal immigration is a crisis. They disprove Trump's lies including immigrants flooding the border (they're not), that they bring crime (they don't), and that they're a drain on the economy (they aren't).^[[2]](https://www.washingtonpost.com/news/wonk/wp/2018/06/21/theres-no-immigration-crisis-and-these-charts-prove-it/?utm_term=.5a93c2cb02fa)\n\n&gt;The administration has said that the country is in danger of being “overwhelmed” by “massive increases in illegal crossings” that will bring “horrible crime,” “unbelievably great taxpayer expense” and the loss of American jobs.\n\nNone of those claims are true.\n\n&gt;...Here's what we can say in conclusion. Current rates of illegal immigration remain extremely low by historic standards. Legal and undocumented immigrants are significantly less likely to commit most crimes than native-born citizens, making them a net benefit to public safety. The research shows that immigrants are not taking jobs away from U.S. natives, and their impact on wages appears to be small to nonexistent, particularly across the long term.\n\n&gt;\n\n**President Trump's rhetoric is incredibly dangerous and is reminiscent of authoritarian leaders who have committed crimes against humanity.**\n\nThe President's rhetoric - his referral to undocumented immigrants as \"infesting\" the United States is incredibly dangerous and it is not the first time he has alluded to white nationalist talking points. First he tweeted it^[[3]](http://www.foxnews.com/politics/2018/06/19/republican-pressure-intensifies-to-end-family-separations-at-border.html) followed by him saying this as a statement during a speech later in the day.^[[4]](http://fox2now.com/2018/06/19/trump-ramps-up-rhetoric-dems-want-illegal-immigrants-to-infest-our-country/) Moreover, former Trump Campaign Chairman Cory Lewandowski went on national television and dehumanized a child with Down Syndrome who had been separated from their family.^[[5]](https://www.washingtonpost.com/news/morning-mix/wp/2018/06/20/womp-womp-outrage-after-corey-lewandowski-mocks-story-of-child-with-down-syndrome-separated-from-parents/?noredirect=on&amp;utm_term=.18f884832b12) President Trump has peddled anti-semetic conspiracies including the conspiracy that a prominent Jew is behind the migrant caravans^[[6]](https://thehill.com/homenews/administration/414171-trump-i-wouldnt-be-surprised-if-soros-were-paying-for-migrant-caravan) that he claims are \"invading\" the country.^[[7]](https://www.pbs.org/newshour/politics/watch-trump-defends-calling-migrant-caravan-an-invasion-ahead-of-midterm-elections) And Fox News has repeated extremely dangerous xenophobic rhetoric that these migrants are bringing diseases with them, they're not.^[[8]](https://www.vox.com/science-and-health/2018/11/1/18048332/migrant-caravan-fox-news-disease-smallpox-outbreaks-vaccines-xenophobia)\n\nSome experts have compared the President's statements to Nazi propaganda.^[[9]](https://www.timesofisrael.com/critics-say-trumps-description-of-immigrants-recalls-nazi-propaganda/)\n\n&gt;Social commentators pointed out that history has shown, particularly before and during the Holocaust, that “infest” — a term almost exclusively used to describe vermin — dehumanizes a population and is often a precursor to murder or genocide.\n\n&gt;“Democrats are the problem. They don’t care about crime and want illegal immigrants, no matter how bad they may be, to pour into and infest our Country, like MS-13,” the president tweeted. “They can’t win on their terrible policies, so they view them as potential voters!”\n\n&gt;One of the most notorious anti-Semitic films produced by Nazi Germany’s Ministry of Propaganda was “Der ewige Jude” (“The Eternal Jew”), with input from propaganda minister Joseph Goebbels.\n\n&gt;The US Holocaust Memorial Museum says that “One of the film’s most notorious sequences compares Jews to rats that carry contagion, flood the continent, and devour precious resources.”\n\n&gt;\n\n**These xenophobic conspiracy theories are incredibly dangerous. Recently a far right conspiracist murdered 11 people in a Synagogue.^[[10]](https://www.nbcnews.com/news/crime-courts/pittsburgh-synagogue-shooting-suspect-threatened-jewish-groups-pushed-migrant-caravan-n925256) The murderer believed in the same xenophobic, racist conspiracies that were being peddled by members of the GOP, President Trump and the American rightwing media sphere.^[[11]](https://www.washingtonpost.com/politics/2018/10/29/how-trumps-conservative-media-helped-mainstream-conspiracy-theory-now-tied-tragedy/?utm_term=.005def0fb638)**\n\n***\n\n1) [CATO Institute - The White House’s Misleading &amp; Error Ridden Narrative on Immigrants and Crime](https://www.cato.org/blog/white-houses-misleading-error-ridden-narrative-immigrants-crime)\n\n2) [Washington Post - There’s no immigration crisis, and these charts prove it](https://www.washingtonpost.com/news/wonk/wp/2018/06/21/theres-no-immigration-crisis-and-these-charts-prove-it/?utm_term=.5a93c2cb02fa)\n\n3) [Fox News - Republican pressure intensifies to end family separations at border](http://www.foxnews.com/politics/2018/06/19/republican-pressure-intensifies-to-end-family-separations-at-border.html)\n\n4) [Fox St. Louis - Trump ramps up rhetoric: Dems want ‘illegal immigrants’ to ‘infest our country’](http://fox2now.com/2018/06/19/trump-ramps-up-rhetoric-dems-want-illegal-immigrants-to-infest-our-country/)\n\n5) [Washington Post - ‘Womp womp’: Corey Lewandowski mocks story of child with Down syndrome separated from parents](https://www.washingtonpost.com/news/morning-mix/wp/2018/06/20/womp-womp-outrage-after-corey-lewandowski-mocks-story-of-child-with-down-syndrome-separated-from-parents/?noredirect=on&amp;utm_term=.18f884832b12)\n\n6) [The Hill - Trump: 'I wouldn't be surprised' if Soros were paying for migrant caravan](https://thehill.com/homenews/administration/414171-trump-i-wouldnt-be-surprised-if-soros-were-paying-for-migrant-caravan)\n\n7) [PBS - WATCH: Trump defends calling migrant caravan an ‘invasion’ ahead of midterm elections](https://www.pbs.org/newshour/politics/watch-trump-defends-calling-migrant-caravan-an-invasion-ahead-of-midterm-elections)\n\n8) [Vox - Fox News says the migrant caravan will bring disease outbreaks. That’s xenophobic nonsense.](https://www.vox.com/science-and-health/2018/11/1/18048332/migrant-caravan-fox-news-disease-smallpox-outbreaks-vaccines-xenophobia)\n\n9) [Times of Israel - Critics say Trump’s talk of immigrants ‘infesting’ US recalls Nazi propaganda](https://www.timesofisrael.com/critics-say-trumps-description-of-immigrants-recalls-nazi-propaganda/)\n\n10) [NBC - Pittsburgh synagogue shooting suspect threatened Jewish groups, pushed migrant caravan conspiracies](https://www.nbcnews.com/news/crime-courts/pittsburgh-synagogue-shooting-suspect-threatened-jewish-groups-pushed-migrant-caravan-n925256)\n\n11) [Washington Post - How the Trumps and conservative media helped mainstream a conspiracy theory now tied to tragedy](https://www.washingtonpost.com/politics/2018/10/29/how-trumps-conservative-media-helped-mainstream-conspiracy-theory-now-tied-tragedy/?utm_term=.005def0fb638)", "score": 3, "send_replies": true, "subreddit": "politics", "date_year_month": "2019-06", "created_utc_converted": "2019-06-26 18:30:18", "score_overall": 12, "words": "conspiracy jew holocaust jew holocaust conspiracy jewish conspiracy jewish jewish conspiracy conspiracy", "shared_words": "conspiracy jew holocaust jewish", "socre_distint": 4}
{"associated_award": null, "author": "cohumanize", "awarders": [], "body": "&gt;Not particularly.\n\nsure they do. do you really want to get into that?\n\n&amp;#x200B;\n\n&gt;Probably. So your argument is that anyone who has ever appeared on RT is an antisemite?\n\nwilliamson has been something of an rt regular. it seems to be his channel of choice to communicate with supporters\n\n&amp;#x200B;\n\n[https://www.haaretz.com/israel-news/.premium-is-vladimir-putin-an-anti-semite-or-friend-of-the-jews-1.5890733](https://www.haaretz.com/israel-news/.premium-is-vladimir-putin-an-anti-semite-or-friend-of-the-jews-1.5890733) :\n\n&amp;#x200B;\n\nAnd while Putin often goes to unusual lengths to show his friendship to the Jews – including donating a month’s salary to the main Jewish community center in Moscow, and periodically visiting it – the use of anti-Semitism by those linked to the Kremlin has continued under his presidency.\n\nMembers of his United Russia party have not been above making various comments about the Jews, including relatively senior members like Doma Deputy Chairman Pyotr Tolstoy, who talked last year of the “descendants of those who in 1917 [jumped with guns out of the Pale of Settlement and proceeded to destroy our churches](https://www.haaretz.com/world-news/europe/jews-still-seeking-to-destroy-churches-russian-lawmaker-implies-1.5491473).”\n\nThe churches are important, since they have played a central role in Putin’s drive to rebuild post-Soviet Russian nationalism. One of the leaders of the Russian Orthodox Church, Bishop Tikhon Shevkunov, who is also rumored to be Putin’s personal confessor, has [claimed that the last czar of Russia was a victim of “ritual murder”](https://www.haaretz.com/jewish/russian-jews-protest-bishop-repeating-anti-semitic-myth-that-jews-killed-czar-1.5627118) – a thinly veiled allusion to the anti-Jewish blood libels of old.\n\nAnti-Semitic priests in the Russian church are far from the only ones trading in these medieval slurs in Putin’s Russia. The main opposition party that remains tolerated, even protected, by the authorities is the Liberal Democratic Party of Russia. This is led by the virulent anti-Semite Vladimir Zhirinovsky, who will be a candidate once again in the presidential elections next Sunday. He doesn’t have a chance in hell of unseating Putin, of course, but the presence of racists like him in the race are useful to allow voters to blow off some steam.\n\nAnd then there’s the Kremlin’s international propaganda channel, Russia Today, which routinely hosts Holocaust deniers and conspiracy theorists as respectable commentators.\n\nThey don’t actually spout anti-Semitism on their broadcasts: They have other outlets to do that, like the fringe website Russia Insider, which recently ran a 5,000-word article titled [“It’s Time to Drop the Jew Taboo.”](https://www.haaretz.com/opinion/.premium-pro-putin-trolls-court-u-s-alt-right-with-hardcore-anti-semitism-1.5770080) RT and other official wings of the Kremlin maintain a minimal distance from this sort of stuff, but the community of xenophobes and anti-Semites who find sanctuary and swear allegiance to Putin’s Russia are his fellow travelers.\n\nPutin may not be an anti-Semite himself. In fact, nearly all of the evidence points in the opposite direction. But he is fine with anti-Semitic allies, as long as they boost his anti-Western narrative. They are an integral part of the cocktail of nationalism, chauvinism and bigotry buttressing Putin’s base at home, and exciting his growing community of supporters on the far left and far right in the West.\n\nLast July, Putin said the allegations about Russian-meddling in the U.S. elections “reminds me of anti-Semitism. A dumb man who can’t do anything would blame the Jews for everything.”", "score": 4, "send_replies": true, "subreddit": "unitedkingdom", "date_year_month": "2019-06", "created_utc_converted": "2019-06-26 19:51:31", "score_overall": 6, "words": "jewish jewish jewish holocaust conspiracy jew", "shared_words": "jewish holocaust conspiracy jew", "socre_distint": 4}
{"associated_award": null, "author": "[deleted]", "awarders": [], "body": "I live in a post-soviet country. My family have told me stories about the horrors of the communist regime, and this shit is exactly what a bolshevik would do: silencing people pointing out their bullshit, damage control, etc. The only difference here is that reddit bans peoples accounts for having a certain political view and communists would send that person to jail or a labour camp.\n\n&amp;#x200B;\n\nDid that one journalist who created the entire conspiracy theory that \"russia hacked the elections\" have a job at one of the tech giants? It would make sense, you need to draw attention to somwhere else when trying to pull something like this. \n\n&amp;#x200B;\n\nAlso the whole calling people nazis thing is quite clearly inciting violence onto the political opposition. Everybody on this earth except actual nazis hate nazis, so what these big companies are doing is inciting violence upon conservative political commentators (off topic but how the fuck can anyone call Ben Shapiro a nazi unironically when he is jewish and had family members who died in the fucking holocaust.) by calling them fascists. Groups like Antifa will immediately try to swarm the accused individuals in public, throw milkshakes at them and in the worst case scenario actually harm somebody. This is an absolutely genius scheme to reach something deeply evil and disgusting.", "score": -7, "send_replies": true, "subreddit": "SubredditDrama", "date_year_month": "2019-06", "created_utc_converted": "2019-06-27 13:35:20", "score_overall": 4, "words": "silencing conspiracy jewish holocaust", "shared_words": "silencing conspiracy jewish holocaust", "socre_distint": 4}
{"associated_award": null, "author": "send_nasty_stuff", "awarders": [], "body": "Kosher has always confused me. One part of my conspiracy brain has always thought that kosher is a way for Jews to avoid poison/trash/fluff that goes into the goyim food supply by a 'merchant' owned food company but that website's theory that it's just a scam to fleece companies out of cash is also a very likely theory. \n\nI wonder if we could do a study where we track how much Jewish owned and operated companies have to pay for kosher certification and how much goy owned companies have to pay.\n\nI would say that if I ever owned a food company I wouldn't pay for some stupid Kosher stamp that's for damn sure.", "score": 2, "send_replies": true, "subreddit": "DebateAltRight", "date_year_month": "2019-06", "created_utc_converted": "2019-06-28 03:24:49", "score_overall": 8, "words": "kosher conspiracy kosher goyim merchant jewish kosher kosher", "shared_words": "kosher conspiracy goyim merchant jewish", "socre_distint": 5}
{"associated_award": null, "author": "ToastedGlass", "awarders": [], "body": "as a jew born and raised living among conservative ashkenazic jews  i can say god was dead well before,  the argument just went cold after. Now, we openly discuss the origin stories of our god- the destruction of an imagined pantheon and the creation of the modern concept of god.  \n\nhow do you explain a just god when you’re raised knowing the crimes of the universe?  how can parents tell children after 10 “we keep kosher because we were chosen to” when the child asks “were we chosen for the holocaust too?”  \n\ni was taught yiddish and my hebrew letters by a  survivor- she lost her sister but bore the tattoos.  she didn’t believe in anything but the idea that growing children need love and to feel like they belong.  she used to smile when the kids would dance, but rarely otherwise. \n\nedit -\ni should note that my reformed buddies were raised in a more mild  jewish environments and had had much more loose and spiritual interpretation. this let them be flexible in reconciling the less palatable  parts of god.", "score": 142, "send_replies": true, "subreddit": "books", "date_year_month": "2019-06", "created_utc_converted": "2019-06-28 16:36:10", "score_overall": 4, "words": "jew kosher holocaust jewish", "shared_words": "jew kosher holocaust jewish", "socre_distint": 4}
{"associated_award": null, "author": "klauszen", "awarders": [], "body": "One thing is to hate jews (anti semitic) and other thing is to question history and ask why they have been persecuted so much. Why would you say this happened so many times across the centuries? \n\nI say the common factor is that judaism is separatist, and foreign cultures see them as other. And when a catastrophe struck, they're at hand to blame. While others blend in and disappear, they stand out and are easily aprehensable. Also, their cultural success is a source of envy, so one could get two birds with one stone: sacrifice the scapegoat and get all the cheese.\n\nAbout the holocaust, the ones to blame are not the jews but rather the victors of the WWI. They pushed Germany too hard, too taxing war retributions. Germans needed money and easy, quick answers. * Does Eric Cartman voice * And who got money? Why, the jews of course! They even reunite themselves time to time. It was a clear case of giving a dog a bad name and hanging it. \n\nSame happened with the spanish jew, the muranos. Shakespeare took a photo of this phenomenon on \"The Merchant of Venice\" (which had a bad ending: Shylock should have been able to retract and take the money. Jessica bought her freedom, Shylock got his money back, Lorenzo got his exotic wife and *all* happy) . \n\nBesides, I'd not ask to change your *religion* but rather the cultural approach to foreigners. Hebrews are part of the modern world. On a normal circumstance I'm sure we could have a conversation as peers about any other topic. In fact I do enjoy these reddit debates. We're at the same level. None is in a high horse preaching how the other is inferior. I never said jews are inferior, but rather they've been too spicy on the past. And now they've watered down a bit, a welcomed change.", "score": 0, "send_replies": true, "subreddit": "HistoryMemes", "date_year_month": "2019-06", "created_utc_converted": "2019-06-28 18:42:46", "score_overall": 4, "words": "scapegoat holocaust jew merchant", "shared_words": "scapegoat holocaust jew merchant", "socre_distint": 4}
{"associated_award": null, "author": "MontyPanesar666", "awarders": [], "body": "What are you arguing with him over? Whether Solzhenitsyn was antisemitic?\n\nLobsters tend not to have heard of Solzhenitsyn before Peterson came along, but he's been the posterboy for conservative intellectuals since the 1970s. An apartheid loving, uber Christian (or Russian Orthodox) who fawned over Franco and other fascists, he's always attracted a certain type. Indeed, it's telling that before Peterson wrote a forward for \"The Gulag Archipelago's\", the previous forwards were by psychos from the Hoover Institution, and other big business think tanks.\n\nMeanwhile, here are actual historians on Peterson's favorite bash-a-~~Jew~~\\-commie author:\n\n\"Historian [Yohanan Petrovsky-Shtern](https://en.wikipedia.org/wiki/Yohanan_Petrovsky-Shtern)  of Northwestern University published a refutation of Solzhenitsyn's  claims and has accused him of anti-Semitism.  \\[...\\] Solzhenitsyn falsely  claims Jews were overrepresented in the early [Bolshevik](https://en.wikipedia.org/wiki/Bolshevik)   leadership and the security apparatus, without citing his sources.  \\[...\\] Historian Richard Pipes has accused Solzhenitsyn's nationalism of  preventing him from being fully impartial, and that Solzhenitsyn uses  outdated  and inadequate sources. Pipes asserts that Solzhenitsyn failed  to  consider the \"poisonous atmosphere in which Jews lived for  generations  in the Russian empire (an atmosphere originating in Russian  Orthodox and  nationalist circles)\".\n\n\\[...\\] Solzhenitsyn was accused by the [Northwestern University](https://en.wikipedia.org/wiki/Northwestern_University) historian [Yohanan Petrovsky-Shtern](https://en.wikipedia.org/wiki/Yohanan_Petrovsky-Shtern)   of using unreliable and manipulated figures, while ignoring evidence   unfavorable to his own point of view and, in particular, ignoring   numerous publications of reputable authors in Jewish history. Petrovsky  says that Solzhenitsyn claims that Jews promoted alcoholism  among the  peasantry, flooded the retail trade with contraband, and  \"strangled\"  the Russian merchant class in Moscow. He says that according to  Solzhenitsyn, Jews are parasitic, non-producing people (\"непроизводительный народ\")  and refuse to engage in factory labor. They are averse to agriculture  and unwilling to till the land either in Russia, in Argentina, or in  Palestine, and the author blames the Jews' own behavior for pogroms. He  says that Solzhenitsyn also claims that Jews used [Kabbalah](https://en.wikipedia.org/wiki/Kabbalah)  to tempt Russians into heresy, seduced Russians with rationalism and  fashion, provoked sectarianism and weakened the financial system,  committed murders on the orders of [qahal](https://en.wikipedia.org/wiki/Qahal)  authorities, and exerted undue influence on the prerevolutionary  government. Petrovsky summarizes his critique by stating that \"*200 Years Together* is destined to take a place of honor in the canon of russophone antisemitica.\"\n\n\\[...\\] A critical analysis was published by historian [Semyon Reznik](https://en.wikipedia.org/wiki/Semyon_Reznik).   According to Reznik Solzhenitsyn condones repressive measures  against Jews, and justifies them as intended for protection of the  rights of Russians  as the [titular nation](https://en.wikipedia.org/wiki/Titular_nation)   that supposedly \"greatly suffered from Jewish exploitation, alcohol   mongering, usury and corruption of the traditional way of life\".\n\n\\[...\\] Historian and demographer Sergey Maksudov referred to Solzhenitsyn's work as  \"a piece of pseudoscientific essayism\", which promulgates numerous   antisemitic stereotypes of Jews as professional parasites, infiltrators   into the Russian culture, and portrays repressive policies toward Jews   as being \"in Jews' own interests\". Maksudov also claims that   Solzhenitsyn was insensitive toward Jewish sufferings during [pogroms](https://en.wikipedia.org/wiki/Pogrom) in general, and the [Kishinev pogrom](https://en.wikipedia.org/wiki/Kishinev_pogrom) in particular, and also accuses Solzhenitsyn of denying many well documented atrocities.\n\n\\[...\\] [John Klier](https://en.wikipedia.org/wiki/John_Klier), a historian at [University College London](https://en.wikipedia.org/wiki/University_College_London),  writes that in his account of the pogroms of the early 20th  century,  Solzhenitsyn is far more concerned with exonerating the good  name of  the Russian people than he is with the suffering of the Jews,  and he  accepts the tsarist government's canards blaming the pogroms on   provocations by the Jews themselves. \\[...\\] A detailed analysis of *THYT* and an overview of critical opinion thereon was published by the [University of Waterloo](https://en.wikipedia.org/wiki/University_of_Waterloo)   professor Zinaida Gimpelevich. According to Gimpelevich, the critical   opinion worldwide overwhelmingly tilts against Solzhenitsyn.\n\n\\[...\\] [Grigory Baklanov](https://en.wikipedia.org/wiki/Grigory_Baklanov), a Russian novelist, in his critical study described Solzhenitsyn's work as \"worthless as historical scholarship\". Baklanov, himself a [World War II](https://en.wikipedia.org/wiki/World_War_II)   veteran, focuses on Solzhenitsyn's insistence on Jews' supposed  wartime  cowardice and unwillingness to face the enemy, which he says is   contradicted both by the statistics of Jewish frontline casualties and   by the high number of Jews decorated for bravery in battle.\n\n\\[...\\] Literary historian [Leonid Katsis](https://en.wikipedia.org/w/index.php?title=Leonid_Katsis&amp;action=edit&amp;redlink=1)   accuses Solzhenitsyn of numerous manipulated and selective quotations   in the first volume of the book, detrimental to its trustworthiness.  Cultural historian and comparatist Elisa Kriza discusses THYT in an   article about anti-Semitism in Solzhenitsyn's works and explains how   Solzhenitsyn's accusations towards Jewish people as a group and his   treatment of Russian Jews as \"foreign\", despite being in Russia for two   hundred years, are evidence of anti-Semitic rhetoric in the book.\n\n\\[...\\] Historians Leybelman, Levinskaya, and Abramov claim that  Solzhenitsyn uncritically used writings of antisemitic pseudo-historian [Andrey Dikiy](https://en.wikipedia.org/wiki/Andrey_Dikiy) for his inflated statistical data of Jewish participation in the early Soviet government and its security apparatus.\n\n[Mark Deutch](https://en.wikipedia.org/wiki/Mark_Deutch),  in a two-part review titled \"A Shameless Classic\" (\"Бесстыжий  классик\"),lists numerous drawbacks, stemming, in his opinion, from  biased  exposition, ignoring well-known sources, self-contradictions,  and  factual errors.\"\n\nAnd [Saul Jay Singer](https://www.jewishpress.com/author/saul-jay-singer/): \"Textological experts concluded that *Two Hundred Years Together* and a vile anti-Semitic essay titled *Jews in the USSR and in the Future Russia* were incontestably written by Solzhenitsyn . \"\n\n&amp;#x200B;\n\netc etc.\n\nBut I mean, you're on a board dedicated to a guy who lies about scientific studies (studies written by authors who diss him), quotes studies by race realists without telling his audience who the authors are, and retweets/interviews self described white nationalists.", "score": 5, "send_replies": true, "subreddit": "JordanPeterson", "date_year_month": "2019-06", "created_utc_converted": "2019-06-28 19:21:39", "score_overall": 9, "words": "jew jewish merchant jewish jewish cowardice jewish jewish jewish", "shared_words": "jew jewish merchant cowardice", "socre_distint": 4}
{"associated_award": null, "author": "200iqBigBrain", "awarders": [], "body": "&gt;Be honest: you can barely tolerate me even using the word liberal so many times in a few sentences, because to you it’s such a toxic word. Liberals repulse you. They are barely even human, and definitely un-American, right? You think liberals are everything that is wrong with America. Liberals are wrong, bad and evil. Evil demons. America would be a much better place without liberals, right?\n\n&gt;The hatred and disgust you feel for liberals are exactly the same feelings the Nazis felt for Jews.\n\n&gt;You use terms like liberals, libtards, demoncrats and demon rats as vicious slurs, to demonize and dehumanize liberals in exactly the same way Nazis demonized and dehumanized Jews.\n\nLiberals in 2019 are persecuted just like Jews if u think about it. Way to show the chuds. Don’t we always hear about how political ideologies aren’t protected classes whenever righties whine about being “persecuted?”\n\n&gt;They thought they were the victims. So do you.\n\nAs we all know, American liberals absolutely do not have a victimhood complex.\n\n\n&gt;Just like you believe the United Nations is a globalist anti-American conspiracy, lead by an evil Jew named George Soros.\n\nThe people who want to arm the shit out of the only Jewish nation actually want to exterminate them.\n\n&gt;Catholics are not “different” from Christians. Catholics are the original Christians. Evangelicals are just a splinter group that started with a German protestant preacher called Martin Luther.\n\n&gt;Most Christians on the planet think of American Evangelicals as a malignant, misguided cult, not true followers of Christ.\n\nlmao shilling for Catholicism of all things on reddit and getting fellated for it. I’m legitimately impressed.\n\n&gt;The Nazis were God-fearing Christians who followed the teachings of the same Martin Luther that you follow. Hitler frequently claimed that everything he did was God’s will:\n\nAnd he also pissed on the church all the time. You wouldn’t accuse Hitler of lying for his own benefit, would you?\n\n\n\n&gt;Connect. the. dots.\n\n&gt;Is any of this sinking in yet?\n\n&gt;Or do you need more time?\n\n&gt;Take all the time you need.\n\nThis person absolutely would have turned out better if they were bullied at least a little more\n\n&gt;The KKK’s slogan was “America first.” Trump’s slogan is “America first.”\n\n…His slogan is MAGA. Does anyone not know that? Jesus Christ. America First is what daddy called a policy.\n\n&gt;More and more children keep dying in US custody. That never happened under Obama.\n\nThey did but literally nobody cared because Republicans are okay with that and Democrats fell in line\n\n&gt;Trump is literally persecuting Christians. Trump is locking Christian children in cages.\n\nConsidering that we just accepted that Christians are Nazis, this is a good thing.\n\n&gt;Oh, and you know how Fox News always says the Nazis were anti-gun?\n\n&gt;That’s a lie, too.\n\nThe Nazis just restricted gun ownership by minorities and political rivals, which is obviously in the spirit of the second amendment that Faux Snooze argues for. This guy is seriously arguing that anyone who wants to fight civilian gun restrictions is on the same team as the Nazis, despite probably thinking the US is fascist.\n\n&gt;Want to know more? Read my book. It will blow your mind. I promise.\n\nIt’s all so tiresome", "score": 52, "send_replies": true, "subreddit": "Drama", "date_year_month": "2019-06", "created_utc_converted": "2019-06-29 19:09:59", "score_overall": 4, "words": "globalist conspiracy jew jewish", "shared_words": "globalist conspiracy jew jewish", "socre_distint": 4}
{"associated_award": null, "author": "FormerlyPallas_", "awarders": [], "body": "Jewish friends are in despair about the Labour party’s decision to readmit an MP who has repeatedly defended and endorsed candidates with a long history of anti-Semitism. He has downplayed and dismissed the experience of Jewish members who have experienced racism, and to date remains unapologetic. His behaviour has been described by many Jewish members as “Jew-baiting”. Their concerns have been denied.\n\nOn Friday evening the party suspended the whip again, but this chain of events has prompted serious charges of political interference. The committee that ruled on readmitting Chris Williamson was convened as Labour prepares to select candidates for an anticipated general election, last minute changes were made to the panel, and one of its members later called for his own decision to be overturned. Call it conspiracy or call it chaos — this is now an existential threat to Labour.\n\nRacism is a disease. It does not exist in pockets. Unchallenged, it spreads and finds roots. In recent months, we have seen a rise in anti-Semitic attacks in the UK, a murder in France, attacks on synagogues in Sweden and the US and fascists on the march in ​Poland. As one Jewish constituent wrote to me, “people are really frightened”.\n\nSo often in history, Labour has been the hope for people who faced racism and one of the key agents in its defeat. For me, that is not historical fact; it is personal. My father was part of the small group of people who, facing that systematic discrimination himself, set up the Campaign against Racial Discrimination, wrote the Race Relations Act 1976 and established the Equal Opportunities Commission: this has had real, tangible benefits for me and my generation.\n\n\nThe Labour party ought to be a light on the hill for people in times of darkness but there is, as the chief executive of the Holocaust Educational Trust put it, “a blind spot” among some sections of the left when it comes to anti-Semitism.\n\nWhat do Holocaust denial, references to financiers of the sugar and slave trades and the horrific mural that depicted Jewish bankers profiting off the backs of the poor have in common? It is the demonisation of Jewish people as somehow wielding illegitimate power, which allows its proponents to deny any suffering — especially suffering on the scale of the Holocaust. It is a form of racism that instead of looking down, looks up and argues that this group is a legitimate target for a left that exists to fight oppression in all forms. That form of anti-Semitism in our party demands to be recognised.\n\nWe have no right to pick and choose the type of racism we confront.\n\nTo deal with all this demands concrete action. That is why this week’s decision has been met with so much despair from Labour members, MPs and party staff. Last year Labour adopted a gold-standard definition of anti-Semitism. If it is to mean anything, it must be upheld. Resolving the reportedly thousands of complaints that are waiting to be heard and reinstating the longstanding and effective training for members that was cancelled this year are not optional extras.\n\nAs the Labour prime minister Harold Wilson once said, “the Labour party is a moral crusade or it is nothing”. Most Labour party members, like me, joined the party because we abhor racism and discrimination every bit as much as we abhor poverty and oppression. We should empower our members to recognise, challenge and act on concerns because we are a party that seeks not just to run society, but to change it, and that places on us a particular responsibility to lead.\n\nThose things, taken together, would create a culture in which anti-Semitism could find no fertile ground. Anti-Semitism tells us that something is rotten in society. It is not enough for us to decry the shrill, sour, hopeless dog-whistle politics that we have heard from the Conservative party in recent years; we have to be better. We have to act.\n\nThe writer is Labour MP for Wigan", "score": 1, "send_replies": true, "subreddit": "ukpolitics", "date_year_month": "2019-06", "created_utc_converted": "2019-06-30 12:47:22", "score_overall": 11, "words": "jewish jewish jewish jew conspiracy jewish holocaust holocaust jewish jewish holocaust", "shared_words": "jewish jew conspiracy holocaust", "socre_distint": 4}
