{"archived": false, "author": "Micosilver", "body": "OK, how about we step down from a soap box and try to have a real conversation?\nAs a Jew - I assume that everybody is a genocidal monster, that's what history taught us. For Jews it is not projection and bias, this is survival. I personally fully support the two state solution, the problem is that there is nobody to talk to, and some of Palestinian demands are non-starters: there will be no right to return to Israel for 5 million Palestinians living in Arab countries. If Palestinians drop this demand there is a chance.\nOn the other hand all Jewish settlements in the West Bank create bad faith, so neither side is perfect.\n\nArafat being murdered is a conspiracy theory, and if you get down to that level - we just can't have a conversation.\n\nI would also be fine with US being a Jewish state - just offer citizenship to every Jew, problem solved. You know, just like they could have prevented Holocaust back in 1938.\n\nIf Jordan takes control over the West Bank - nobody gets cleansed. the 2.5 million Palestinians simply join the other millions already under Jordan without leaving their couches.", "score": 2, "send_replies": true, "subreddit": "JordanPeterson", "date_year_month": "2018-12", "created_utc_converted": "2018-12-01 22:52:49", "score_overall": 6, "words": "jew jewish conspiracy jewish jew holocaust", "shared_words": "jew jewish conspiracy holocaust", "socre_distint": 4}
{"archived": false, "author": "OneReportersOpinion", "body": "&gt; OK, how about we step down from a soap box and try to have a real conversation? \n\nPlease. \n\n&gt;As a Jew - I assume that everybody is a genocidal monster, that's what history taught us. For Jews it is not projection and bias, this is survival. \n\nI’m also a Jew. I understand genocide as a function of power. I live in the United States, probably the safest place for Jews in 2000 years. Jewish immigrants as early as the mid-1800s viewed America as their Zion, with good reason. Genocide is a function of power. So when I assess the threat of genocide, I look and see who holds the power. Who holds the power in the region in which Israel is located? Not the forces that are counter to Israel.\n\n&gt;I personally fully support the two state solution, the problem is that there is nobody to talk to, \n\nThat’s simply not true\n\n\n&gt;and some of Palestinian demands are non-starters: there will be no right to return to Israel for 5 million Palestinians living in Arab countries. \n\nNot true. [“And, while they insisted on recognition of the refugees' right of return, they agreed that it should be implemented in a manner that protected Israel's demographic and security interests by limiting the number of returnees. No other Arab party that has negotiated with Israel -- not Anwar el-Sadat's Egypt, not King Hussein's Jordan, let alone Hafez al-Assad's Syria -- ever came close to even considering such compromises.”](https://www.nytimes.com/2001/07/08/opinion/fictions-about-the-failure-at-camp-david.html) \n\n&gt;If Palestinians drop this demand there is a chance.\n\nGiven that they have, as of 18 years ago, what do you say now?\n\n&gt; Arafat being murdered is a conspiracy theory, and if you get down to that level - we just can't have a conversation.\n\nNot really. \n\nhttps://www.cnn.com/2013/11/07/world/meast/arafat-death-probe/index.html?no-st=9999999999\n\nhttps://www.washingtonpost.com/world/middle_east/was-yasser-arafat-killed-by-polonium-poisoning/2013/11/06/bada9e82-472c-11e3-95a9-3f15b5618ba8_story.html?utm_term=.cbbae88eb45c\n\n&gt; I would also be fine with US being a Jewish state - just offer citizenship to every Jew, problem solved. You know, just like they could have prevented Holocaust back in 1938.\n\nCertainly. Also see Michael Chabon’s fascinating alternative history novel the Yiddish Policemen’s Union. \n\n&gt; If Jordan takes control over the West Bank - nobody gets cleansed. the 2.5 million Palestinians simply join the other millions already under Jordan without leaving their couches.\n\n1) That was not Shapiro’s solution. He wanted Palestinians, including Arab Israelis, moved to Jordan. \n2) That’s a violation of their rights. They have a guaranteed right to self-determination. They should make that decision. You are then dividing them from their families in Gaza. You also dilute the Palestinians’ political constituency. Jordanians and Palestinians have their own distinct histories and political interests. \n\n", "score": 5, "send_replies": true, "subreddit": "JordanPeterson", "date_year_month": "2018-12", "created_utc_converted": "2018-12-01 23:54:17", "score_overall": 7, "words": "jew jew jewish conspiracy jewish jew holocaust", "shared_words": "jew jewish conspiracy holocaust", "socre_distint": 4}
{"archived": false, "author": "Sizzle50", "body": "The intrepid journalists at BuzzFeed have broken a new story on the bleeding edge of our total meme war:\n\n[Celebrities Say White Supremacists Used A New Video App To Trick Them Into Endorsing Anti-Jewish Conspiracy Theories](https://www.buzzfeednews.com/article/ellievhall/celebrities-white-supremacists-video-app-cameo-anti-semitic) (trimmed for the sake of brevity)\n\n&gt;A group of white supremacist YouTubers are using a new app to pay celebrities to create videos where they make coded anti-Semitic statements — and then the YouTubers use those recordings to promote hatred on the internet. The videos were made using [Cameo](https://www.nytimes.com/2018/08/01/arts/cameo-nikki-blonsky-now-you-can-just-pay-celebrities-to-say-stuff.html), where users can pay to have celebrities record a personalized message for them. Cameo launched in April 2018, and has become another platform that the far-right has seized upon in an attempt to legitimize racist messages — this time with seeming celebrity endorsements.  \n&gt;  \n&gt;The group behind the videos refers to itself as the GDL, or Goyim Defense League, using the Hebrew word for a non-Jew. The group is apparently run by two YouTubers who go by “Handsome Truth” and “Sway Guevara.”  \n&gt;  \n&gt;In one recent video, former Green Bay Packers quarterback Brett Favre — one of the NFL’s most legendary figures — addresses the group:  \n&gt;  \n&gt;“Brett Favre here with a shoutout to the Handsome Truth and the GDL boys,” Favre says in the shaky video. “You guys are patriots in my eyes. So keep waking them up and don’t let the small get you down. Keep fighting, too, and don’t ever forget the USS *Liberty* and the men and women who died on that day. God bless and take care.”  \n&gt;  \n&gt;The video is loaded with coded anti-Semitic language. For example, “small” stands for “small hats,” a slur for yarmulkes. The USS *Liberty* is a dog whistle referring to an incident in 1967 where Israeli forces fired on the US spy ship, [killing 34](https://www.arlingtoncemetery.mil/Explore/Notable-Graves/Casualties-of-War-and-Honorary-War-Veterans/USS-Liberty), during the Six-Day War. In the aftermath, Israel said that its pilots had thought the ship was an Egyptian vessel, and apologized — the government eventually paid out [$6.7 million](https://www.chicagotribune.com/chi-liberty_tuesoct02-story.html) in reparations to the survivors and families of the dead. Ever since, there have been unproven conspiracy theories surrounding the circumstances that question whether the attack was intentional. Both the Israeli and the United States governments have said that it was [a case of mistaken identity](https://www.washingtonpost.com/archive/lifestyle/2003/02/01/the-attack-on-liberty/593e6872-aa67-422a-b24a-e5cebecb3cd6/?utm_term=.22479767c095).  \n&gt;  \n&gt;Comedian Andy Dick also made a personalized message for another member of the GDL, who goes by the name “Sway Guevara” on YouTube. According to the prices on [Dick’s Cameo page](https://www.cameo.com/andydick), it cost $99.  \n&gt;  \n&gt;“Hey, Sway, shoutout to the GDL, hope you guys keep up the great work. Remember what happened that day on the USS *Liberty*. And keep our military troops—”  \n&gt;  \n&gt;The video cuts off at this point. It’s unclear what prompted Dick to leave the message seemingly unfinished.  \n&gt;  \n&gt;Rapper Soulja Boy also appears to have inadvertently made a video for the anti-Semitic group.  \n&gt;  \n&gt;“Shoutout to Handsome Truth and Sway at GDL,” he says in the video, before telling viewers to check out their new single “Name the Juice” on [Soundcloud](https://soundcloud.com/goyimdefenseleague/name-the-jew-sway-guevara-ft-ht-gdl) and to subscribe to Handsome Truth 14 on YouTube. “GDL for life, bitch.”\n\nAll celebrities mentioned in the article have apologized and renounced the Goyim Defense League, but it's interesting to see how the trend of duping celebrities into seemingly endorsing wanton 4channery is evolving. I'm reminded of [Jordan Peterson](https://pbs.twimg.com/media/Dd-gx2VV0AECZ8l.jpg:large) being raked over the coals for posing for a picture with a Pepe flag and, more recently, [Mike Pence](https://www.cnn.com/2018/11/30/politics/mike-pence-photo-op-sheriffs-deputy-qanon/index.html) doing a photo op with a LEO adorned with Q-Anon patches\n\nI never thought they would manage to beguile Soulja Boy, though\n\nThis is deeply unsettling", "score": 31, "send_replies": true, "subreddit": "slatestarcodex", "date_year_month": "2018-12", "created_utc_converted": "2018-12-02 01:27:35", "score_overall": 7, "words": "jewish conspiracy goyim jew conspiracy jew goyim", "shared_words": "jewish conspiracy goyim jew", "socre_distint": 4}
{"archived": false, "author": "Morthra", "body": "&gt; Having a Jewish State is problematic, because it does imply that even if you're country is 100% a jewish population, priority goes to Jews nonetheless.\n\nIs it? The whole *point* of Israel is for it to be a Jewish state where Jews are the ethnic majority, because without exception, Jews are persecuted when they aren't, and this goes all the way back to the Babylonians, who destroyed the First Temple (the most important spiritual site to the Jews) in 587 BCE, and in the second century CE the Romans expelled the Jews from the region along with a huge spike in antisemitism among the Romans. \n\nJews didn't fare better in Europe either. On the tail end of the 6th century CE, the Visigoths (in what is now Spain), with support from the Catholic Church forbade Jews from marrying Christians, practicing circumcision, and observing Jewish holy days. In the decades that followed, Jews in the region were subject to forced conversion, slavery, exile, and execution.\n\nBetween the 9th century and 11th century the Jews lived as second class citizens in Spain (and the rest of the Muslim world), ending with several Muslim pogroms on the Iberian Peninsula, and decrees ordering the destruction of synagogues were enacted in Egypt, Syria, Iraq, and Yemen. Jews were forced to convert at sword point.\n\nDuring the Middle Ages persecution of the Jews was commonplace through blood libels (the belief that Jews use the blood of children to make matzo), exile, forced conversion, and outright genocide.\n\nThe Crusades didn't spare the Jews either. Hundreds to thousands of Jews were killed *by crusaders* in the First Crusade, which is what was cited by Zionists in the 19th century (which is when it first began as a movement) as the primary indicator of a need for a state of Israel. The Jews in Germany would later find themselves massacred during the Second Crusade in 1147, the Shepherds' Crusades of 1251 and 1320, and following that, the all Jews in England were banished, and 100,000 were banished in France. Most of the Jews such banished went to Poland.\n\nThen during the spread of the Black Plague through Europe during the 14th century, the Jews were made out to be a scapegoat (stating that the Jews deliberately caused the disease by poisoning wells), and while the Pope at the time was sympathetic, he was unable to stop nearly a thousand Jews being burned alive in Strasbourg alone.\n\nThis antisemitism was brought over to the colonies that would later become the US. The governor of New Amsterdam (now New York) created and implemented plans to prevent Jews from entering the city, and during the Colonial Era, the American government limited the political and economic rights of Jews. It wasn't until America gained its independence that Jews gained any legal rights.\n\nThen in the late 18th century the Russians, under Catherine the Great, banished their Jewish population to what is now Poland. Due to the high concentrations of Jews (and the fact that they were still part of Russia) pogroms and anti-Jew riots were common.\n\nIt wasn't until the Jews were slaughtered in the Holocaust that the world finally realized that yeah, something like this was bound to happen when Jews were an ethnic minority due to the fact that they tend to be insular and don't integrate into the local culture. Up until the establishment of Israel as a Jewish state, there was literally no nation in the world whose people didn't hate the Jews - and this had been the case for over 1000 years.\n\n&gt; Therefore, the only real solution is to get people on either side to expulse their extremist fringe elements who want to annihilate the other, and come to some sort of agreement that will let both communities live in peace, together. \n\nYou know what a better solution would be? For the Arab nations around Palestine, like Egypt, to accept Palestinian refugees, then kick all the Palestinians out of Gaza and the West Bank. Because antisemitism is culturally ingrained in pretty much all Palestinians, letting them into Israel en masse will just invite them to pass laws to persecute the Jews unless Israel turns into an apartheid state.", "score": 6, "send_replies": true, "subreddit": "changemyview", "date_year_month": "2018-12", "created_utc_converted": "2018-12-02 08:29:11", "score_overall": 9, "words": "jewish jewish jewish jewish scapegoat jewish jew holocaust jewish", "shared_words": "jewish scapegoat jew holocaust", "socre_distint": 4}
{"archived": false, "author": "randomredditor12345", "body": "part 4\n\n&gt;20\n\nדיני לקיחת ומכירת טלית. ובו ב סעיפים:\nהלוקח טלית מצוייצת מישראל או מתגר עכו\"ם [ואומר שלקחן מישראל נאמן] [נ\"י הלכות ציצית] כשר דכיון דתגר הוא חזקה שלקחה מישראל דלא מרע נפשיה אבל אם לקח מעכו\"ם שאינו תגר פסול':\n\nOne who buys a tallit with tzitzit on it from a Jew or from a non-Jewish merchant Rema: and he says that he bought it from a Jew, and he's believed (N\"Y laws of tzitzit) it is valid, because since he's a merchant there's a presumption [that he's telling the truth and] that he bought it from a Jew because he wouldn't do bad to himself (and ruin his career by lying to customers). But, if one bought it from a non-Jew that's not a merchant, it is invalid.\n\nאין מוכרין טלית מצוייצת לעכו\"ם שמא יתלוה עם ישראל בדרך ויהרגנו אפי' למשכן ולהפקיד טלית מצוייצת לעכו\"ם אסור אא\"כ הוא לפי שעה דליכא למיחש להא:\n\nOne can not sell a tallit with tzitzit on it to a non-Jew because maybe he will [wear it, pretending to be a Jew, and] accompany a Jew on the road and kill him. Even to use as collateral and to deposit a tallit with tzitzit on it to a non-Jew is forbidden, unless it's for a short time since then there's nothing to worry about.\n\n&gt;[32](https://www.sefaria.org/Shulchan_Arukh%2C_Orach_Chayim.32.1-52?lang=bi&amp;with=all&amp;lang2=en)\n\nסדר כתיבת התפילין ובו נב סעיפים:\nמצות תפילין שיכתוב ארבע פרשיות שהן קדש לי כל בכור עד למועדה והיה כי יביאך עד כי בחוזק יד הוציאנו ה' ממצרים ופ' שמע עד ובשעריך ופ' והיה אם שמוע עד על הארץ: הגה וצריך לכתבם בסדר הזה לכתוב תחלה הקודמת בתורה ואם שינה פסול ולכתחלה יכתוב של יד קודם של ראש.\n\nThe commandment of \"Tefillin\" is to write four passages i.e. \"Kadesh\" until \"m'yamim yamimah\"(Exodus 13:1-10); \"v'haya\" until \"mimitzrayim\" (ibid 11-16); \"Sh'ma\" until \"uvish'arekha\" (Deuteronomy 6:4-9) and \"v'haya\" until \"al ha'aretz\" (ibid 11:13-21) Note: They must be written in this order, that is the order they appear in the Torah and if [the scribe] deviates from this order [the tefillin] are invalid. Ideally the arm-tefillin should be written before the head-tefillin.\n\nבשל ראש יכתוב כל אחת בקלף לבדה ושל יד כותב כולם בקלף אחד:\n\nThe head [tefillin] should be written each [parasha] on its own parchment and the arm [tefillin] should be written all [four] of them on a single piece of parchment.\n\nיכתבם בדיו שחור בין שיש בו מי עפצים בין שלא במי עפצים: הגה ולכתחלה יחמיר לכתוב בדיו העשויה מעשן עצים או שמנים שרוי' במי עפצים [מהרי\"ל סי' קי\"ט] וכמו שיתבאר ביו\"ד סי' רע\"א כתב אפי' אות א' בשאר מיני צבעונים או בזהב הרי אלו פסולין. אם זרק עפרות זהב על האותיות מעביר הזהב וישאר כתב התחתון וכשר אבל אם זרק הזהב על אות מאזכרה אין לו תקנה לפי שאסור להעביר הזהב משום דהוי כמוחק את השם:\n\nThey should be written in black ink, whether or not the ink contains gallnut juice (tannic acid). Note: It is preferable to be careful to write only with ink made of wood- or oil- smoke soaked in gallnut juice and see also Y\"D 271. If he wrote even one letter in a different color the tefillin are invalid. If he gilded the letters, he can remove the gold and leave the bottom letters and the tefillin will be valid but if he gilded one of the Divine Names there is no solution because removing the gold would constitute erasing a Divine Name [which is forbidden].\n\nצריך שלא תדבק שום אות בחברתה אלא כל אות תהיה מוקפת גויל: הגה ויכתוב כתיבה תמה שלא יחסר אפי' קוצו של יו\"ד ויהא מתוייג כהלכתו [טור א\"ח] ולכתחלה יכתוב כתיבה גסה קצת שלא יהיו נמחקים מהרה וכן מצוה ליפותן מבחוץ ומבפנים: [דברי מרדכי]:\n\nNo letter may touch another; rather each letter must be completely surrounded by parchment. Note: And he must write [in a] uniform script which does not miss even the serif on one yud, and has the ornamentation required by halacha. It is preferable to write a little boldly so [the writing] will not fade quickly. Similarly it is meritorious to make them as nice as possible both inside and out.\n\nצריך שיכתוב בימינו אפילו אם הוא שולט בשני ידיו ואם כתב בשמאל פסול אם אפשר למצוא אחרים כתובים בימין ואיטר יד שמאל דידיה הוה ימין:\n\nEven an ambidextrous person must write with his right [hand] and the tefillin are invalid if he wrote with his left. [However] a left-handed person's left hand is considered his [and the laws are reversed].\n\nאין (צריך) לשרטט כי אם שטה עליונה ואם אינו יודע ליישר השטה בלא שרטוט ישרטט כל השורות ולא ישרטט בעופרת מפני שמקו' השרטוט נשאר צבוע: הגה וי\"א שצריך לשרטט תמיד למעלה ולמטה ומן הצדדים אע\"פ שיודע לכתוב בלא שרטוט וכן נוהגין. [ברוך שאמר מרדכי וספר תרומה וסמ\"ג]:\n\nOne must only score the top line unless he cannot write straight without it in which case he just score all the lines. The scoring should not be done with lead so as not to leave a colored mark Note: Some say one must always score every line and mark the margins the same way even if he can write without it, and such is the custom.\n\nהלכה למשה מסיני תפילין על הקלף ולא על הדוכסוסטוס ולא על הגויל. כותבין על הקלף במקום בשר ואם שינה פסול מהו קלף ומהו דוכסוסטוס העור בשעת עיבודו חולקין אותו לשני' והחלק החיצון שהוא לצד השער נקרא קלף והפנימי הדבוק לבשר נקרא דוכסוסטוס לפי זה כי אמרינן כותבים על הקלף במקום בשר היינו מקום היותר קרוב לבשר דהיינו במקום חבורו כשהוא דבוק לדוכסוסטוס וקלפים שלנו שאין חולקים אותם יש להם דין קלף וכותבים עליהם לצד בשר שמה שמגררים קליפתו העליונה שבמקום שער אינו אלא כדי מה שצריך לתקנו להחליקו ואפילו אם היו חולקים העור לשנים היה צריך לגרר ממנו כך ומצד הבשר גוררים הרבה עד שאין נשאר אלא הקלף בלבד:\n\nIt is a Received Tradition going back to Moses that tefillin [are written] on the klaf layer, not on dukhsustos or gewil; on the klaf layer, on the flesh side and any variation is invalid. What are [these layers]? When a raw skin is split thickness-wise, the outer layer towards the fur is klaf and the inner one towards the meat is dukhsustos. Thus when we say \"the flesh side of the klaf\" we mean the side closer to the flesh i.e. where it connects to the dukhsustos. Our parchment which is not split, is halachically klaf and we write on it on the flesh side since what is scraped away from the hair side is just enough to smooth it out and would be scraped off even if we were to split the hide, while on the inside all the dukhsustos is scraped away.\n\nצריך הקלף להיות מעובד בעפצים או בסיד וצריך שיהי' מעובד לשמו טוב להוציא בשפתיו בתחלת העבוד שהוא מעבדו לשם תפילין או לשם ס\"ת אבל אם עיבדו לשם מזוזה פסול:\n\nThe parchment must be processed with gallnut juice or lime and must be processed for the appropriate purpose. It is proper to declare verbally at the beginning of the process that he is preparing it \"for tefilin\" or \"for sefer torah\" but if parchment [used for tefilin] was prepared for mezuzah, it is invalid.\n\nאם עיבדו עכו\"ם להרמב\"ם פסול אפי' א\"ל ישראל לעבדו לשמו ולהרא\"ש כשר אם ישראל עומד על גבו וסייעו: [הגה קצת בעיבודה] [ב\"י בשם הרא\"ש וכן נוהגין ועיין לעיל סימן י\"א סעיף ב']:\n\nIf a non-Jew processed the parchment, RaMBa\"M disqualifies it but RO\"Sh does not, as long as a Jew supervises and helps. Note: In a small part of the process. And such is the custom.\n\nכשמסמנין הנקבים במרצע כעין אותיו' אע\"פ שנקל לעכו\"ם לזייף אין חוששין משום דמרתת כותי פן יכיר ישראל בטביעות עין:\n\nWhen hides are marked with an awl in shapes like letters, we do not assume they are forged even if it would be easy to do so because the non-Jew would be afraid that the Jew [who made the marks] would identify them.\n\nעור שעיבדו שלא לשמו אם יש תיקון לחזור לעבדו לשמו יתבאר בטור יורה דעה סי' רע\"א:\n\n[The question of] whether or not hides processed with incorrect intent can be reprocessed with the proper intentions is addressed in the Tur, Y\"D 271.\n\nיהיה הקלף מעור בהמה חיה ועוף הטהורים אפילו מנבלה וטריפה שלהם אבל לא מעור בהמה וחיה ועוף הטמאים דכתיב למען תהיה תורת ה' בפיך ממין המותר לפיך ולא מעור דג אפילו הוא טהור משום דנפיש זוהמיה:\n\nThe parchment must be [made] from the skin of a kosher animal, domesticated or not, and even from a carcass or roadkill. It may not be made from the skin of any non-kosher animal as it is written: \"That the Torah of God be in your mouth\" i.e. that the Torah itself must be made from halachically edible species. Parchment [for tefilin] may not be made from the skin of fish -- even kosher ones -- because of its excessive stench.\n\nיהיה הקלף שלם שלא יהא בו נקבים שאין הדיו עובר עליו דהיינו שלא תהא האות נראית בו חלוקה לשתים:\n\nThe parchment should be whole, without any holes that ink cannot fill, i.e. that [the ink should not fall through the gap and] make the letter appear split.\n\nהסופרים הזריזים עושים שלשה מיני קלפים העב יותר לכתוב בו פרשת שמע שהיא קטנה והדק ממנו לפרשת והיה אם שמוע שהיא יותר גדולה ולפרשת קדש ולפרש' והיה כי יביאך שהם ארוכות עושים קלף דק מאוד ובזה יתמלאו הבתים בשוה וזהו נוי לתפילין:\n\nMeticulous scribes make three grades of parchment: on very thick for the shorter Shema, a slightly thinner one for V'haya im shamoa which is a longer [than Shema], and for the chapters of Kadesh and V'haya ki y'viacha (exodus) which are longer we make them on a very thin parchment, and through this fill the compartments evenly which makes the tefillin look nice.\n\n\n", "score": 1, "send_replies": true, "subreddit": "unpopularopinion", "date_year_month": "2018-12", "created_utc_converted": "2018-12-03 07:00:11", "score_overall": 19, "words": "jew jewish merchant jew merchant jew jew merchant jew jew jew jew jew jew jew jew kosher kosher kosher", "shared_words": "jew jewish merchant kosher", "socre_distint": 4}
{"archived": false, "author": "mattrbchi", "body": "&gt; Am muslim and i'm totally against Holocaust and killing innocent people because of their religion ! \n\nWhat about killing innocents who are insulting your prophet? \n\n&gt; You need to see Berlin today ! hanukkah posters are everywhere !\n\nBerlin wants to virtue signal therefore they are taking the social justice route. Regardless of Hunukkah posters. Individual Jew's cant openly express their belief in Berlin. Even [Muslims](https://www.haaretz.com/world-news/europe/jewish-man-attacked-in-germany-admits-he-s-an-israeli-arab-1.6012220) who wear Jewish garb are victims of Berlin's antisemitism.\n\n&gt; while now israel is killing innocent people , \n\nThis false Blood libel actually encourages religion-based killing of innocent people. Israel has had less bloodshed now then it had in the 1980's when it ran Judea and Samaria (West Bank) without Palestinian police intervention. Meanwhile, The rest of the middle East is falling apart.\n\nI also dont see Palestinians fleeing to Europe in droves from the west bank because they \"got it bad\" and need Europe to save them. They are staying in the West Bank because they dont have it bad. \n\n&gt; it's a \"country\" with no history\n\nWay before Zionism, Jews have made the trip to the Land of Israel. The yearning for Zion and Jerusalem has been a fixed part of Judaism and has been part of the daily prayers ever since the destruction of the second Temple. \n\nJews are UN approved indigenous peoples and as such so are native Americans. Jews have a right to live in their namesake indigenous lands called Judea.\n\nIsrael is the world’s first modern indigenous state: the creation and declaration of the sovereign nation of Israel marks the first time in history that an indigenous people has managed to regain control of its ancestral lands and build a nation state.\n\nRegardless of the length of the timeframe of Jewish depopopulation events, Jews have the right to live there under indigenous pretexts. They have the right to live there without threats about thievery on lands for which they are indigenous to.\n\n&gt;  it's more like renting a house then forcing the owner to give you a blowjob so you pay him !\n\nPalestinians have same language and culture as surrounding Arabs. Palestinian people's are indigenous to places 1000 miles east. Saudi Arabia, Syria, etc. You can use the last name to trace the origin once you meet one. This is why when you look in a Palestinians museum you see modem art and no artifacts from recent past. Most Arabs residing in this region arrived after the British beat the Turks about a hundred years ago. Jews created agriculture once the British came. Those Arabs migrated to the region after the agriculture bloomed because there was no good agriculture in Arabian desert. Arabs are known for livestock and the trade of agriculture peaked their interest.\n\nSome Palestinians share common ancestry with indigenous peoples, but they neither follow indigenous traditions nor do they self-identify as those indigenous peoples. They share neither religion nor language with them. Blood quantum alone is insufficient to transmit indigenous status.\n\n&gt; am a tunisian living in America \n\nIf you hate Israel so much then you should move back to Tunisia in protest because America will always support Israel.", "score": 1, "send_replies": true, "subreddit": "unpopularopinion", "date_year_month": "2018-12", "created_utc_converted": "2018-12-03 17:20:11", "score_overall": 6, "words": "holocaust jew jewish jewish libel jewish", "shared_words": "holocaust jew jewish libel", "socre_distint": 4}
{"archived": false, "author": "mattrbchi", "body": "&gt; \"Anti-colonialist\" against whom then?\n\nIslam came from Mecca, anything outside of Mecca is considered colonialist. \n\n&gt; No, Israeli \"anti-colonialism\" entailed the violent suppression and displacement of the native population in 1948,\n\nAre you talking about a couple instances of a few hundred people getting killed? Thats not entire villages nor was it commonplace. \n\nIsrael told Muslims to stay in their homes and that they were safe during Independence. The only terrorists were the Arab armies who came from afar to cause Holocaust #2.\n\n\"It must not be forgotten that the Arab Higher Committee encouraged the refugees' flight from their homes in Jaffa, Haifa, and Jerusalem.\" -- Near East Arabic Broadcasting Station, Cyprus, April 3, 1949\n\n\"Every effort is being made by the Jews to persuade the Arab populace to stay and carry on with their normal lives, to get their shops and businesses open and to be assured that their lives and interests will be safe.\" -- Haifa District HQ of the British Police, April 26, 1948, (quoted in Battleground by Samuel Katz).\n\n\"The Arabs of Haifa fled in spite of the fact that the Jewish authorities guaranteed their safety and rights as citizens of Israel.\" -- Monsignor George Hakim, Greek Catholic Bishop of Galilee, New York Herald Tribune, June 30, 1949\n\nSir John Troutbeck, British Middle East Office in Cairo, noted in cables to superiors (1948-49) that the refugees (in Gaza) have no bitterness against Jews, but harbor intense hatred toward Egyptians: \"They say 'we know who our enemies are (referring to the Egyptians)', declaring that their Arab brethren persuaded them unnecessarily to leave their homes…I even heard it said that many of the refugees would give a welcome to the Israelis if they were to come in and take the district over.\"\n\n\"The Arab states which had encouraged the Palestine Arabs to leave their homes temporarily in order to be out of the way of the Arab invasion armies, have failed to keep their promise to help these refugees.\" -- The Jordanian daily newspaper Falastin, February 19, 1949.\n\nMost Arabs residing in this region arrived after the British beat the Turks about a hundred years ago. Jews created agriculture once the British came. Those Arabs migrated to the region after the agriculture because no good agriculture in Arabian desert. Arabs are known for livestock and agriculture peaked their interest.\n\n&gt; This \"anti-colonialism\" looks pretty colonial to me. \n\nRegardless of the length of the timeframe of Jewish depopopulation events, Jews have the right to live there under indigenous pretexts. They have the right to live there without threats about thievery on lands for which they are indigenous to.\n\nJerusalem is only important to the world because of Judaism; it’s important to Christianity because it was first important to Judaism; it’s important to Islam because it was first important to Judaism; Jerusalem is mentioned hundreds of times in the Jewish texts; Jerusalem is in the Israeli national anthem.\n\nTo be a colony, you need a host, there is no host because Israel is self-sustaining. The US gives funds equivalent to 5% of the IDF budget, small peanuts. Whereas, the host of the Palestinian colony is Mecca in Saudi Arabia.\n\n&gt; Firstly, while individual Islamic rulers during the middle ages or renaissance might have launched a pogrom here or there against the Jews, those occurrences were always of a very limited scale compared to what happened at the same time in the Christian world. \n\nA proclamation was written in Iran, sounding much like the story of Esther, where any citizen was allowed to kill every Jewish man, women and child unless they converted to Shia Islam. The edict was first put in place in Isfahan and later in all of Persia, between 1663 and 1666.\n\n1800's Palestinians committed ethnic cleansing and genocide in Jaffa (1876) and Jerusalem (1847, 1870 and 1895). \n\n&gt; the Islamic world was for centuries a safe haven for the Jewish diaspora.\n\nPre-Holocaust Europe had 6 million Jews and Pre-Holocaust Islamic lands had 900 thousand. If Muslims were so merciful then why did Jews go to Antisemitic Europe 6 to 1 over Islamic lands. Those 900 thousand Jews were kicked out of Islamic lands as soon as Israel was established and that is NOT limited scale.  Such a safe haven those Islamic lands! Get kicked out of your homeland because of some war that has nothing to do with you. \n\nLife for Jews while under a Muslim ruler were only wonderful for Muslims. They had a source of extortion money to fill the coffers, a minority to scapegoat (Beat Up) when they felt frustrated, and overall dominance over Jews - as mandated in the Quran.\n\n&gt; Traditional racism is not hard to find in Israel, and one doesn't even have to look at the treatment of Palestinians to find it.\n\nPalestinian is not a race. Racism exists in all societies but that does not discount the fact that Palestinians are not protesting regularly or at all about the issue of bigotry by Israelis.\n\nJudaism is not a race based religion and Zionism and its historical roots has no reference to admiring ashkanazi Jews or Whites. More then half of Israeli Jews are non-white.\n\nJews have always been considered non-white throughout history until some ideologue guesses that since Jews are successful that they must be white.\n\n&gt; and one doesn't even have to look at the treatment of Palestinians to find it.\n\nLet's get this straight, Arabs pioneered the African slave trade and still practice slavery with Asian indentured servitude. Palestinians pray to a white prophet whom had African slaves. Jews don't pray to someone who supports African slavery.\n\n&gt; Just look at the scandal where Ethiopian Jews were forcibly put on birth control to keep them from having children.\n\nThey were not forced, they were mislead. As soon as they protested or asked questions, the procedure was ended. That is free birth control not permanent sterilization. In America, we strive to consider free birth control a right.\n\nThe queen of Sheba, Ethiopia must have converted to Judaism under duress because Jews are so racist. /s\n\n&gt; and there is a clear hierarchy where Black Jews are worth the least.\n\nWhat is this proof of a hierarchy in Israeli education, housing, welfare subsidies? If its clear then there must be info.\n\n&gt; And this makes it okay to deny the Palestinians basic human rights\n\nThe Palestinians are not Israelis therefore civil rights are done by Palestinian authority and they are afforded border checkpoints only into Jerusalem. We have checkpoints in America at airports, borders, Disney World, and at high rises.\n\n&gt; The Israeli people votes for Netanyahu because he .... make(s) Islamic terrorism out to be an existential threat to Israel.\n\nHave you read the infamous Islamic Hadith which proclaims that the Muslim end times will come only when\n\n“Muslims will fight the Jews (and kill them); until the Jews hide behind rocks and trees, which will cry: O Muslim! There is a Jew hiding behind me, come on and kill him!” . \n\nIts author was not preaching the mass murder of Jews because of settlements in the West Bank, its merely Jew hate.\n\nA decade ago, Iran created the anti-Semitic rallying cry for Hezbollah and Houthis. The slogan is “Death to America, death to Israel, damnation to the Jews,\" Iran's hezbullah proxy leader Nasrallah said in '02. \"If Jews all gather in Israel, it will save us the trouble of going after them worldwide.\"\n\nHitler made similar threats in Mein Kampf but they were largely ignored.\n\nNasrallah has a reputation for keeping his promises and Iran has a history of ethnically cleansing Jews.\n\n&gt; The Israel of today have such a blatant level of corruption and inequality between the citizens\n\nIsrael has had many Prime Ministers arrested and jailed because the corruption is faught and won by the citizens. In America, we cant even get Trump to stop doing business with foreign interests as required by law. ", "score": 2, "send_replies": true, "subreddit": "BreadTube", "date_year_month": "2018-12", "created_utc_converted": "2018-12-04 21:23:52", "score_overall": 11, "words": "holocaust jewish jewish jewish jewish jewish holocaust holocaust scapegoat jew jew", "shared_words": "holocaust jewish scapegoat jew", "socre_distint": 4}
{"archived": false, "author": "_captain-shitacular_", "body": "Please, explain to me how a european Jew today is at all effected by the holocaust. Other than other jewish people claiming it’s important, and never mentioning that every society goes through a genocide stage. Some societies today still allow it to happen, yet in Europe its been abolished nearly a century and I still hear jewish people crying about it often.\n\nIt’s a refusal to let go, a refusal to face the fact that european Jews face so much struggle that is self-imposed. Some can’t follow banking laws, blame the German man for making laws that are “culturally biased”. My personal  favorite ‘Hitler's fault’ theory is the Third Reich making it illegal for jews to leave the country. You knew it was illegal, why get involved? I came from a shithole town with nothing in it or around it except farm land. I worked my ass off and struggled. I went without and sacrificed a lot along the way. I’m better for it now, but I only got through it because I took responsibility for my shortcomings. I don’t see that with people who can’t let go of genocide/the third reich/bad parents/etc. If you allow yourself to have a scapegoat you’ll never grow past the same failures.\n\nEuropeans need agency and self reliance. It’s totally possible to follow the law while doing this. It doesn’t matter if your Jewish or not, this shits gotta stop. Look ahead, or you’ll hit a wall or fall off a cliff.\n\nDoes this still sound good to you? No? Well, it's funny, because the main difference is that current-day Jewish people don't face even a fraction of the systematic oppression and discrimination that black folks do still... and black chattel slavery happened nearly twice as long ago.\n\nJust food for thought.\n\nEdit: You're all closeted skinheads anyway so this was probably a bad analogy to choose, but fuck it, i'll take Nazi downvotes with pride.", "score": 1, "send_replies": true, "subreddit": "greentext", "date_year_month": "2018-12", "created_utc_converted": "2018-12-04 22:25:00", "score_overall": 7, "words": "jew holocaust jewish jewish scapegoat jewish jewish", "shared_words": "jew holocaust jewish scapegoat", "socre_distint": 4}
{"archived": false, "author": "farahad", "body": "&gt;I'm well aware of what the bolsheviks unleashed on Russia after murdering the ruling family. Look up their origins if you're unaware of them.\n\nYou're willing to accept *some history,* but not *other history.*  This, despite the fact that there's much more material evidence preserved for the Holocaust.  \n\nInteresting.  And hypocritical.  \n\n&gt;I didn't move the goalposts one bit. I wrote that this court case was a sham because the only point in case was the provision of evidence and the plaintiff literally provided nothing but a story. \n\nThat is what court cases are.  Two parties with different stories.  In lucky cases, both parties agree on a single story and only legal *interpretation* is needed.  \n\n&gt;The judge literally decided that no evidence was necessary in a challenge that was 100% predicated on evidence.\n\nAgain, this was a civil suit. Say I sue someone because they rear-ended me and drove off. I managed to snag a photo of their license plate, and my friend was in the car when it happened.  \n\nWhat evidence is there that any of this happened?  Two peoples' \"stories\" and a photo -- with a timestamp that probably could have been altered.  Maybe a police report.  \n\nThrough questioning the defendant, the judge could determine if he or she lived or worked in the area, if they drove that route, would have been on that road at that time, etc.  \n\nNow, if the defendant came to court with some receipts and credit card statements showing that they had been [elsewhere] at the time of the purported accident, the judge would probably throw the case out.  \n\nEvidence.  Testimony counts.  It won't beat out contradictory material evidence, but it's something.  And a hundred or more pages of *consistent, firsthand, eyewitness testimony* is just that.  \n\nAnd corroborating testimony from *millions* of people.  Victims, prisoners, soldiers from half a dozen countries, photographs, original Nazi documents detailing the numbers of people arriving, being killed, and even where their hair and belongings were being shipped.  \n\n&gt;Even you fail to provide any. \n\nSee any of the links in any of my previous comments.  I'm putting less work into this comment because it looks like you really are just trolling, now.  \n\n&gt;Very easy to write about what allied soldiers supposedly saw, very difficult to reconcile the deaths claimed with the facilities available. Very difficult to find the alleged mass graves.\n\nIt's not like there are [videos](https://www.youtube.com/watch?v=YL_SWflHM6s).  Or videos of [the camps themselves](https://www.youtube.com/watch?v=rtsnp1m85EI). [Plenty of them](https://www.youtube.com/watch?v=2KCKagd6Ihk).  Google around.  \n\nYou're asserting that something is false, again, based on *nothing.*  You're wasting my time.    \n\n&gt;Easier to find mass burial sites from millenia ago, it seems.\n\nYou seem to be rambling about fictional events.  \n\n&gt;Very easy to propagandize via public school curriculum in the post WW2 era. Do you know who was in charge of teachers' college at Columbia? Are you aware of what they prescribed for the children?\n\nConspiracy theories, by the sound of what you're pushing here.  You're, again, asserting that the Holocaust is \"propaganda,\" based on *nothing.*  \n\n&gt;As far as criticism: that I wasn't directly criticizing a jew (though implied a corrupt court that favors jews, which itself is implicitly a product of Jewish nepotism and power grabs) in my post is completely irrelevant.\n\nBy that logic, any group favored by any institution is \"corrupt and the product of nepotism and power grabs.\"  That gives us an interesting take on White privilege and especially White Christians in America, who have been (unconstitutionally) pushing their ideology in the US for decades.  From [Scopes](https://en.wikipedia.org/wiki/Scopes_Trial) to Roe v. Wade to [Kitzmiller v. Dover Area School District](https://en.wikipedia.org/wiki/Kitzmiller_v._Dover_Area_School_District), *Christians* are pushing their religion on all Americans.   \n\nJews account for 1.73% of the US population.  They're an insignificant minority.  What you suggest is happening is *pure fiction.*  \n\n&gt; A statement is true if it is true; it doesn't require an immediate demonstration.\n\nYou're moving the goalposts.  *Again.*  You said, \"You want to know who rules you? Look for who you're not allowed to criticize.\"\n\nDenying extraordinarily well-documented historical facts isn't \"criticism\" of anyone.  Unless you've brought evidence to the table to support what you're saying, it's just *insane.*  \n\n&gt;E.g. A syndicated columnist writes \"10 things that white men do to make society worse for us all\" and is praised by the leftist press.  E.g. A syndicated columnist writes \"10 signs that the Jewish lobby is subverting the nations of the people which created them\" will immediately become persona non grata in the world of the press.\n\nYour proof that the Holocaust didn't happen in 1940-45 is...PC rubbish, today?  \n\nI've got news for you.  The \"Left\" you think exists, doesn't.  It's a handful of vocal people and 95%+ of politically \"liberal\" people would see *both* of your slanted hypothetical news stories for what they are.  \n\nBut, hey.  I can make a similar assertion.  \n\nWorld War II never happened.   Prove me wrong.  ", "score": 4, "send_replies": true, "subreddit": "JusticeServed", "date_year_month": "2018-12", "created_utc_converted": "2018-12-05 20:35:47", "score_overall": 7, "words": "holocaust conspiracy holocaust jew jewish jewish holocaust", "shared_words": "holocaust conspiracy jew jewish", "socre_distint": 4}
{"archived": false, "author": "[deleted]", "body": "\\&gt; office jobs, for jews. look at census results dumbass. jews, and goyim who share the jew philosophy benefit.\n\nJews are less than 2% of the U.S. population. Even if every single Jew had an office job (and I've known several blue collar Jewish people), they still wouldn't even come close to taking all the white collar jobs in the US. Not sure what the Jew philosophy is that allows you to conveniently lump non-jews in with them for sake of your anti-jew argument, but if it means earning a good salary in a growing field without breaking my back doing hard labor, that sounds like a great philosophy! I'll gladly 'Jew it up' if those are the terms.\n\n\\&gt; You idiot, the other side of this is that the people in other countries are too poor. Go learn about the east india company, owned by jews, that exploited the entire planet.\n\nLook, a lot of Jewish people happen to be intelligent. The Ashkenazi Jews have the highest average IQ of any ethnic group. Why? I have no idea. But they've found success in the world because of that. However, small people resent success so they've also attracted resent. Have all Jews been altruistic and saintly to their fellow non-Jew over the course of history? I doubt it. But I doubt any group could stand up to that measure without fault. You can always find bad apples.\n\nBut white supremacy is the epitome of emotionally stunted white trash which chooses to misdirect one's own individual failings onto a scapegoat. Whether you're an obscure physicist with no major contributions or a factory worker whose only skilled trade was outsourced to China, you can either roll with it or you can channel that into something unproductive like hate speech. It's your call. But in the end, it's also your time wasted.\n\n&amp;#x200B;", "score": 1, "send_replies": true, "subreddit": "conspiracy", "date_year_month": "2018-12", "created_utc_converted": "2018-12-05 22:37:52", "score_overall": 10, "words": "goyim jew jew jewish jew jew jew jewish jew scapegoat", "shared_words": "goyim jew jewish scapegoat", "socre_distint": 4}
{"archived": false, "author": "EdmondDantes777", "body": "&gt;      \n&gt; \n&gt; \n&gt; \n&gt; unless you become bobby fisher or david cole and learn the truth about the lies and bullshit your brethren have peddled and fight against them, then yes. \n\nWhat if I am already well aware of this? \n\n\n\n\n&gt;I don't care what you think about them, your fellow jews would just use you as an example for how the rest are good. It is like picking between democrats and republicans, two party jew party system. \n\n\nDo you think it's possible that zionist elitests are simply using common regular Jews as useful idiots to carry out an agenda the same way the Vatican and elites of Islam use their followers to carry out their agendas? Do you think it's possible that the Zionist elites do not care at all about regular common Jews and don't care if we live or die as long as we help forward their agenda?\n\n\n\n&gt;I don't care what you think about them, your fellow jews would just use you as an example for how the rest are good. It is like picking between democrats and republicans, two party jew party system. \n\nThe false dichotomy two-party system in America was created by our freemason founding fathers. Jews were not influential in American government back when this two party false-dichotomy shit was going down, unless you are blaming Jewish financiers for funding the freemason agenda, which I suppose is possible. \n\n\n\nBut again, that's just a case of elites fucking with, oppressing and abusing the common people. Ancient Aztec elites did this. Ancient Iroquios elites did this. Jewish elites do this. Christian elites do this. Asian elite do this. African elites do this. Catholic elites do this. European royalty always did and still does this. Atheist elites do this. Muslim elites do this. Buddhist elites do this. You think the world is Jews vs Goyim when really it is Elites vs Commoners. \n\n\n\nIt's a psy op that the Jews are responsible for everything. You are failing to consider the idea that Soros himself for example is not a puppet-master and instead is just a guy who performs contract work for globalist groups and factions above him. \n\n\nThere are many people who are so rich they pay to have all public information about them removed. The most powerful people in the world are people we know literally nothing about.\n\n\n\nIn the same way that the Republicans and Democrats are a false dichotomy designed to divide people, all three major Abrahamic religions have been weaponized by elites. Judaism has been weaponized to subvert. Islam has been weaponized to conquer and fight feminism in the west. Christianity has been weaponized as a pacification system. \"Trust in Jesus, turn the other cheek!\" And Catholicism of course as we all know is the Church of Satan.\n\n\nAll three Abrahamic religions have been subverted and perverted from what they originally were. You have been tricked in to blaming absolutely everything on the Jewish people, when Jews themselves are just one of several groups who are being unwittingly used by people above them.", "score": 1, "send_replies": true, "subreddit": "conspiracy", "date_year_month": "2018-12", "created_utc_converted": "2018-12-06 00:41:46", "score_overall": 7, "words": "jew jew jewish jewish goyim globalist jewish", "shared_words": "jew jewish goyim globalist", "socre_distint": 4}
{"archived": false, "author": "UnoriginalMike", "body": "There’s the name calling again.  You are so worked up, and frankly I’m finding it funny.  You can’t be more than 13 years old and are resorting to kindergarten level tactics to try and hurt me.\n\nWith regard to my being Jewish, I’m going to quote Tolkien, “If I am to understand that you are enquiring whether I am of Jewish origin, I can only reply that I regret that I appear to have no ancestors of that gifted people.”  I feel the same way he did.\n\nWith that in mind, calling me a Jew isn’t going to bother me in the slightest.  If I was Jewish, calling me a Jew wouldn’t bother me either, would it.  In fact, since I know I’m not Jewish, your calling me a Jew doesn’t bother me either.  In fact, the only way someone would be insulted by being called a Jew is if they hated the Jews, like yourself.  \n\nNow, what’s interesting to me is that you are accusing me of seeing anti-Semitism everywhere.  Yet, the only place I’m seeing it is in your posts.  Your logic is pathetically bad for someone claiming to have a PhD.  Maybe you should change your username to MiddleEastDropOut, it would be more honest.  Since you seem into conspiracy theories, it would make more sense.\n\nIsrael was founded in 1948, that is well known.  It was founded after the holocaust.  Now that you’ve deleted your initial comment, you are trying to make it seem like you were just stating facts.  One jaunt through your post history shows your true colors.  This account exists only to forward an agenda, and that agenda hates Jews.  \n\nTalking to you is like talking to a dog.  I use words and arguments to form a chain of logic, while you bark the same bark over and over.  When I tell you that you are just barking, you bark some more as if that is going to make you any less of a dog, surely that will show me.\n\nI have to wonder if your an Arab racist or a Caucasian racist.  Either way, I’m pretty tired of wasting my time responding to you.  It’s like trying to teach a pigeon to play chess.  I really do hope that you get out of the echo chamber you’ve put yourself in and grow out of this anger.  If that happens one day, please do reach out.  ", "score": 0, "send_replies": true, "subreddit": "AskReddit", "date_year_month": "2018-12", "created_utc_converted": "2018-12-07 03:55:20", "score_overall": 10, "words": "jewish jewish jew jewish jew jewish jew jew conspiracy holocaust", "shared_words": "jewish jew conspiracy holocaust", "socre_distint": 4}
{"archived": false, "author": "TravelerOfTamriel", "body": "Milton Friedman, that's a jewish surname, not to mention that Ford published and distributed his book \"The international Jew\"; although he was involved with freemasonry for a period of time, only the higher ranking members know what it's truly about (the occult practices of jewish mysticism involved in an intricate web of connections along with many other things that help to maintain the cohesiveness of the globalist international clique).  \n\n\nWho Controls the World, How They Do It, and What They Believe: https://youtu.be/cjrTHv2szzo\n\nFurthermore, I recommend you actually try looking up the definition of what a conspiracy actually is rather than what you have been conditioned to think.\n\n[https://www.dictionary.com/browse/conspiracy](https://www.dictionary.com/browse/conspiracy)", "score": 1, "send_replies": true, "subreddit": "JordanPeterson", "date_year_month": "2018-12", "created_utc_converted": "2018-12-07 15:07:36", "score_overall": 7, "words": "jewish jew jewish globalist conspiracy conspiracy conspiracy", "shared_words": "jewish jew globalist conspiracy", "socre_distint": 4}
{"archived": false, "author": "ThePlagueofCustom", "body": "It’s hard to address your paranoia about Jews, but three things:\n\n1) You’re conflating Jews and the state of Israel, many Jews in the United States, for instance, consider it a cultural identity rather than an ethnic or religious grouping, much like 5th generation Italian immigrants consider themselves “Italian.” Do you think that Italian-Americans are all connected to the current state of affairs in Italy? Further, Jews around the world do not uniformly support the actions of the Israeli state. Many people from across the political spectrum, including Jews, have condemned Israel’s burgeoning and strengthening apartheid state. Israel has a difficulty, it can either be a democracy or a Jewish state, but it doesn’t seem like it can completely do both. \n\n2) The foreign policy choices of the United States are complicated and before the 1990’s were largely driven by the Cold War. Since then there has been a rather formless foreign policy. You also misunderstand Israel’s position in the region. Netanyahu has used Iran as focal point to create an alliance with the gulf states to try and force a solution to the issues they have with the Palestinians (I’m not taking a side, just explaining that Israel does have a rational foreign policy that isn’t centered on...taking over the world?). Countries don’t make large decisions (generally) based on irrational hatred - over time they will make decisions based on what they perceive to be their self-interest. As a matter of fact, one of the primary reasons that Nazi Germany was ultimately defeated in World War 2 was because of their irrational obsession with the extermination of Jews and others, valuable resources were wasted on irrational ends.\n\n3) There are historical reasons for the restriction of speech about the Holocaust as well as for the overrepresentation of Jews in positions of power and authority (some of the explanations have to do with IQs, some with historical positioning in a globalized world, others with cultural emphasis on education). The Holocaust one is pretty obvious, Jews were used as a scapegoat by Nazi Germany to help them come to power, and, without getting into 1st Amendment issues (a particularly American peculiarity) it plunged the continent into one of the most destructive wars in history. The European countries are afraid of a repeat.\n\nOther than that I would just say that blaming a grand conspiracy of “Jews” for all of the world’s problems while at the same time identifying yourself as part of a victimized ethnic/cultural group is a grand oversimplification and intellectual opiate for the inequities, evils, and randomness of the world.", "score": -3, "send_replies": true, "subreddit": "conspiracy", "date_year_month": "2018-12", "created_utc_converted": "2018-12-07 17:44:46", "score_overall": 5, "words": "jewish holocaust holocaust scapegoat conspiracy", "shared_words": "jewish holocaust scapegoat conspiracy", "socre_distint": 4}
{"archived": false, "author": "zaoldyeck", "body": "&gt;You're absolutely brainwashed. We have more physical evidence of the existence of dinosaurs than of the holocaust. Cite testimony and documentation all you'd like (testimony to the contrary exists, as per the nature of testimony).\n\nCute.  So did they kick you out of an Auschwitz tour for masturbation?  Too many photos of dead bodies for you to keep it in your pants?\n\nSo is what you're looking for stuffed and preserved Jews in museums and nothing less?  \"We don't have their bodies displayed like dinosaurs, clearly it's all a lie\".\n\nOr are you just trying to plan your \"jew\" exhibit for whenever your ilk attempts to take power again?  \n\n&gt;Throughout all of this I've never actually denied the holocaust. I merely opined that the case in question was bullshit since the judge literally cited \"zero evidence necessary\" as evidence and forced the people who posed the challenge to pay up despite the fact that their challenge hadn't been met. That is fucking scary. It is a great big message: \"don't ask these quetlstions, peasants.\"\n\nNo all you've done is say \"there's no evidence by the way Jews suck and Germany totally should have murdered them but they didn't,  even though they completely could have and wanted to\".\n\nYou're being duplicitous at every turn.  You 'question' something you have made abundantly clear you wish you could have participated in.\n\n&gt;If six million jews were systematically slaughtered (not to mention the millions of others allegedly slaughtered) then why isn't there any physical evidence?\n\nBecause after you cum you suddenly pretend you didn't see anything. Otherwise you might have to explain why you've got such a wet spot on your pants after seeing dead bodies, and necrophilia isn't exactly something you want to go advertising. \n\nDid they kick you out after catching you with your pants down?  Saw nail clawing marks on the walls and couldn't wait till you got home just imagining all those people suffocating?  Sad you couldn't autopsy and fuck the dead yourself?  Hope to get another try?  Sad all those nazi's had all the fun and you were born too late?\n\n&gt;It seems absolutely absurd. As above: it's apparently easier to find proof of the deaths of giant reptiles from the Mesozoic Era than to find proof of these deaths.\n\nCreationists would disagree. Although they aren't trying to disagree because they secretly want to murder dinosaurs themselves. \n\nYour conspiracy theory is a giant excuse to pretend people who hate Jews would never kill them.\n\nYou probably know that's bullshit. Because you pretty clearly want to murder them yourself. I think that's why I find creationists less repugnant.\n\n&gt;Apparently Mr. Spielberg thinks it is an appropriate time to roll out Schindler's List and put it in theaters again. A fictional story meant to capture the emotions of the populace rather than engage their rationality.\n\nNot enough throatfucking dead Jews for you?  Too little color for you to really feel the \"rational murder\" you're looking to create?\n\nNot visceral enough for you?  Doesn't celebrate the slaughter enough,  doesn't portray the Jews as nearly evil enough for you?\n\n&gt;Really makes one wonder. (maybe do some research on what was uncovered about the treatment if jews in camps in pursuit of stories for Schindler's list.)\n\n\"Nazi's were way too nice to the people they blamed for everything, people are mean to the Nazi's who totally treated people they hated, people they blamed for everything, people they rounded up in camps by gunpoint with respect and kindness and totally not murder!!\"\n\n\"Jews are evil.... but Nazi's would neeeeever murder them.... trust me.  I wouldn't want to murder those evil parasitic greedy manipulative propagandists.... I just want to treat them like the Nazi's did, who totally didn't murder anyone. Those films and photos and records and the entire history is a lie, Jewish haters would **never** kill Jews.  Trust me.\"\n\nAgain your ulterior motives aren't exactly hidden here.\n\n&gt;Do you know why propaganda exists and is broadcast over the airwaves and via compulsory government education? Because it works.\n\nUnless of course it's anti Jewish propaganda. In which case it never works and even if it did Jews totally deserve it because they're evil and control everything, but this isn't propaganda, nor could propaganda ever convince people to murder Jews.  No the Nazi's were totally kind and caring to the people they rounded up by the millions who they blamed for everything wrong. But that wasn't propaganda nor could it be effective.  Only Jews like Spielberg make propaganda, Nazi's never did\".\n\n", "score": 1, "send_replies": true, "subreddit": "JusticeServed", "date_year_month": "2018-12", "created_utc_converted": "2018-12-08 01:53:43", "score_overall": 6, "words": "holocaust jew holocaust conspiracy jewish jewish", "shared_words": "holocaust jew conspiracy jewish", "socre_distint": 4}
{"archived": false, "author": "KutombaWasimamizi", "body": "&gt;1 Corinthians 6:9–11\n&gt;Do you not know that wrongdoers will not inherit the kingdom of God? Do not be deceived! Fornicators, idolaters, adulterers, male prostitutes, sodomites, thieves, the greedy, drunkards, revilers, robbers — none of these will inherit the kingdom of God. And this is what some of you used to be. But you were washed, you were sanctified, you were justified in the name of the Lord Jesus Christ and in the Spirit of our God.\n\nTwo key Greek words in this passage are: malakoi and arsenkoitai.\n\nMatthew goes on to define malakoi as “effeminate.” It’s a Greek word that literally means “soft” and is used to describe fine clothing elsewhere in the New Testament. In a moral context, this word is actually more about “lack of self-control, weakness, laziness, or cowardice.” My friend David, a pastor who got kicked out of his church for false accusations, told me over nachos recently that this word is actually about people who were “spineless.” Soft to the point that they wouldn’t stand up for injustice or what truly matters. Irony of ironies, huh?\n\nThere were sexual connotations for “malakoi” as well, but again, it always points backs to uncontrolled acts of lust or misused sexuality — no matter the gender or act. The word was not understood to reference same-sex behavior in the church until after the 20th century, when Bible translations adopted a new slant.\n\nArsenkoitai is more bizarre and hard to grasp. Many believe that St. Paul actually invented the word, as it is extremely rare in ancient Greek literature.\n\nThe word literally is a combination of two other words in Greek: arsen (male) and koites (bed). So, arsenkoitai could be translated literally as “male-bedders.” And this word was understood by Bible translators before the 20th century to mean male-male sexual intercourse.\n\nBut when the word is used elsewhere in ancient Greek literature, it references the abuse of the poor (as in the Sibylline Oracles) or “economic exploitation and power abuses (as in a 2nd century text called the Acts of John).” The Acts of John lists arsenkoitai amongst a list of sins separate from a catalog of other sexual sins. Many believe (as Vines so cogently breaks down) that arsenkoitai is about economic abuses and exploitation.\n\nWhich is why the ancient act of “pederasty” is often brought up in relation to passages like this— the practice of Greek elite elder men who would adopt young men to use as sexual objects. Again, having nothing to do with LGBTQ loved ones, friends, and colleagues who are looking to live as good neighbors.\n\n&gt;Romans 1:26–27\nFor this reason God gave them up to degrading passions. Their women exchanged natural intercourse for unnatural, and in the same way also the men, giving up natural intercourse with women, were consumed with passion for one another. Men committed shameless acts with men and received in their own persons the due penalty for their error.\n\nSteve Chalke makes the argument that “Idolatry, promiscuity and shrine prostitution are what Paul is addressing [here] in Romans 1 — not same-sex relationships between faithful and committed partners.”\n\nSteve is right. This passage is clearly not about same-sex behavior carte blanche. It’s about gross misuse of power, Roman elitist overindulgence, and misguided over-sexualized spirituality.\n\nIf you are looking to get really Biblical about this passage and all of these verses, go no further than James Brownson’s tremendous Bible, Gender, Sexuality: Reframing the Church’s Debate on Same-Sex Relationships.\n\nJim is a New Testament scholar in Michigan who takes the Bible incredibly seriously. He thinks this passage is about excessive lust: the central problem with lust in Romans 1 is that it is an expression of idolatry in a specific sense: lust involves serving one’s own self-seeking desires rather than worshiping the one true God.\n\nBut more so than just excessive lust and how the early Christian communities should reject it, Brownson argues that this lust was being exhibited at a colossal scale by members of the Roman imperial court.\n\nEmperors Gaius and Caligula conjure up all sorts of sexual indulgence. Brownson says this, echoing the work of Neil Elliot:\n\nNeil Elliott has called attention to the striking similarities between Paul’s language and the incredible greed, violence, and sexual excesses of Gaius Caligula, an emperor who reigned in a period not too long before Paul wrote Romans. First of all, Gaius is closely linked to the practice of idolatry. The Roman writer Suetonius reports how Gaius “set up a special temple to his own godhead, with priests and with victims of the choicest kind.” Another Roman writer, Dio Cassius, comments negatively on how Gaius was the only emperor to claim to be divine and to be the recipient of worship during his own lifetime. Gaius also tried at one point to erect a statue of himself in the Temple in Jerusalem; he was dissuaded only by a delegation from Herod Agrippa. Hence the link between Gaius and idolatry would have been well-known indeed, particularly in Jewish circles. But Gaius also serves as “Exhibit A” for out-of-control lust. Suetonius reports how Gaius “lived in perpetual incest with all his sisters, and at a large banquet he placed each of them in turn below him, while his wife reclined above.” He records gruesome examples of Gaius’s arbitrary violence, vindictiveness, and cruelty. Later, Suetonius chronicles Gaius’s sexual liaisons with the wives of dinner guests, raping them in an adjoining room and then returning to the banquet to comment on their performance. Various same-sex sexual encounters between Gaius and other men are similarly recounted. Finally, a military officer whom he had sexually humiliated joined a conspiracy to murder him, which they did less than four years into his reign. Suetonius records that Gaius was stabbed through the genitals when he was murdered. One wonders whether we can hear an echo of this gruesome story in Paul’s comments in Romans 1: 27: “Men committed shameless acts with men and received in their own person the due penalty for their error.” Gaius Caligula graphically illustrates the reality of which Paul speaks in Romans 1: the movement from idolatry to insatiable lust to every form of depravity, and the violent murderous reprisal that such behavior engenders.\n\nso yeah it's even 'kinda true'", "score": 1, "send_replies": true, "subreddit": "soccer", "date_year_month": "2018-12", "created_utc_converted": "2018-12-08 13:46:49", "score_overall": 4, "words": "cowardice greed jewish conspiracy", "shared_words": "cowardice greed jewish conspiracy", "socre_distint": 4}
{"archived": false, "author": "zaoldyeck", "body": "&gt;Why do you suppose Germany wanted to get rid of the jews?\n\nBecause Nazi and anti-semetic propaganda convinced enough people that the solution to all their problems is to finally get rid of their favorite scapegoat.\n\n&gt;Why were the jews the primary group which pushed bolshevism?\n\n**Primary**?!  The fuck?  ANY marginalized group back in the early 1900s tended to support ideology aimed at classless societies.  But if you say \"look, communism is a jewish idea, if we just get rid of the jews we'll stop the communists\", well, you're turning into a Nazi.\n\nSo Nazi's blamed communism on jews, but no, they totally didn't kill them, right?  Right?  \"Physical evidence\" my ass, you know the answer.  You want to do the same, it's why you're asking these questions.\n\n&gt; Why do jews have so much control over the media and finances of the western world?\n\nProbably because those things they were never really barred from, especially in the US.  Spielberg himself was born to an electrician, learned photography as a young boy, and entered USC film school.  He was a guy who had an eye for shot composition, and his last name didn't bar him from entry into USC.  For a **lot** of minorities, that wouldn't have been the case in the 1950s. \n\nIs this you saying that we should bar jews from potential avenues of employment?  That if they had just been treated like black families, barred entry into schools entirely even back then, and had their parents wealth squandered via things like redlining, well, then we wouldn't have to worry about things like pesky jews in finance and media like Soros or Spielberg?\n\nWhat of Soros, how **did** he get his money?  Well, he started out as a clerk in a bank, and became an arbitration trader.\n\nBanks wouldn't hire a good number of minority groups either.  But they would be willing to hire jews.\n\nIs your solution to this just bar jews from everything?  Discriminate more, treat them as a bigger scapegoat?\n\n\"The holocaust never happened, but jews control everything and need to be stopped!\"\n\n&gt;You are free to infer whatever you'd like from the simple posing of these questions.\n\nThat you've bought into too much Nazi propaganda and you're trying to find ways to marginalize and eradicate a group you believe you can pin all your problems on.  That there's some giant conspiracy responsible for all of this that you and your fellow Nazi sympathizers are all aware of.\n\n&gt;I'm more interested in your answers to them.\n\nI'm pretty sure you'll be bored by the response.  Because your goal with them is to get me to hate jews, specifically, as a group and that's not about to happen.\n\nLike I said, the only people who seem to deny the holocaust seem the people who most want to recreate it. ", "score": 1, "send_replies": true, "subreddit": "JusticeServed", "date_year_month": "2018-12", "created_utc_converted": "2018-12-09 05:18:25", "score_overall": 6, "words": "scapegoat jewish scapegoat holocaust conspiracy holocaust", "shared_words": "scapegoat jewish holocaust conspiracy", "socre_distint": 4}
{"archived": false, "author": "zaoldyeck", "body": "&gt;You believe that the German people arbitrarily chose the jews as a scapegoat?\n\nPretty much, I mean, Europe had a long history of religious violence, targeting the Jews seems a pretty good extension of that.  You need some excuse after all.\n\n&gt;You believe that Jewish people control almost all of the mass media in the western world because Spielberg bought a camera as a kid?\n\nWell would you want to go with Bob Iger?  He graduated with honors from Ithaca College in television/radio which lead to him getting a job at ABC.  He [worked his way up](https://www.referenceforbusiness.com/biography/F-L/Iger-Robert-1951.html) over a rather large number of years as a network exec.\n\nIs he part of the secret jewish plot?  Conceived as a wee lad in Ithaca college? \n\nFact of the matter is these are real people, with real histories, and can't be reduced to some massive grand jewish conspiracy.  You can't pin everything you dislike on an ethinic group, that's Nazi thought. \n\n&gt;Quit fooling yourself. &lt; 2% of the population doesn't become nearly 100% of the mass media decision makers in any organic way.\n\nNothing about society tends to be 'organic'.  It's not 'organic' that black populations are significantly poorer in the US, cause, you know, **generations of stolen wealth**.  But not being barred from finance or media does tend to help a population be over-represented, especially if some larger population holds an innate stigma over those areas of employment.  It's been easy to vilify bankers for a while now, you think that'd go away if it were only 'your' demographic?  That 'you're better than those jews, if only we controlled everything then bankers wouldn't be so greedy\".\n\nFucking hell.\n\n&gt;You have no physical evidence of the holocaust and you have no rational explanation of the over representation of jews in the mass media and high finance.\n\nYou do have physical evidence of the holocaust, and your focus on 'overrepresentation' is because you want an excuse to perpetrate it again.  I'd rather not go playing into your dreams of a 'better tomorrow' by showing you yet more pictures of dead bodies, because I'm quite certain you've seen enough for a lifetime.  You can play ignorant all you like, you know exactly what you're after.  The holocaust isn't a question to either of us.\n\n&gt;Hello, Chaim. How does it feel to be a child of Satan? \n\nWouldn't know, I'm an atheist.  So another target for you to place on me? ", "score": 1, "send_replies": true, "subreddit": "JusticeServed", "date_year_month": "2018-12", "created_utc_converted": "2018-12-09 06:06:44", "score_overall": 8, "words": "scapegoat jewish jewish jewish conspiracy holocaust holocaust holocaust", "shared_words": "scapegoat jewish conspiracy holocaust", "socre_distint": 4}
{"archived": false, "author": "PeculiarLeah", "body": "Antisemitism is odd in that it can come from the left and the right. For example buying into antisemitism tinged conspiracy theories about control of capitalism. This today is certainly not the most violent form of antisemitism, but it is important for self reflection. Today also many Jewish leftists feel uncomfortable in left wing spaces because of the way Israel is discussed. I'm very very critical of Israel's military actions and I can't stand Bibi, but often rather than actually criticizing real actions of the Israeli government, criticism relies on conspiracies and old antisemitic tropes like the blood libel. There is also the problem of holding Jewish leftists to a kind of \"are you a good Jew or a bad Jew\" litmus test as though all Jews are responsible for the actions of the Israeli government/military even if they aren't Israeli.", "score": 3, "send_replies": true, "subreddit": "ThreeArrows", "date_year_month": "2018-12", "created_utc_converted": "2018-12-10 17:51:08", "score_overall": 6, "words": "conspiracy jewish libel jewish jew jew", "shared_words": "conspiracy jewish libel jew", "socre_distint": 4}
{"archived": false, "author": "Djungeltrumman", "body": "They still talk about how the globalist Jewish conspiracy are fucking up the country, about the jew press, Jewish controlled politicians etc. They’re populist and opportunistic. ", "score": 1, "send_replies": true, "subreddit": "europe", "date_year_month": "2018-12", "created_utc_converted": "2018-12-10 18:56:53", "score_overall": 5, "words": "globalist jewish conspiracy jew jewish", "shared_words": "globalist jewish conspiracy jew", "socre_distint": 4}
{"archived": false, "author": "TheFlusteredcustard", "body": "All these people are wrong except /u/ChipChippersonAMA. Goyim _is_ the jewish term for a non-jew, and the most common usage is by anti-semites, but the meaning is a little different than what these people are claiming. Basically, the implication by the people in the comments is that the movie is jewish propaganda, and that the existence of nazis in the comments defending the position of the germans in WW2 is a detriment to that propaganda. By saying \"The Goyim knows\", they're suggesting that the jewish conspiracy-type overlord people are noticing and fearing the nazis spreading the \"truth\" in the comments.", "score": 33, "send_replies": true, "subreddit": "OutOfTheLoop", "date_year_month": "2018-12", "created_utc_converted": "2018-12-11 15:59:45", "score_overall": 7, "words": "goyim jewish jew jewish goyim jewish conspiracy", "shared_words": "goyim jewish jew conspiracy", "socre_distint": 4}
{"archived": false, "author": "MK_Ultrex", "body": "I can answer that. Historically in Europe (both before and after the Schism, e.g. the separation between Catholic and Orthodox) the Church preached to the masses that Jesus was the first Christian and that the Jews killed Jesus and should be shunned and vilified in eternity for that. That is the theoretical basis of antisemitism. Sounds a stupid thing, however to the uncultured religious masses of yesteryear (and for still too many religious people) this is an unassailable truth.  Jesus was not a Jew, despite being one. \n\n\nHowever there ARE people that call christianity a globalist jewish conspiracy, mainly neo-pagan nutjobs, most prominent example being the Scandinavian neo-nazi/pagan death metal scene. ", "score": 22, "send_replies": true, "subreddit": "TopMindsOfReddit", "date_year_month": "2018-12", "created_utc_converted": "2018-12-11 19:43:44", "score_overall": 4, "words": "jew globalist jewish conspiracy", "shared_words": "jew globalist jewish conspiracy", "socre_distint": 4}
{"archived": false, "author": "Tophattingson", "body": "The comparison to Trump is accurate, but not for the reason you think. Reporting on the awful shit Trump does gets deemed \"fake news\" by his supporters. Reporting on the awful shit Corbyn does get deemed \"brainwashing\" by his supporters.\n\n----\n\nSo, lets see, what do you think below is \"straight facts\" and what do you deny?\n\n----\n\n1. Jeremy Corbyn  was present at a wreath-laying memorial for individuals behind the group that carried out the Munich Olympic massacre.\n\n2. Jeremy Corbyn had a ten-year association with a group which denied the Holocaust. Mr Corbyn was a ‘stalwart’ supporter of Deir Yassin Remembered, attending events in 2013, with the group’s founder, Paul Eisen, a self-professed Holocaust denier.\n\n3. Jeremy Corbyn held a private meeting with a Holocaust denier in Parliament and failed to disclose it when quizzed by a Home Affairs select committee inquiry into anti-Semitism. The meeting with Deir Yassin Remembered (DYR), run by Holocaust denier and notorious anti-Semite Paul Eisen, took place in 2014, one year before Mr Corbyn was elected Labour leader.\n\n4. Jeremy Corbyn said British 'Zionists' have 'no sense of English irony despite having lived here all their lives' and 'need a lesson', while giving speech alongside Islamic extremists at a conference publicised by Hamas' military wing.\n\n5. Jeremy Corbyn called antisemitic terror groups Hamas and Hezbollah ‘our friends’ when inviting them to speak in Parliament. He claimed the invitation to Hezbollah was ‘absolutely the right function of using parliamentary facilities’ and that the group was committed to ‘social justice and political justice’. Corbyn later said this was ‘inclusive language I used, which with hindsight I would rather not have used’.\n\n6. Jeremy Corbyn hosted an Islamic cleric Dyab Abou Jahjah, banned from the UK by the Home Office on the grounds of extremism in Parliament in 2009, who in 2006 wrote that ‘Europe has made political correctness, the cult of the Holocaust and Jew-worshipping its alternative religion’. Corbyn denied having ever met Dyab Abou Jahjah, but quickly changed his mind and stated he had met him in 2009.\n\n7. Corbyn came to the defence of Sheikh Raed Salah, who revived the medieval anti-Semitic ‘blood libel’ slur that Jews cook with children’s blood. Salah was arrested by British police in 2011 when he was due to speak at an event in the House of Commons – alongside Corbyn. In 2012 Corbyn called Salah 'a very honoured citizen'.\n\n8. In December 2016, Labour leader Jeremy Corbyn attended the book launch of – and posed for pictures with – Hatem Bazian, organised by the Islamic Human Rights Commission (the IHRC). Bazian later apologised for anti-Semitic tweets where he shared a picture of an ultra-orthodox Jewish man with the message: ‘Mom, look! I is chosen! I can now kill, rape, smuggle organs and steal the land of Palestinians ‘Yay’ #Ashke-Nazi.’ \n\n9. Jeremy Corbyn defended in 2012 an anti-Semitic mural in East London that depicted Jewish bankers playing a monopoly-style game on the backs of the poor.\n\n10. Jeremy Corbyn support group invited anti-Israel activist Ewa Jasiewicz who vandalised the Warsaw memorial site to speak at its conference in Liverpool.\n\n11. Jeremy Corbyn wrote a letter of support for Stephen Sizer, a vicar disciplined by the Church of England for sharing an article on social media entitled ‘9/11: Israel Did It’.\n", "score": -2, "send_replies": true, "subreddit": "ukpolitics", "date_year_month": "2018-12", "created_utc_converted": "2018-12-12 20:36:32", "score_overall": 9, "words": "holocaust holocaust holocaust holocaust holocaust jew libel jewish jewish", "shared_words": "holocaust jew libel jewish", "socre_distint": 4}
{"archived": false, "author": "Gumgrapes", "body": "Nepotism, and overwhelming representation in media, politics, education, and financial institutions.\n\nIn laymans terms, Jewish people exercise the most control over our society. Likewise, the status of \"jew\" becomes one of a sacred cow. Untouchable, and above all others. In a roundabout way, this falls in line with the traditional Hebrew self image, being \"above the goyim\"...\n\nBefore mods cut down this post because I'm \"an ebil nadsi\", I'm not criticizing or advocating against Jewish people. As a Jewish person, I have a vested interest in seeing my own future. All I've done is state observable, demonstrable facts. Instead of silencing this observation, it may be better to take a moment and ask yourself why you feel much more strongly about these statements than you would if I had replaced \"Jewish\" with \"white\". You may not be as independent of the power structure I described as you would like to think.", "score": 3, "send_replies": true, "subreddit": "KotakuInAction", "date_year_month": "2018-12", "created_utc_converted": "2018-12-13 00:27:53", "score_overall": 7, "words": "jewish jew goyim jewish jewish silencing jewish", "shared_words": "jewish jew goyim silencing", "socre_distint": 4}
{"archived": false, "author": "Tophattingson", "body": "RES tagging is gona be busy in this thread. \n\nOf course Corbyn shouldn't get benefit of the doubt, because there is no doubt. Consider the following:\n\n1. Jeremy Corbyn  was present at a wreath-laying memorial for individuals behind the group that carried out the Munich Olympic massacre.\n\n2. Jeremy Corbyn had a ten-year association with a group which denied the Holocaust. Mr Corbyn was a ‘stalwart’ supporter of Deir Yassin Remembered, attending events in 2013, with the group’s founder, Paul Eisen, a self-professed Holocaust denier.\n\n3. Jeremy Corbyn held a private meeting with a Holocaust denier in Parliament and failed to disclose it when quizzed by a Home Affairs select committee inquiry into anti-Semitism. The meeting with Deir Yassin Remembered (DYR), run by Holocaust denier and notorious anti-Semite Paul Eisen, took place in 2014, one year before Mr Corbyn was elected Labour leader.\n\n4. Jeremy Corbyn said British 'Zionists' have 'no sense of English irony despite having lived here all their lives' and 'need a lesson', while giving speech alongside Islamic extremists at a conference publicised by Hamas' military wing.\n\n5. Jeremy Corbyn called antisemitic terror groups Hamas and Hezbollah ‘our friends’ when inviting them to speak in Parliament. He claimed the invitation to Hezbollah was ‘absolutely the right function of using parliamentary facilities’ and that the group was committed to ‘social justice and political justice’. Corbyn later said this was ‘inclusive language I used, which with hindsight I would rather not have used’.\n\n6. Jeremy Corbyn hosted an Islamic cleric Dyab Abou Jahjah, banned from the UK by the Home Office on the grounds of extremism in Parliament in 2009, who in 2006 wrote that ‘Europe has made political correctness, the cult of the Holocaust and Jew-worshipping its alternative religion’. Corbyn denied having ever met Dyab Abou Jahjah, but quickly changed his mind and stated he had met him in 2009.\n\n7. Corbyn came to the defence of Sheikh Raed Salah, who revived the medieval anti-Semitic ‘blood libel’ slur that Jews cook with children’s blood. Salah was arrested by British police in 2011 when he was due to speak at an event in the House of Commons – alongside Corbyn. In 2012 Corbyn called Salah 'a very honoured citizen'.\n\n8. In December 2016, Labour leader Jeremy Corbyn attended the book launch of – and posed for pictures with – Hatem Bazian, organised by the Islamic Human Rights Commission (the IHRC). Bazian later apologised for anti-Semitic tweets where he shared a picture of an ultra-orthodox Jewish man with the message: ‘Mom, look! I is chosen! I can now kill, rape, smuggle organs and steal the land of Palestinians ‘Yay’ #Ashke-Nazi.’ \n\n9. Jeremy Corbyn defended in 2012 an anti-Semitic mural in East London that depicted Jewish bankers playing a monopoly-style game on the backs of the poor.\n\n10. Jeremy Corbyn support group invited anti-Israel activist Ewa Jasiewicz who vandalised the Warsaw memorial site to speak at its conference in Liverpool.\n\n11. Jeremy Corbyn wrote a letter of support for Stephen Sizer, a vicar disciplined by the Church of England for sharing an article on social media entitled ‘9/11: Israel Did It’.\n\n12. Jeremy Corbyn campaigned for the release of Jawad Botmeh and Samar Alami, who were convicted for a car bomb attack on the Israeli Embassy and the offices of a Jewish charity in 1994.", "score": 0, "send_replies": true, "subreddit": "ukpolitics", "date_year_month": "2018-12", "created_utc_converted": "2018-12-13 11:02:57", "score_overall": 10, "words": "holocaust holocaust holocaust holocaust holocaust jew libel jewish jewish jewish", "shared_words": "holocaust jew libel jewish", "socre_distint": 4}
{"archived": false, "author": "Kinaedus", "body": "The (((Jews))), man.. I'll just lay out the facts here, it isn't my fault the truth is anti-Semitic: Israel is **literally** the same thing as Nazi Germany. I can hear them wailing now \"oy vey, the goyim know!\" Sorry, buds, the secret is out. Y'all claim it's \"anti-Semitic\" to oppose Israel (which you're more loyal to than your home countries!) but we all know you aren't the only Semites. Checkmate. \n\nOh, I know I'll be accused of anti-Semitism, but I can't take it anymore. They smugly believe themselves to be the 'chosen people' of God! That's nuts! Even Ben Shapiro thinks so, and he can't be an anti-Semite because he supports Israel! I've said it many times on this r/CTH: the holocaust didn't happen, but if it did what they're doing in Israel is the same thing and it drives me crazy. I can't stop thinking about it, and I'm not even Israeli or Palestinian! (((Soros)))!\n\nAny second now Soros-funded Zionists are going to start streaming in and calling me anti-Semitic. But anyone who frequents r/DebateAltRight knows they're part of a vast conspiracy to silence the truth. That truth? Ashkenazi Jews are actually descended from Russian Khazar converts! Take THAT, JIDF shills!\n\nBut, seriously, folks. We all know AnCaps are the *real* threat to Jews. Although, I did hear a pretty clever joke from an AnCap the other day. He said \"remember the six gorillion!\" So funny! Oh, and speaking of six gorillion-- that's how many immigrants the (((globalists))) like Soros are going to flood our country with to destroy our way of life!\n\nSo, in summary, if there's one thing I've learned posting about Israel non-stop, it's this: Zionists killed our Lord Jesus Christ. Soros can claim it isn't true until he's red in the face. I dated a Jewish girl once, and I asked her \"how your pussy game so strong?\" and she laid it all out: they drink friggin' Christian baby blood!", "score": 31, "send_replies": true, "subreddit": "ChapoTrapHouse", "date_year_month": "2018-12", "created_utc_converted": "2018-12-13 23:14:23", "score_overall": 4, "words": "goyim holocaust conspiracy jewish", "shared_words": "goyim holocaust conspiracy jewish", "socre_distint": 4}
{"archived": false, "author": "ineed750bucks", "body": "&gt;I know the history. It wasn't a defensive war.\n\nWell then you don't know history. All arab nations collected their armies on the israel's borders and declared a war. It's a historical fact.\n\n&gt;[https://en.m.wikipedia.org/wiki/Origins_of_the_Six-Day_War](President Abdul Rahman Arif of Iraq said that \"the existence of Israel is an error which must be rectified. This is an opportunity to wipe out the ignominy which has been with us since 1948\".\n The Iraqi Prime Minister predicted that **\"there will be practically no Jewish survivors\".**)\n\n&gt;\"We shall not enter Palestine with its soil covered in sand, we shall enter it with its soil saturated in blood\" - President of Egypt, Gamal Abdel Nasser\n\n[And more genocidal quotes from arabic nations here.](http://www.sixdaywar.co.uk/crucial_quotes.htm)\n\n&gt;Again, when confronted with the facts about Israeli crimes, you try to point to alledged misdeeds committed by Arabs.\n\nYou didn't point to crimes. You sarcastically responded \"israel\" with no sources. And now that I posted the actual proof you started attacking me for some reason. Typical hatepuppet.\n\n&gt;You'd still oppose their right of return even if every one of your demands where met.\n\nActually, no. You see, unlike you, I don't care what nationality other people have as long as they don't want to throw me off a roof. This is not the case with the palestinians right now. Or any of the main arabic or muslim majority nations.\n\nActually, my criticism of orthodox jews should have shown you that but heh, that's assuming you comprehend concepts more complex that calls to mob hate and violence.\n\n&gt;idiot\n\nKindergarten grade personal attacks alert, ding-ding-ding.\n\n&gt;country that teaches their children anti-Palestinian hate\n\nYou mean all arabic nations except for israel? People in lebanon view palestinian refugees very unfavouribly. They think they steal welfare and shit like that. In jordan they tried to take over the government and many were expelled.\n\nIn israel, racism against palestinians is illegal. If any teacher ever tries to pull something like that they will instantly lose their job.\n\nActually, the rocket attacks teach people anti-palestinian hate way more than any government ever could.\n\n&gt;Nakba denial, blood libels against Palestinians, and conspiracy theories about Arabs.\n\nSource on all of that. You said that with no sources backing it, didn't you? Also, isn't that **whataboitism** AND a lie? \n\nAlso, look up what \"blood libels\" means, and don't appropriate the phrase. Hamas literally says jews use blood of babies to make matzo.\n\n&gt;And of course you'll be the judge of what does and doesn't constitute terrorism.\n\nKilling civillians. And killing idf soldiers not attacking civillians.\n\n&gt; When the IDF blows up children\n\nThey don't. They blow up rocket launchers in the buildings where hamas puts people intentionally so that they die and become \"victims of evil zionists\". There is no more disgusting organisation than hamas. I have already posted sources, I'm not gonna bother with your antisemitic ass again.\n\n&gt;So be the complete opposite of Israel.\n\nSource? Sarcastic answers is good and all, but last time I checked you got killed in palestine for being a jew, not in israel for being a muslim. There's even a sharia court in israel, which governs the family law of muslims.\n\n&gt;The PLO is entirely secular\n\nOn paper. In actuality, you would get killed immediatly after disrespecting islam. And sharia law was at first de facto and later de yure the only source of legislation. So stop spreading lies:\n\n&gt;The PLO and its dominating faction Fatah are often contrasted to more religious orientated factions like Hamas and the Palestinian Islamic Jihad (PIJ). All, however, represent a predominant Muslim population. Practically the whole population of the Territories is Muslim, most of them Sunni. Only some 50,000 (ca 1%) of the 4.6 million Palestiniansin the occupied Palestinian territories (OPT) are Palestinian Christian.[26][27]\n\n&gt;**The National Charter has no reference to religion. Under President Arafat, the Fatah-dominated Palestinian Authority adopted the 2003 Amended Basic Law, which stipulates Islam as the sole official religion in Palestine and the principles of Islamic sharia as a principal source of legislation.**\n\nAnd they are actively working to make it worse:\n\nhttps://barnabasfund.org/en/news/Palestinian-Authority-creates-new-social-media-blasphemy-law\n\nAnd yes, PA and PLO have the same person in charge right now.\n\n&gt;Israel hated them so much they funded religious organisations like Hamas to counter them.\n\nThis is retarded. Straight out of the \"jews control world politics\" conspiracy theories. Can you hide your antisemitism even worse? You probably don't even know where's gaza and where's the west bank.\n\n&gt;gunpoint\n\nArabic nations encouraged palestinian exodus and promised help. Instead they pocketed the property and territory they took from jews and sentenced palestinians to eternal refugee status under draconic regimes.\n\n&gt;people who wanted to build an ethnostate\n\nNope. By people who realised the importance of having a jewish majority nation, the only nation in the world that would *actually* protect jews. Not a single country in the world has ever protected its jewish minority. And don't say america and canada, they have refused refugee ships filled with people who escaped holocaust, doomed them to die in death camps.\n\n&gt;claiming that they are the real violent racists.\n\nBecause they are. It's weird to dispute this widely known fact. Palestine is one of the worst human rights violators in the world. Towards their own citizens.", "score": 0, "send_replies": true, "subreddit": "ChapoTrapHouse", "date_year_month": "2018-12", "created_utc_converted": "2018-12-14 10:36:33", "score_overall": 7, "words": "jewish conspiracy jew conspiracy jewish jewish holocaust", "shared_words": "jewish conspiracy jew holocaust", "socre_distint": 4}
{"archived": false, "author": "ST616", "body": "&gt;Well then you don't know history. All arab nations collected their armies on the israel's borders and declared a war. It's a historical fact.\n\nIn response to Israeli agression.\n\n&gt;You didn't point to crimes.\n\nApart from the crimes of killing and torturing POWs and civillians.\n\n&gt;You sarcastically responded \n\nWrong\n\n&gt;Actually, no. \n\nLying. You'd find some excuse to justify your racism regardless of what any Palestinian did.\n\n&gt; I don't care what nationality other people have as long as they don't want to throw me off a roof.\n\nClaiming an entire ethnic group are entirely consprised of murderers, and then pretending to be the anti-racist one.\n\n&gt;Actually, my criticism of orthodox jews should have shown you that\n\nJust because you also are bigoted against the Haredi community don't excuse your bigotry towards Palestinians.\n\n&gt;Kindergarten grade personal attacks alert, ding-ding-ding.\n\nOh no, I said a naughty word! How shocking.\n\n&gt;You mean all arabic nations except for israel? People in lebanon view palestinian refugees very unfavouribly. They think they steal welfare and shit like that. In jordan they tried to take over the government and many were expelled.\n\nAgain with the pointing to stuff some Arabs have done to deflect from Israeli crimes.\n\n&gt;In israel, racism against palestinians is illegal.\n\nI thought I'd heard all the Hasbara talking points. This is a new one though.\n\n&gt;Actually, the rocket attacks teach people anti-palestinian hate way more than any government ever could.\n\nFar more Palestinians die from Israeli bombs than Israelis die Palestinian rockets. But Palestinians hating Israelis is somehow down to Palestinian leaders intdoctronating them and nothing to do with Israeli bombs, but Israelis hating Palestinians is somehow down to rockets rather than the intdoctronation they recieve.\n\n&gt;Also, isn't that whataboitism AND a lie? \n\nNo, it's neither.\n\n&gt;Also, look up what \"blood libels\" means, and don't appropriate the phrase.\n\nStop repeating blood libels about the Palestinians.\n\n&gt;Killing civillians. \n\nWhen Israeli civilians die you'll claim it's because they were deliberately targeted by Hamas, ignoring the fact that Israel build it's military instillations near civillian homes, schools, and hospitals. But when Palestinians die you'll claim Israel wasn't deliberately targeting them but it was only an accident  and they were really targeting military sites.\n\n&gt;And killing idf soldiers not attacking civillians.\n\nThere aren't any IDF soilders who aren't attacking civillians.\n\n&gt;They blow up rocket launchers in the buildings where hamas puts people intentionally so that they die and become \"victims of evil zionists\". \n\nThat's a blood libel.\n\n&gt;last time I checked you got killed in palestine for being a jew, not in israel for being a muslim.\n\nCheck again on both counts.\n\n&gt;On paper.\n\nAnd in reality.\n\n&gt;This is retarded. Straight out of the \"jews control world politics\" conspiracy theories. Can you hide your antisemitism even worse? You probably don't even know where's gaza and where's the west bank.\n\nWell doccumente fact that you probably are already aware of. You just hope people less informed than you won't check. I don't think you're ignorant, just dishonest.\n\n&gt;Arabic nations encouraged palestinian exodus and promised help. Instead they pocketed the property and territory they took from jews and sentenced palestinians to eternal refugee status under draconic regimes.\n\nMore lies.\n\n&gt;By people who realised the importance of having a jewish majority nation\n\nSo an ethnostate then.\n\nIt's the entire basis of all your arguments, because Europeans were racist against Jews that gives Jews are right to be racist to Palestinians.\n\n&gt;And don't say america and canada, they have refused refugee ships filled with people who escaped holocaust, doomed them to die in death camps.\n\nThey protected their existing Jewish minorities. Jews were perfectly safe there. The only place they weren't safe was in Europe.\n\n&gt;Because they are. It's weird to dispute this widely known fact. Palestine is one of the worst human rights violators in the world. Towards their own citizens.\n\n\"Widely known\" but people who repeat the talking points they learned in Hasbara training school. I don't know why your government pays you to troll this sub when they are so many more naive people on other subs.", "score": 2, "send_replies": true, "subreddit": "ChapoTrapHouse", "date_year_month": "2018-12", "created_utc_converted": "2018-12-14 12:11:11", "score_overall": 6, "words": "libel jew conspiracy jewish holocaust jewish", "shared_words": "libel jew conspiracy jewish holocaust", "socre_distint": 5}
{"archived": false, "author": "ineed750bucks", "body": "&gt;I don’t have any Jewish friends to use as a token to excuse myself,\n\nThank you. Genuinely.\n\n&gt;I don’t think that Israeli people are fascist, and most likely like here, extremism is fading as the young come of age, which is why there have been right wingers trying to command the narrative. They know that those who will succeed them will not carry their ideals into the future.\n\nHopefully.\n\n&gt;I hate much of Israeli policy where defense is concerned, but it’s not because they’re Jewish.\n\nBut people protest in front of synagogues, use jewish symbols and chant \"gas them\". I have hard time believing they aren't antisemitic.\n\n&gt;I have a hard time understanding how you can condemn people here as anti-Semitic and then say something like “And I understand how dangerous and full of lies islamists are.” \n\nBecause I remember them pummeling my hometown with rockets, boasting the civillian casualties on their tv and then years later pretending they're oh so sorry and \"it's not their fault, it's the rockets, they're too inaccurate\". Sure, it's not their fault they launch unguided fucking rockets in the general direction of densely populated districts.\n\nAnother great example is them proclaiming \"the equality of all religions\"...as long as they're under control by islam, which is the best, the ultimate religion. And then they dedicate a huge part of their manifesto to listing all the jewish conspiracy theories, from \"jews control the media\", through \"holocaust was a hoax\" (it's their favourite one), and finally to the fucking original blood libel, the matza made out if muslim babies' blood. I'm not even fucking joking.\n\nhttps://en.m.wikipedia.org/wiki/Blood_libel\n\nCtrl+F hamas\n\nJust to be clear, I've got nothing against muslims, only fundamemtal islamists. Though I do pity them as members of any religion.", "score": 1, "send_replies": true, "subreddit": "ChapoTrapHouse", "date_year_month": "2018-12", "created_utc_converted": "2018-12-14 19:54:30", "score_overall": 7, "words": "jewish jewish jewish jewish conspiracy holocaust libel", "shared_words": "jewish conspiracy holocaust libel", "socre_distint": 4}
{"archived": false, "author": "ineed750bucks", "body": "&gt;\"\"\"\"\"\"\"\"sources\"\"\"\"\"\"\"\"\n\nNo, you see, antisemites use (((echoes))), not \"\"\"\"\"those\"\"\"\"\". You should keep in touch with your antisemitic memes.\n\nAlso, you haven't really disproved anything. And since when do you consider wikipedia not a source?\n\n&gt;You're not convincing anyone with your barely concealed racism. It's inredibly transparent.\n\nIf it's so transparent then point me to it.\n\n&gt;&gt;I'm not claiming this about an ethnic group, I'm claiming this about a culture. \n\n&gt;A distintion without a difference.\n\nThen you admit you are an antisemite for hating all israeli?\n\n&gt;You say that as if execution collaborators isn't the right thing to do.\n\n1) they weren't collaborationists. Hamas just didn't like them. Just like when KGB murdered my ancestors.\n\n2) you support torture, rape and extrajudicial killing. You are literally evil. You'd make a nice auschwitz guard.\n\n&gt;You're bigoted against atheist Palestinians and Palestinians with moderate religious views just as much as you're bigoted against \"fundamentalists\".\n\nThat's a lie. Prove it.\n\nAlso, these people currently have no voice in palestine. Hamas and PA block them. They torture, extort and murder them. And **you** are making this happen. The blame for the broken lgbt people is on you as much as it is on hamas.\n\n&gt;That isn't OK just because you are also an antisemite who is bigoted against the Haredi community.\n\nHow am I antisemitic for criticizing religion? If they say \"gay people are a bird flu\" why should I have any respect for them?\n\n&gt;Palestinians are being bombed by Israel.\n\nHamas* is being bombed by israel.\n\n&gt;they'd send military equipment to help defeat Israel.\n\nNo, they would send actual humanitarian aid like they promised.\n\n&gt;If it looks like a shill, walks like a shill, and quacks like a shill, it's a shill.\n\nWhat is this demagogy bullshit? Do you even know what shill is?\n\n&gt;It was true before the Iron Dome was established.\n\nThe first intifada killed 525 innocent israeli. In israel, not settlers or whatever.\n\n&gt;And of course if Palestinians tried to create an Iron Dome of their own, they would be prevented from doing so.\n\n1)What are you basing this on?\n2)Iron dome is a system against unguided islamist rockets. It won't work for palestinians because israel doesn't launch unguided rockets. Israel uses precise strikes on military objects.\n3)Hamas doesn't care about civillian lives. I have posted interviews from hamas leaders where they admit it. You can't deny it.\n\n&gt;More lies.\n\nI have posted reputable sources. You can deny it however you want, it just shows how pathetic you antisemites are.\n\n&gt;&gt;they don't build them near civillian homes schools and hospitals,\n\n&gt;Lies. They absoloutely do as you well know.\n\nI have literally ridden past bases far away from any civillian buildings. You can actually look up even army hospital locations on google maps, if they aren't classified. But you can also deny it without any reason and it will simply prove again just how brainwashed you are.\n\n&gt;They don't have the ability to use guided rockets.\n\nThey get billions of dollars in aid from everywhere. They could have gotten however many guided rockets they could before the blockade. But they didn't.\n\n&gt;If they did they would use them.\n\nThen why have they launched these unguided rockets at heavily populated districts from the beginning of each conflict?\n\n**Also, why do they use unguided rockets to begin with? If they are so inaccurate and kill and wound only civillians why do they use them at all? Their hit and run tactics killed enough idf soldiers so why didn't hamas and hezbollah stick to attacks on soldiers?**\n\n&gt;&gt;https://youtu.be/JJXAwohdBZE\n\n&gt;&gt;\"Evil idf zionists\". Keep telling this lie to yourself, closet antisemite.\n\n&gt;None of this adresses the fact that IDF members all kill civillians.\n\nThen why didn't he shoot everyone? You paint all idf soldiers as monsters, don't you? Who's the monster in the video? The dirtbag father who was trying to sacrifice his child for hamas and tried to make him throw rocks at idf? Or the soldier who was very careful and nice to the poor kid?\n\n&gt;All of Gaza is a densely populated district because Israel won't let Gazans leave Gaza.\n\nGaza still has a lot of open spaces. I hope you don't think gaza is one big city? Also, before the blockade they could leave whenever they wanted.\n\n&gt;I don't give much credence to CIA front organisations, so no.\n\n1)great love for bullshit conspiracy theories is a red flag, a sign of an antisemite\n\n2)it becomes even more retarded when you look through their reports on human rights violations by the CIA\n\n3)you should actually be in love with them considering their anti-israel bias and just how much they report against israel\n\n&gt;1948 onwards.\n\nProvide me a single case of a massacre against muslims in israel after the martial law was abolished.\n\n&gt;\"\"\"\"\"\"\"\"sources\"\"\"\"\"\"\"\"\n\nFirst of all it's (((sources))). Seconds of all, explain what's wrong with the sources, or your statement is invalid.\n\n&gt;I don't believe for a second that you aren't already perfectly well aware of the fact. Not interested in playing your games.\n\nDude, you claimed that israel created hamas. You have to prove it or admit you lied.\n\n&gt;All that territory already belonged to those Arab states.\n\nSo you admit that you're antisemitic? Cause you're clearly biased against jews here. Arabic states ethnically cleansed jews from their territory and stole their property but you consider this \"rightful\" while israel doing the same to a part of the arabs that waged a war against the jewish population is a horrible violation of human rights?\n\nEither be fair and equal in your statements or admit that you're antisemitic.\n\n&gt;\"Arabs are doing bad things so that makes Israel doing even worse things OK.\"\n\nThat's not what I said. I said that you should condemn arabic states for their persecution of palestinians or stop pretending that you're not antisemitic. Also:\n\n&gt;Israel doing even worse\n\nLul no. Not even close.\n\n&gt;Yes it would. South Africa was a white ethnostate a whites were a small minority.\n\nSouth Africa wasn't a white ethnostate, you tabula rasa, it was an apartheid. They *tried* to make a white ethnostate by kicking out and/or killing all non-whites but didn't succeed. \n\nNazi Germany was an ethnostate, they actually mostly succeed at removing all minorities. Arabic nations are muslim ethnostates, most of them have ethnicly cleansed their countries of all jews and non-arabs/non-muslims.\n\nIsrael isn't an ethnostate because it has a minority of 2 million arabs. And other minorities, including a huge russian community.\n\n&gt;Which Israel absoloutely doesn't do.\n\nProve it. I need proof from you. Stop barking propaganda and start providing proof.\n\n&gt;It held up for the same reason it had held up for centuries.\n\nThat's very naive. Every jew knows it can all go down in a second.\n\n&gt;Jews have been living in Muslim countries at peace with their Muslim neighbours for centuries and centuries.\n\nThat's a lie and I have already proven otherwise in a discussion with you, though in another comment chain. You ignored it btw, so I take that as you admitting your mistake/lie.\n\nHere's the link to the comment:\n\nhttps://www.reddit.com/r/ChapoTrapHouse/comments/a5vqeh/natalie_portman_israels_nationstate_law_is_racist/ebrff6b\n\n&gt;&gt;They were heavily persecuted in russia,\n\n&gt;Which is part of Europe.\n\nAs someone who spent half of his life in russia and actually read about russian history, you're wrong.\n\n&gt;Jews have been living in Muslim countries at peace with their Muslim neighbours for centuries and centuries.\n\nWhy did you copypaste it? I mean, I can copypaste too:\n\nhttps://www.reddit.com/r/ChapoTrapHouse/comments/a5vqeh/natalie_portman_israels_nationstate_law_is_racist/ebrff6b\n\n&gt;Only when it was ruled by a European power (Spain).\n\nNope. The power of catholics was and is strong there. And catholics hate jews.\n\n&gt;&gt;you keep using this blood libel\n\n&gt;LOL.\n\nSo you admit it? Or do you not know what a [blood libel](https://en.m.wikipedia.org/wiki/Blood_libel) is?\n\n&gt;&gt;and claim to be a human rights activist.\n\n&gt;Never claimed that.\n\nSo you don't care about actual lives of palestinians and you just want to hate israel? Because that means you're an antisemite.\n\n&gt;Neither of those links demonstrate your claim that \"Palestine is one of the worst human rights violators in the world.\"\n\nYou haven't opened them have you? Or are there like propaganda googles that filter out all facts you don't want to know?", "score": 0, "send_replies": true, "subreddit": "ChapoTrapHouse", "date_year_month": "2018-12", "created_utc_converted": "2018-12-15 16:25:04", "score_overall": 5, "words": "conspiracy jewish jew libel libel", "shared_words": "conspiracy jewish jew libel", "socre_distint": 4}
{"archived": false, "author": "Kinaedus", "body": "The (((Jews))), man.. I'll just lay out the facts here, it isn't my fault the truth is anti-Semitic: Israel is literally the same thing as Nazi Germany. I can hear them wailing now \"oy vey, the goyim know!\" Sorry, buds, the secret is out. Y'all claim it's \"anti-Semitic\" to oppose Israel (which you're more loyal to than your home countries!) but we all know you aren't the only Semites. Checkmate. \n\nOh, I know I'll be accused of anti-Semitism, but I can't take it anymore. They smugly believe themselves to be the 'chosen people' of God! That's nuts! Even Ben Shapiro thinks so, and he can't be an anti-Semite because he supports Israel! I've said it many times on this r/CTH: the holocaust didn't happen, but if it did what they're doing in Israel is the same thing and it drives me crazy. I can't stop thinking about it, and I'm not even Israeli or Palestinian! (((Soros)))!\n\nAny second now Soros-funded Zionists are going to start streaming in and calling me anti-Semitic. But anyone who frequents r/DebateAltRight knows they're part of a vast conspiracy to silence the truth. That truth? Ashkenazi Jews are actually descended from Russian Khazar converts! Take THAT, JIDF shills!\n\nBut, seriously, folks. We all know AnCaps are the real threat to Jews. Although, I did hear a pretty clever joke from an AnCap the other day. He said \"remember the six gorillion!\" So funny! Oh, and speaking of six gorillion-- that's how many immigrants the (((globalists))) like Soros are going to flood our country with to destroy our way of life!\n\nSo, in summary, if there's one thing I've learned posting about Israel non-stop, it's this: Zionists killed our Lord Jesus Christ. Soros can claim it isn't true until he's red in the face. I dated a Jewish girl once, and I asked her \"how your pussy game so strong?\" and she laid it all out: they drink friggin' Christian baby blood!", "score": 8, "send_replies": true, "subreddit": "ChapoTrapHouse", "date_year_month": "2018-12", "created_utc_converted": "2018-12-15 19:00:26", "score_overall": 4, "words": "goyim holocaust conspiracy jewish", "shared_words": "goyim holocaust conspiracy jewish", "socre_distint": 4}
{"archived": false, "author": "[deleted]", "body": "He didn't say or do anything. He's just a rich liberal Jew. Because of his rich liberal Jewishness, right-wing media tend to blame him for literally everything. The people who lost loved ones in school shootings, they were paid by Soros. The people protesting Neo-Nazis, paid by Soros. The idea is to foster a conspiracy theory which promotes the idea that only conservatives are real people, and everyone else is just agents of a secret Illuminati style Jewish cult.", "score": 16, "send_replies": true, "subreddit": "worldnews", "date_year_month": "2018-12", "created_utc_converted": "2018-12-15 19:53:41", "score_overall": 4, "words": "jew conspiracy illuminati jewish", "shared_words": "jew conspiracy illuminati jewish", "socre_distint": 4}
{"archived": false, "author": "WiseguyD", "body": "Whiteness is a social construct, and Jewish whiteness is revokeable depending on whether antisemitism is in vogue. This has always been been the case. It was that way in Germany in the 1920s and 30s; before that, Jews were better-integrated there than anywhere else in the world. It's that way now in Eastern Europe, even after the horrors of the Holocaust. I don't know if I'd go so far as to say that America has reached Viktor Orban levels, but (and this might sound like a bit of a reach) the vast majority of Jews stopped being \"white\" in America the moment the first shot was fired at Tree of Life.\n\nI think this might be a hot take, but I do believe that whether a Jew is considered a mainstream part of \"accepted\" society does partially hinge on their political views, partly due to the coupling of anti-socialism and anti-Judaism during the Nazi regime (and to a lesser extent, the Hollywood Blacklist). Jews often take on the role of the \"internal threat\" in fascist ideology, and that internal threat narrative doesn't really work if your frame of reference is someone like Bloomberg who's a police-state billionaire already. Bernie, though? The weird gesticulating hobo with a disdain for the billionaihs? That's a pretty damned good scapegoat if I've ever seen one.", "score": 34, "send_replies": true, "subreddit": "ChapoTrapHouse", "date_year_month": "2018-12", "created_utc_converted": "2018-12-15 23:47:24", "score_overall": 4, "words": "jewish holocaust jew scapegoat", "shared_words": "jewish holocaust jew scapegoat", "socre_distint": 4}
{"archived": false, "author": "ineed750bucks", "body": "&gt;&gt;So you support torture, extrajudicial murder of political opponents\n\n&gt;No, I support military resistance against occupiers and collaborators.\n\n1)Human rights organisations say hamas tortures everyone who disagrees with them. I have provided sources.\n\n2)Torture and extrajudicial murder is disgusting and you are scum for supporting it.\n\n&gt;&gt;and persecution of gays and women?\n\n&gt;Of course not.\n\nHamas does it, as I have proven with the sources. And you support hamas. Which means you support persecution of gays and women.\n\n&gt;&gt;And murder of innocent israeli civilians outside of west bank?\n\n&gt;So called innocent.\n\nHow are they not innocent? If you claim that being born in israel/being born a jew is a sin then you are nationalistic and antisemitic and I wish you disappeared.\n\n&gt;&gt;Are you also a holocaust denier like hamas?\n\n&gt;No, denial of genocide is something one of many things the two of us don't share.\n\nI have proved hamas denies holocaust in the previous comment. Here's one of the quotes:\n\n&gt;In 1982, Mahmoud Abbas, later to become President of the Palestinian Authority, wrote his doctoral thesis which later became a book, The Other Side: The Secret Relationship Between Nazism and Zionism. In the book, Abbas raised doubts that gas chambers were used for extermination of Jews, and suggested that the number of Jews murdered in the Holocaust was \"less than a million\", claiming secret ties between the Nazis and the Zionist movement. He also claimed that the Holocaust was a joint Zionist-Nazi plot, writing \"The Zionist movement led a broad campaign of incitement against the Jews living under Nazi rule, in order to arouse the government's hatred of them, to fuel vengeance against them, and to expand the mass extermination.\"\n\n&gt;&gt;Do you believe jews control the media and make matza with the blood of non-jewish toddlers?\n\n&gt;You know I don't.\n\nNo, you support hamas which said the following multiple times in different variations:\n\n&gt;Ahmad Bahr, Deputy Speaker of the Hamas Parliament, stated in a sermon that aired on Al-Aqsa TV:\n\n&gt;&gt;If the enemy sets foot on a single square inch of Islamic land, Jihad becomes an individual duty, incumbent on every Muslim, male or female. A woman may set out [on Jihad] without her husband's permission, and a servant without his master's permission. Why? In order to annihilate those Jews. ... O Allah, destroy the Jews and their supporters. O Allah, destroy the Americans and their supporters. O Allah, count them one by one, and kill them all, without leaving a single one.\n\n&gt;Hamas spokesman Osama Hamdanrepeated the blood libel myth:\n\n&gt;&gt;We all remember how the Jews used to slaughter Christians, in order to mix their blood in their holy matzos... It happened everywhere.\n\nYou can't deny this anymore.\n\n&gt;&gt;Also, that means you support war, right?\n\n&gt;I support the right of oppressed people to liberate themselves by any means necissary including military means.\n\nEven though the war only brought palestinians death and poverty? Even though before the intifadas palestine had gdp per capita higher than in most arabic states because of their economic relations with israel? Even by murdering innocent civilians inside pre-1967 borders? If you say that being born in israel is a sin one more time it will mean you admit that you're antisemitic and nationalistic and I will not talk to you again. And if you start whatabout-ing again you admit that you agree with me fully and renounce support for hamas and I will not answer you again.", "score": 0, "send_replies": true, "subreddit": "ChapoTrapHouse", "date_year_month": "2018-12", "created_utc_converted": "2018-12-16 02:53:03", "score_overall": 7, "words": "jew holocaust holocaust holocaust holocaust jewish libel", "shared_words": "jew holocaust jewish libel", "socre_distint": 4}
{"archived": false, "author": "EduTheRed", "body": "**Text of Times article by Andrew Gilligan:**\n\nA senior Labour Party official shared anti-semitic material blaming Jews for “all the wars in the world”.\n\nLabour’s West Midlands regional organiser, Mohammed Yasin, was suspended last night after The Sunday Times approached the party with a dossier of his activity on social media. Labour has launched an investigation.\n\nFor more than two years Yasin, not to be confused with the Labour MP with a similar name, shared anti-semitic posts and 9/11 conspiracy theories, praised a homophobic preacher and described his former leader Tony Blair as a “child-killer”.\n\nHis Twitter feed, now removed, suggests he was working for Labour when he made most of the posts.\n\nLabour has been riven by allegations of anti-semitism among members and activists, but Yasin is believed to be the first paid member of staff to be implicated.\n\nIn February 2016 Yasin shared a post from the Lord Dreadnought site, headlined with a quote from the actor Mel Gibson, “Jews are responsible for all the wars in the world.” Gibson made the remarks after being arrested for driving under the influence, according to a 2006 police report. Attacking “Zionist madness”, the post showed two people laughing uproariously at the suggestion that anyone else could be to blame, in the line “when someone tells me it’s not the Jews”.\n\nYasin also shared a post, “Why Israel is a problem”, stating that “due to Holocaust propaganda” America had provided Israel with $233.7bn in aid and allowed it a nuclear arsenal. He shared a picture showing a rabbi next to the words: “Goyim [non-Jews] were born only to serve us. They have no place in the world — only to serve the people of Israel.”\n\nIn January 2016 he shared a video on the “Rothschilds, the world’s most wicked and wealthiest family” and in 2015 shared a cartoon showing the BBC and CNN ignoring butchered Palestinians while training their cameras on a crying baby with a Star of David round its neck.\n\nIn November 2014 Yasin wrote that “US imperialism needs Israel to keep the masses permanently at war”, accusing the Jewish state of “genocide”.\n\nTwo years later he praised a Zimbabwean cleric, Mufti Ismail Menk, as “one of the finest Islamic scholars of our time”. A speaking tour of British universities by Menk was cancelled in 2013 after it emerged that he had said same-sex acts were “filthy”, “wrong” and synonymous with “acts of immorality”.\n\nHe has been recorded as saying: “With all due respect to the animals, [gay people] are worse than those animals.”\n\nIn April 2017 Yasin shared a post saying western governments had “lied about 9/11”.\n\nAs regional organiser, an official reporting to the West Midlands regional director, Yasin is a key Labour figure in one of the prime swing areas.\n\nAnother of his posts, on September 27 this year, shows him with Jeremy Corbyn at Labour’s conference in Liverpool.\n\nIt was “great to catch up with Labour colleagues and the Shadow Cabinet at the staff event yesterday,” he wrote. “JC for PM.”\n\nAsked whether he denied sharing the posts, Yasin said: “I’m not aware. Before I make any comments I need to check.” Asked about the Mel Gibson post, he said: “I don’t agree with that.”\n\nA Labour spokesman said: “We take all allegations seriously and fully investigate them in accordance with our rules and procedures.”\n\n@mragilligan\n", "score": 40, "send_replies": true, "subreddit": "ukpolitics", "date_year_month": "2018-12", "created_utc_converted": "2018-12-16 08:44:33", "score_overall": 4, "words": "conspiracy holocaust goyim jewish", "shared_words": "conspiracy holocaust goyim jewish", "socre_distint": 4}
{"archived": false, "author": "Tophattingson", "body": "1. Jeremy Corbyn  was present at a wreath-laying memorial for individuals behind the group that carried out the Munich Olympic massacre.\n\n2. Jeremy Corbyn had a ten-year association with a group which denied the Holocaust. Mr Corbyn was a ‘stalwart’ supporter of Deir Yassin Remembered, attending events in 2013, with the group’s founder, Paul Eisen, a self-professed Holocaust denier.\n\n3. Jeremy Corbyn held a private meeting with a Holocaust denier in Parliament and failed to disclose it when quizzed by a Home Affairs select committee inquiry into anti-Semitism. The meeting with Deir Yassin Remembered (DYR), run by Holocaust denier and notorious anti-Semite Paul Eisen, took place in 2014, one year before Mr Corbyn was elected Labour leader.\n\n4. Jeremy Corbyn said British 'Zionists' have 'no sense of English irony despite having lived here all their lives' and 'need a lesson', while giving speech alongside Islamic extremists at a conference publicised by Hamas' military wing.\n\n5. Jeremy Corbyn called antisemitic terror groups Hamas and Hezbollah ‘our friends’ when inviting them to speak in Parliament. He claimed the invitation to Hezbollah was ‘absolutely the right function of using parliamentary facilities’ and that the group was committed to ‘social justice and political justice’. Corbyn later said this was ‘inclusive language I used, which with hindsight I would rather not have used’.\n\n6. Jeremy Corbyn hosted an Islamic cleric Dyab Abou Jahjah, banned from the UK by the Home Office on the grounds of extremism in Parliament in 2009, who in 2006 wrote that ‘Europe has made political correctness, the cult of the Holocaust and Jew-worshipping its alternative religion’. Corbyn denied having ever met Dyab Abou Jahjah, but quickly changed his mind and stated he had met him in 2009.\n\n7. Corbyn came to the defence of Sheikh Raed Salah, who revived the medieval anti-Semitic ‘blood libel’ slur that Jews cook with children’s blood. Salah was arrested by British police in 2011 when he was due to speak at an event in the House of Commons – alongside Corbyn. In 2012 Corbyn called Salah 'a very honoured citizen'.\n\n8. In December 2016, Labour leader Jeremy Corbyn attended the book launch of – and posed for pictures with – Hatem Bazian, organised by the Islamic Human Rights Commission (the IHRC). Bazian later apologised for anti-Semitic tweets where he shared a picture of an ultra-orthodox Jewish man with the message: ‘Mom, look! I is chosen! I can now kill, rape, smuggle organs and steal the land of Palestinians ‘Yay’ #Ashke-Nazi.’ \n\n9. Jeremy Corbyn defended in 2012 an anti-Semitic mural in East London that depicted Jewish bankers playing a monopoly-style game on the backs of the poor.\n\n10. Jeremy Corbyn support group invited anti-Israel activist Ewa Jasiewicz who vandalised the Warsaw memorial site to speak at its conference in Liverpool.\n\n11. Jeremy Corbyn wrote a letter of support for Stephen Sizer, a vicar disciplined by the Church of England for sharing an article on social media entitled ‘9/11: Israel Did It’.\n\n12. Jeremy Corbyn campaigned for the release of Jawad Botmeh and Samar Alami, who were convicted for a car bomb attack on the Israeli Embassy and the offices of a Jewish charity in 1994.", "score": 9, "send_replies": true, "subreddit": "ukpolitics", "date_year_month": "2018-12", "created_utc_converted": "2018-12-16 14:39:06", "score_overall": 10, "words": "holocaust holocaust holocaust holocaust holocaust jew libel jewish jewish jewish", "shared_words": "holocaust jew libel jewish", "socre_distint": 4}
{"archived": false, "author": "melechshelyat", "body": "&gt;dude my grandma is 70 years old. 70 years is not a long time, especially not in a historical context. neither is 100 years.\n\n70 years is an eon, after multiple wars attempting to wipe out the state of Israel and its population.\n\n&gt;i'm not saying that we should ignore current demographics in place of older censuses, which are hardly always reliable as we know from many cases in the middle east, i am only saying that claiming that Jerusalem is Israel's and that's that is ignoring a large part of history in which Jewish people were not the majority in Jerusalem\n\nYes, Jewish people were not the majority in Jerusalem. They have been forcibly evicted due to antisemitism many times over the years. So you suggest...what? Please explain why the demographics of 100 years ago determine ownership today.\n\nIn 100 years, America will no longer be majority-white. Do you believe that because of this \"long history\" of white ownership and majority-status, that whites deserve to keep control?\n\nJeez, that's insufferable. Where my grandparents lived should not determine who rules me, or anyone else. That's just absurd.\n\n&gt; no one is arguing that it should be Arab-controlled or that we need to force demographic changes\n\nWell, the Palestinians are, but that's another story.\n\n&gt; we're arguing that state that is explicitly meant for the safety of Jews only, and has shown that it has no regard for the life of many Muslim Arabs in the surrounding area\n\nThis is completely false. The Arab proportion of Jerusalem has gone up since 1967, and [half of Jerusalem's Arab population](https://www.washingtoninstitute.org/policy-analysis/view/half-of-jerusalems-palestinians-would-prefer-israeli-to-palestinian-citizen) would rather be ruled by the Jewish state than an Arab one.\n\nIt is Palestinian leaders who have called for a [Palestinian capital in East Jerusalem](https://www.haaretz.com/middle-east-news/palestinians/.premium-ahead-of-un-address-abbas-rejects-netanyahu-s-backing-of-palestinian-state-1.6512391), and also said that [no Israelis can live in a Palestinian state](https://www.reuters.com/article/us-palestinians-israel-abbas/abbas-wants-not-a-single-israeli-in-future-palestinian-state-idUSBRE96T00920130730).\n\nPut the two together, and you have the Palestinian leader saying any area he takes over can't have Jews in it.\n\n&gt; if a government is to rule the area of not only Jerusalem, but also the greater Israel-Palestine area, it should be accommodating to both Jews and Muslims\n\nIrrelevant. We're talking about Jerusalem.\n\nBut while we're at it, let's consider the differences here:\n\n* Israel has over 20% of its population as Arab. They can vote, be in its Parliament, join its major political parties, and sit on its Supreme Court.\n\n* Palestine, the \"moderate\" half in the West Bank (not even talking about Gaza) says that if you [sell land to a Jew](https://www.jpost.com/Middle-East/PA-Death-penalty-for-those-who-sell-land-to-Jews) you should be punished by death. Their Constitution says all [laws are based on Sharia (Islamic) law](https://www.palestinianbasiclaw.org/basic-law/2003-amended-basic-law) (Article 4, Section 2).\n\n* [60% of Israeli Arabs](https://www.jpost.com/Israel-News/Survey-60-percent-of-Arab-Israelis-have-positive-view-of-state-506150) have a positive view of the state, and [while noting discrimination (which occurs in every country in the world)](https://www.i24news.tv/en/news/israel/society/160937-171122-israeli-arabs-proud-to-be-israeli-but-report-widespread-incitement-poll), a majority are proud to be Israeli.\n\n* Palestine has 0 Jews, says no Israeli can live in their state, and their \"moderate\" leader has a PhD in [Holocaust denial](http://www.thetower.org/article/how-holocaust-denial-shaped-mahmoud-abbas-worldview/) (I mean really, a PhD was given to him for a Holocaust-denying thesis, from a Soviet university), he [blames Jews for their own genocide](https://www.timesofisrael.com/abbas-says-jews-behavior-not-anti-semitism-caused-the-holocaust/), he repeated a [medieval antisemitic myth](https://www.youtube.com/watch?v=ZKmo-XJef3Y) about Jews to the European Parliament, and he claims Jews have [dirty feet that defile holy places](https://www.jpost.com/Arab-Israeli-Conflict/Abbas-Israelis-have-no-right-to-desecrate-our-holy-sites-with-their-filthy-feet-416307).\n\n* Israel allows free access to all holy sites, including Arab ones. It prevents Jews from praying on the Temple Mount, Jews' holiest site, because Arabs riot everytime Jews go up there.\n\n* The last Arab government to control the area was Jordan. It prevented Jews visiting any of their holy sites, including the Western Wall. [Palestinian preachers on the Temple Mount](https://www.jpost.com/Arab-Israeli-Conflict/Al-Aksa-blood-libel-preacher-who-said-Jews-masterminded-911-arrested-410982) insist Jews were behind 9/11, are evil, etc.\n\nWhich state is more accommodating to the other?\n\n&gt; Jews as a current inhabitant of those neighborhoods, and Arab Muslims as the historical inhabitants and majority up until just two generations ago\n\n[A generation is 25 years](https://isogg.org/wiki/How_long_is_a_generation%3F_Science_provides_an_answer), which means it was last majority-Arab in Jerusalem roughly 4 generations ago. That nitpick aside, the fact that people *used* to be a majority somewhere doesn't change that they *aren't*. Why should *today's* population be affected by the demographics of a hundred years ago?\n\nI'm sure you'd be singing a different tune if I said whites should continue to run the US because they have been the majority so long, even if they aren't the majority in 100 years. Because it would be dumb. That's the opposite of how democracy and human rights work.\n\n&gt; and yet the basis of Jewish families migrating to Jerusalem/Israel is based on a land claim several thousand years old.\n\nYep.\n\nIf you had asked me 100 years ago if Jews owned the land because they had a majority 2000 years ago, I'd have said no. **If they legally became a majority**, they could have a right to own the land. That's exactly what happened.\n\nWhy is this controversial? 100 years ago, 2000 years ago, neither changes **who lives there now**. That's what determines how we divide land, that and state sovereignty and international law.\n\nAll of them say West Jerusalem belongs to Israel. Why should the demographics of 100 years ago alter the situation of today?\n\n&gt; it may seem like an irrelevant argument, as the Jewish families have already migrated and i don't think anyone is proposing that we forcefully migrate them back (because that's obviously stupid and inhumane etc)\n\nMany, many Palestinians suggest precisely this. Hamas certainly does, and it controls 1/3 of the Palestinian population.\n\n&gt; but in order for these discussions to actually be fruitful and productive we need to acknowledge the totality of the historical context, not just the historical context as it exists from the years of 1948 to today\n\nThe \"historical context\" changes nothing about who controls it today, and international law.\n\nSo we can say yes, Arabs held a majority by keeping Jews out of their homeland of birth for decades (as did the Ottomans, Romans, etc.).\n\nThat doesn't change who controls it today. It doesn't change who has a right to control it today. It has been undisputed since 1948, and no one since before 1948 is still around to claim otherwise who owned it back then. An Arab-majority Jerusalem is barely within living memory, if at all, and it wasn't even Arab-Muslim back then (it hasn't been that in hundreds of years), and the current Palestinian state is explicitly Arab-Muslim. Palestinian Arabs don't have any claim to West Jerusalem. Even other Arab states acknowledge that. Why can't you?", "score": 2, "send_replies": true, "subreddit": "Ask_Politics", "date_year_month": "2018-12", "created_utc_converted": "2018-12-16 20:06:58", "score_overall": 11, "words": "jewish jewish jewish jew holocaust holocaust holocaust holocaust libel jewish jewish", "shared_words": "jewish jew holocaust libel", "socre_distint": 4}
{"archived": false, "author": "eggsssssssss", "body": "BDS South Africa’s raging antisemitism aside, I strongly disagree with you about *The Merchant of Venice*, though it’s not a conclusion I’ve come to lightly.\n\nYes, *Merchant* celebrates the triumph of its protagonists over the demonized token jew. The fact that the play entertains antisemitic ideas (and plays antisemitic tropes to entertain its audience) is inarguable. But, the question of whether it’s an irredeemably antisemitic play is a different question. I’m of the school that *Merchant* is actually a very pro-jewish play for its time, and maybe ours, too. There are a couple of important considerations, to preface:\n\nThe first would be that, like many of Shakespeare’s works, it’s not an entirely original work. Everyone knows *Hamlet* because of Shakespeare, but *The Tragedy of Hamlet, Prince of Denmark* was only the best and most memorable of a number of older renditions of the tale. Likewise, *The Merchant of Venice* was a Shakespearean adaption of a similar play titled *The Jew of Malta* by the Bard’s contemporary, Christopher Marlowe. Marlowe’s tragedy features a shit ton of antisemitic canards: the titular Jew of Malta is completely bloodthirsty, a greedy merchant named Barabas who displays his exceptional greed, treachery, and manipulative and murderous nature throughout the show (during which he strangles a friar, betrays his allies, sells out his country, and—surprise—poisons dozens of people).\n\nSecondly: take into account the fact that most all jews had been expelled from England some 300 years before that play’s writing, and it’s safe to say it was written in a diversity vacuum. The english audience may reasonably have never seen a single jewish soul in their lives, maybe never met a jew for generations.\n\n(cont.)", "score": 14, "send_replies": true, "subreddit": "Judaism", "date_year_month": "2018-12", "created_utc_converted": "2018-12-16 23:23:58", "score_overall": 12, "words": "merchant merchant jew merchant jewish merchant jew jew merchant greed jewish jew", "shared_words": "merchant jew jewish greed", "socre_distint": 4}
{"archived": false, "author": "stonedspike", "body": "Zionist Occupational/Occupied Government. Neo-Nazi conspiracy theory which dictates that all western governments are secretly controlled by a Jewish Illuminati who use multiculturalism and degeneracy to \"cuck\" the white populations. This is done out of some Talmud-inspired hatred for the Goyim. It's pretty cringe, I know.", "score": 7, "send_replies": true, "subreddit": "ToiletPaperUSA", "date_year_month": "2018-12", "created_utc_converted": "2018-12-18 00:53:08", "score_overall": 4, "words": "conspiracy jewish illuminati goyim", "shared_words": "conspiracy jewish illuminati goyim", "socre_distint": 4}
{"archived": false, "author": "davy_jones_locket", "body": "It did both. It participated in the atrocities of Nazism and still participated in anti-Semitic acts against Jews returning to Poland. What part confuses you?\n\nEdit: https://www.amazon.com/Bondage-Dead-Poland-Holocaust-History/dp/0815604033\n\nAbout one million Polish citizens were members of the German minority. Following the invasion of 1939, additional 1,180,000 German speakers came to occupied Poland either from the Reich or from the east with little to lose (the Volksdeutsche). Many hundreds of ethnically German men in Poland joined the Nazi Volksdeutscher Selbstschutz as well as Sonderdienst formations launched in May 1940 by Gauleiter Hans Frank stationed in occupied Kraków.\n\nAs German authorities implemented killing on an industrial scale, they drew upon Polish police forces and railroad personnel for logistical support, notably to guard ghettos where hundreds of thousands of Jewish men, women, and children were held before deportation to killing centers. The so-called Blue Police was a force some 20,000 strong. These collaborators enforced German anti-Jewish policies such as restrictions on the use of public transportation and curfews, as well as the devastating and bloody liquidation of ghettos in occupied Poland from 1942-1943. Paradoxically, many Polish policemen who actively assisted the Germans in hunting Jews were also part of the underground resistance against the occupation in other arenas. Individual Poles also often helped in the identification, denunciation, and exposure of Jews in hiding, sometimes motivated by greed and the opportunities presented by blackmail and the plunder of Jewish-owned property.\n\nIn November 1940, an individual who signed his note Ewald Reiman blackmailed a family he believed was Jewish. “Ladies and Gentlemen,” he wrote in a letter, “On the basis of accurate investigation, we have determined the truth about your Semitic origins. In view of the above, we request that you deliver to the bearer of this note the sum of 2,000 zlotys (two thousand zlotys) in a sealed envelope. … In return, we will destroy the incriminating evidence that is in our possession. Otherwise, we will immediately hand over the evidence to the German authorities.” Such blackmailers made life miserable for Jews who had false identification documents enabling them to hide in plain sight and evade German orders to move into ghettos. “[The plague of extortion] developed into a public evil endangering every Jew on the Aryan side,” wrote the Warsaw Jewish historian Emanuel Ringelblum in 1944. “The extortionists stripped their victims of their every last possession and forced them to flee for their lives.”\n\nCases of anti-Semitic action were not limited to abetting the German occupation authorities. There are well-documented incidents, particularly in the small towns of eastern Poland, where locals—acutely aware of the Nazis’ presence and emboldened by their anti-Semitic policies—carried out violent riots and murdered their Jewish neighbors. Perhaps the most infamous of these episodes was a massacre in the town of Jedwabne in summer 1941 when several hundred Jews were burned alive by their neighbors. More difficult to unpack is the tangled history of the southeastern village of Gniewczyna Łańcucka. In May 1942, non-Jewish residents of the town held hostage some two to three dozen local Jews. Over the course of several days, they tortured and raped their hostages before finally murdering them.", "score": 1, "send_replies": true, "subreddit": "politics", "date_year_month": "2018-12", "created_utc_converted": "2018-12-18 03:22:17", "score_overall": 10, "words": "holocaust jewish jewish greed jewish jewish jew jewish jewish jewish", "shared_words": "holocaust jewish greed jew", "socre_distint": 4}
{"archived": false, "author": "casualphilosopher1", "body": "Text:\n\nBenjamin Netanyahu is holding talks with Hungarian leaders on the character of the soon-to-open Hungarian Holocaust (denial) museum. The prime minister of Israel is giving his blessing – once again – to the design of a nationalist narrative that makes a substantive alteration of the story of the Holocaust in general, and the story of the annihilation of Hungarian Jewry specifically.\n\nAgainst this background, it is worth trying to gain a better understanding of the motives driving the protagonists. Every few years there arises a new generation of similar leaders, local and global, who reflect and echo one another. Joseph Stalin and Adolph Hitler; Winston Churchill and Franklin Roosevelt; Bill Clinton, Tony Blair and Yitzhak Rabin; Margaret Thatcher, Ronald Reagan and Menachem Begin.\n\n&gt;&gt;Will Israel abet Hungary’s whitewash museum? | Opinion \n\nIn our generation, these are the leaders of paranoia and phobia: Donald Trump, Benjamin Netanyahu, Recep Tayyip Erdogan, Viktor Orban and Vladimir Putin. There is no conspiracy theory that is alien to them. As far as they are concerned, no external threat, imaginary or harebrained as it may be, does not grow to become a powerful bitter enemy, one that compels the emergency mobilization of forces needed to save the nation. And who, if not they, can be the savior from the demon they have just now created?\n\nIn the U.S., they talk about “white supremacy,” in Hungary about “Hungary for Hungarians” and in Israel about “the Jewish state.” It is a global phenomenon that crosses all boundaries, ethnic, racial or religious, gathering into a tribal ghetto that is smaller than the modern state, which is diverse and inclusive of all its citizens. Their fierce antagonism to the foundations of democracy, and the attempt to do detriment to as many accomplishments and benefits of the open society as possible are evidence of inherent weaknesses and real existential fears. Each of them is building a separation wall and is interested in isolating his people and his race from the rest of the world. The highest wall of all encompasses the new Jewish ghetto that has been established in the Land of Israel.\n\nNetanyahu, Erdogan, Trump and Orban have joined forces against a formidable and strong common enemy who is not at all afraid of them and who fights back using tools against which they are incapable of defending themselves. The unholy coalition of several Christian leaders and one Muslim leader, who are clearly tainted by anti-Semitism, together with a Jew, a prime minister of Israel who is steeped in auto-anti-Semitism, has taken a united stand against another Jew – George Soros – and declared all-out war on him.\n\nWhat is it about Soros that is so threatening to them? What is it that generates hope among so many people around the world who refuse to accept the yoke of this generation’s leaders? What are they afraid of?\n\nThe state most familiar to us, the nation-state, is a relatively new conception, only a few centuries old. A sociopolitical consensus that succeeded in fostering a delicate equilibrium of rule and government that balances several constituent elements: territory, language, culture, heritage and at times also a shared religion.\n\nThe nation-state had a good run, up until two immense forces began the process of weathering and erosion of the state that had grown fatigued. From below it is being eaten away by sub-state forces and organizations. For example, the civil society and the division of the general corpus into sub-sections of discontented sub-identities (genders, skin colors, religious belongings, sexual preferences). And from above, globalization is gobbling up increasingly more authorities and powers that were once the sole province of the nation-state (tax shelters, worker mobility, shipping of goods and transfer of knowledge, migration and mobility of means of manufacture, among others).\n\nThe aforementioned heads of state feel hunted, and are digging in behind their lines of defense, reducing to a minimum the democratic and civil arenas. “Illiberal democracy” is how Netanyahu’s anti-Semitic Hungarian friend described it. Anyone who is exactly like us is on our team, and anyone who is different is an adversary and an enemy.\n\nIn order to reinforce and isolate the Jewish ghetto in Israel, Netanyahu is prepared to concede everything, including the memory and the lessons of the Holocaust, and will join forces with present-day adherents of the racial doctrine. Words cannot describe the abject shame of it all: An Israeli prime minister associates himself with some of the worst Holocaust deniers of our generation in Poland, Hungary, Turkey and the U.S., and became the leader who places the international seal of approval on the global coalition of ghetto builders. At the cost of declaring open season on Soros the Jew – the “Jewboy” as his opponents would label him – while engaging in total abandonment of the world of values and concepts of historic Judaism, its magnificent conception and its greatest sons and daughters.\n\nTrue, they have governments and power, armies and efficient mechanisms for the spread of darkness. But nothing can stop the world that has no borders. In part because the coalition standing before them is a coalition of openness, of which Soros is the primary global mainstay. His vision, of an open and equal society and state, is threatening to the conservatives seeking to maintain their freedom to be different, privileged and the keepers of all manner of discrimination. Each of them may possess a solution to his own problems – maybe – but has an utter lack of interest in the fate of the rest of humanity. They are like the man in the boat in the Jewish parable, who is drilling a hole in the floor beneath him. “What are you doing?” shout his friends. “What concern is it of yours?” he counters. “Am I not drilling under my own spot?”\n\nThe partners in the coalition of walls and phobias – Jews and Jew-haters who have joined forces – are drilling so many holes in the floor of the human ship that they are threatening to sink it. Soros, conversely, is attempting to plug holes and save the human commonality for the benefit of us all.\n\nHe has girded his loins for a war, and has become the greatest of all global builders of the dream of an open human society. He is a worthy and powerful opponent to all of the aforementioned bullies of nationalism. No longer fragments of organizations and abstract utopian ideas, but a courageous individual harboring concrete ideas for a more enlightened world, with capabilities, commitment and resoluteness.\n\nAnd the battle is being waged. At this juncture, they are the attackers and he the attacked. But at some point in the near future, freedom, as it always does, will win out. Openness will envelop and include even those who seek to deny it. And Soros himself will be the revered alternate symbol to the contemporary world and its miseries.", "score": 3, "send_replies": true, "subreddit": "Israel", "date_year_month": "2018-12", "created_utc_converted": "2018-12-18 16:55:48", "score_overall": 13, "words": "holocaust holocaust conspiracy jewish jewish jew jew jewish holocaust holocaust jew jewish jew", "shared_words": "holocaust conspiracy jewish jew", "socre_distint": 4}
{"archived": false, "author": "MarquisDePaid", "body": "Ok a caste system (racial hierarchy) is incomparable to some degree of exclusiveness. And exclusiveness should be a right in the same way that free expression is a right. \n\nAt some level, there should in fact be an ability of a distinct Anglo culture relative to Irish, just like Irish can be distinct from Anglo. That doesn't mean one should discriminate against the other, or that one can't make exceptions to the rule, but different groups have the right to determine their own narratives.\n\n(**edit:** I'll add here that I am of partial Irish descent myself)\n\nIf not, then I ask this question.\n\n[What about this ethnic narrative?](http://archive.is/xiSjb)\n\n&gt;Every time I read about a Jew somewhere identifying as a white person, I cringe. As an Israeli Jew, who like most other Israeli Jews, is completely foreign to the concept of Jews being “white” I would like to address this article to my Jewish brothers and sisters in America...\n\n&gt;The “white people world” is represented by  its European (often colonial) history, it’s culture, heroes, it’s Kings, ethos, faith etc. – and Ashkenazi Jews are not part of that world. Their heroes are the Maccabees and not the Vikings or Joan of Arc, their Kings are David King of Israel and Hezekiah King of Judah (both archeologically confirmed historical figures) and not Kings Edward and George.\n\n&gt;...Lastly, Ashkenazi Jews, whether the world likes it or not (and apparently it does not), are direct descendants of the Tribes of Israel, as we know from history, culture, science and a little something I like to call reality. Those who wish to deny it for political or theological reasons, should try forming an alliance with holocaust deniers because the two are no different.\n\nBernie Sanders lived on a Kibbutz for a while in Israel. A Kibbutz is jewish only, IE \"goyim need not apply\".\n\nIs that acceptable for \"goyim\" to forcibly insert themselves into those groups?\n\nOr are there different rules for small \"protected classes\" and other \"unprotected classes\" (strikingly similar to Indian caste system you claim to oppose)", "score": 2, "send_replies": true, "subreddit": "WayOfTheBern", "date_year_month": "2018-12", "created_utc_converted": "2018-12-19 03:35:51", "score_overall": 7, "words": "jew jew jewish holocaust jewish goyim goyim", "shared_words": "jew jewish holocaust goyim", "socre_distint": 4}
{"archived": false, "author": "mlem64", "body": "The MAGA guys are lame, but they aren't the anti-Jew guys, for starters. DJT is pro-Israel and has a family full of Jewish people. The guys in the red hats who repeat all the stupid catch phrases might say some shit about muslims or Mexicans, but they are quick to point out that are pro-Israel and arent in to Holocaust theories.\n\nIt's the alt-right guys who are not in to Jews and offer the conspiracy side of the Holocaust. Those guys dont repeat the catch phrases and aren't huge fans of Trump or his pro-Israel stance or his posse of Jewish people. Those guys are not going around saying 'MAGA' or 'fake news'. In fact the MAGA guys abandoned the alt-right moniker after it took in an anti-jewish pro-white stance and the two subsets often clash. \n\nWhoever did this does not know the difference and assumed they were the same thing, much the way right wing guys assume all leftists are ANTIFA. \n\nThat's not necessarily \"evidence\" but you can sort of use your head to determine that this is a hoax to bring back the fleeting idea that Trump is emboldening racists and nazis and hate crimes are on the rise because of this. ", "score": 12, "send_replies": true, "subreddit": "HateCrimeHoaxes", "date_year_month": "2018-12", "created_utc_converted": "2018-12-19 17:42:36", "score_overall": 7, "words": "jew jewish holocaust conspiracy holocaust jewish jewish", "shared_words": "jew jewish holocaust conspiracy", "socre_distint": 4}
{"archived": false, "author": "Junkbunkfunk", "body": "&gt;First of all, although I disagree with lots of what you say, you at least are able to defend your point of view, unlike SJWs. So respect on that count.\n\nLikewise, it's refreshing to not be called a faggot over and over. Always appreciate what you put into this sub\n\n&gt;If Jews run the media, they are globalist SJW Jews who really hate Israel. \n\nWell Haim Saban owns lots of media and he's said before he's a single issue voter and that issue is Israel. Considering he's a top dem donor I'd say the democrat party makes sure this is the case, as many democrats support anti-speech measures concerning BDS and Israel. And even the media types critical of Israel would never question their right to exist and the need for a Jewish homeland. Remember even mainstream left sources backed Iraq along with most (all) Jewish congressmen of both parties. The leftist Jews who are ostensibly anti Israel will still go on birthright.\n\n&gt;Because a lot of producers and directors are Jews? Would you say that 'white men' hold immense power in politics, because most elected officials are white men?\n\nHollywood as an industry was founded and built by Jewish immigrants. It's one of the crowning achievements of American Jews. If there's any industry there can be no doubt about Jewish domination, it's film. It's interesting you bring up the idea of white male domination. First off, would it be disproportionate to their population, and second would Jews be thrown in the white category? I think it was WaPo that showed how various industries are dominated by whites, not realizing that of the 19/20 whites named as leaders of hollywood, 15 were Jewish.\n\n&gt;Hell, have you seen Christopher Hitchens annihilate the pro-mutilation crowd? It's glorious.\n\nI'd bet it is. There's a rumor that he was a holocaust revisionist too, drunkenly revealed at a dinner party. The point about Clopper wasn't over the merits of circumcision, it was the consequences of even speaking about it and making the Jewish connection considering the ritual first appeared with Judaism.\n\n If you want more evidence of the academic stranglehold that suppresses open discourse I would suggest looking into Norman Finkelstein. He wrote his thesis debunking some ludicrous book claiming Palestinian Arabs aren't native to Palestine and he's been dogged with slander and blacklisting ever since. Though I will note that it was Noam Chomsky who championed Finkelsteins critique and notified British literary reviewers of the inaccurate aspects of the book\n\n&gt;That's true. And then what?\n\nJust being allowed to make basic observations without having your life ruined or blackmailed into submission would be a great start. If we talk about the intersection of industry and social justice it's worth mentioning a common denominator. After all, critical theory comes from the Frankfurt School. That's not a conspiracy, and those who deride it as such just create conditions for more determined radicals", "score": 1, "send_replies": true, "subreddit": "KotakuInAction", "date_year_month": "2018-12", "created_utc_converted": "2018-12-20 23:59:51", "score_overall": 9, "words": "globalist jewish jewish jewish jewish jewish holocaust jewish conspiracy", "shared_words": "globalist jewish holocaust conspiracy", "socre_distint": 4}
{"archived": false, "author": "bh2005", "body": "I really liked it, and agree with your points. I would like to share my own perspectives however, as I feel yours complement my own... thank you.\n\n----\n\n&gt; You are Jewish enough for Hitler to kill \n\nDamn... If this isn't pugnacious (in a good way), I don't know what is. I'm openly Jewish, and have always struggled with an appropriate response to Jews I meet who say they're bad Jews for not being \"like me\".\n\nBut leading into the point you make when you say \n\n&gt; “I am a Jew because…”\n\n&gt; Because I am an Other. It’s ironic to let Hitler determine who’s Jewish, but it’s what I’ve always done. I am a Jew because everyone around me is not, and I’ll never fit in. They are normal, and I am… Other. I’ll never be beautiful. I’ll never be safe. I’ll always be blamed, mistrusted, hated, misunderstood.\n\nThis was pugnacious, but not in a good way. Judaism isn't defined by the antisemitism we face, the hatred we suffer, and the atrocities we're sought to be eliminated in. Those things are facts of the life of a Jew the same way the sky being blue is a fact, yet it's not what defines us. Judaism is defined by values, which include always improving despite the trials and tribulations we face. It's called self sacrifice, this is what a Jew does. \n\n&gt; So many Jews are worried that our culture will evaporate if we intermarry. My mom received a very hard time about intermarriage. Her father wouldn’t even meet my dad, for so many years, until my parents finally eloped, and my grandpa got on board so he could know his grandchildren someday.\n\n&gt; Now I’ve gone and intermarried too (something none of my Jewish cousins have done, by the way).\n\n&gt; And I am raising my kid as culturally Jewish, 25%-be-damned.\n\nWhat is a person called when their actions speak differently from their words and beliefs? I'm not trying to shame or ostracize intermarried Jewish families. I recognize certain levels of religiosity isn't for everyone. I recognize they exist and for many are Jewish (like you and your daughter) and/or identify as Jewish, but there really is no continuity of faith and Jewish culture in this choice of lifestyle. If it's not now, it could be your grandchildren, or great grandchildren. How can you raise your child culturally Jewish, yet model a life that is the antithesis of the most basic Jewish value? You can't... well, you *can*, but devoid of nothing short of a miracle, you can't without limited success. You want to talk about antisemitism and how it's a fact of history that Jews have been hated for over 3000 years by cultures and societies that have come and gone, but at the same time distance yourself practically speaking from that Judaism that has persisted and exists as it always has for so long against the odds and cultures that saught to destroy us? ...What is that, if not hypocrisy? It's certainly not aligned with the definition of Judaism.\n\n\n\n&gt; Here’s something I jotted down last year, when the tiki-torch-toting white supremacists showed themselves in Charlottesville:\n\n&gt;&gt; *Escalation of civil war seems almost inevitable right now, so I am having these fucked up thoughts like, “To be safe, do I need to hide that Tzivia and I are Jewish (change her name)? Will we need to take our BLM sticker off our car?” Western Washington is safe though, would be far from the frontlines. I think when I daydream about Cascadia, it’s because I just want to believe I’m safe; want to believe that, now that I’m in the PNW, the South can’t get me.*\n\n&gt; ...The day before the Tree of Life synagogue shooting, I saw a conversation in a yoga Facebook group where someone called someone else out on being anti-Semitic. The offender said it wasn’t anti-Semitic, and a white ally commented that people of color could say for themselves what was/wasn’t racist. The offender replied that, Whatever, Jewish people aren’t people of color. It’s just a religion.\n\n&gt; Am I a person of color?\n\n&gt; My brother and I were the only Jewish kids in our elementary school. From the time I was aware of race, it was made clear to me by others that I was Other. That there was a White Default and I was not it.\n\n\n\n\nIn parallel with Judaism being defined by our values, we need to stand against the injustices that all and any face. This however is of course hard to do when we're oft the targets ourselves, and oft by those same people who we would otherwise stand up for. \n\n(I was going to write a piece here about my beliefs surrounding the second amendment in America and the duty Jews have from a Judaic moral standpoint to utilize it to defend themselves and their communities (and along side others as opposed to against others) rather than live in fear by battening down the hatches, but feel that would get me more downvotes than I already deserve; so I won't.)\n\nEven still, Jews are idealists and optimists by nature. This is a good thing, a wonderful thing, but not when that is applied to our identities as a basis for \"enlightenment\" of our culture in futile attempts to fit in and not be seen as \"the others\". We don't stand for the downtrodden by lowering ourselves to them, by trying to fit in. We stand to be able to raise them up. Compromising who and what we are isn't how we do this. We be all we can be, to help them be all they can be. \n\n&gt; ...while everyone else sang their hearts out with the Christian privilege they didn’t even know they had.\n\nThis struck a cord with me. Maybe I'm trying to convince myself, but I feel like this statement alone explains how and why we're \"the other\", as well as why that's ok and not a bad thing.\n\n&gt; I don’t talk or write about any of this much, because I know I have so much privilege. I know that other minorities have it so much worse. While I understand that privilege and racism aren’t all-or-nothing, I sometimes feel shame when I talk about myself as a victim, because while Jews deal with plenty of micro-aggressions and conspiracy theory-based anger, we are free of some of the worst systemic racism that affects other people of color.\n\n&gt; Sometimes it’s hard to be an ally when you’re fearing for your own safety, but I’m committed to keep doing it. We’re in this together.\n\nOk... I'll say it here even though I said I wouldn't. \n\n\n\n**\"If I am not for myself, who will be for me? And if I am only for myself, what am I? And if not now, when?**--Pirkei Avot\n\n\n\nI've been advocating for Jews as a community to take responsibility for their own and community safety for a long time as I don't think we can reasonably rely on anyone else to do that job, but many Jews don't feel the same way and expect the government and society to be able to or obligated to protect... history says otherwise, and as you said and history concurs, we're the “Other”. \n\n**\"If I am not for myself, who will be for me?\"**\n\n\nIn America we're blessed with two inalienable freedoms, religion and the right to protect that with arms. If only we had that right and ability during and before the holocaust, how would it have been different? How many more Others or “undesirables”, as the Nazis called anyone not of Ayrian persuasion, would have been saved had Jews been all we could be, had we been proud of what we are, and had we done all we could do; had we fought?\n\n**\"And if I am only for myself, what am I?\"**\n\n\nKristallnacht is often cited as the night the holocaust began. While there were previous warning signs before, it always formally starts with the Jews. What kind of statement would it have made if the Jews defended themselves then, and how would it have impacted the rest of the war? What if we recognized the warning signs even before, had we recognized the injustices that happened against others, and fought as Jews? Not only would we have saved ourselves, but we would have saved others… \n\n\n\n**\"And if not now, when?\"**\n\n\n\nRav Hillel's words convey more than a feel-good message, and are more than just a call to arms and action. It is a warning. The answer is *now and always!* And while I often carry my firearm, a tool for the times we live--the **now**, concealed. I **always** carry my Jewishness openly all because I am not only for myself, but *Others* as well, and it is this that has allowed for Judaism to not only survive, but thrive!\n\nIt is not our right, it is our obligation!\n\n\n\n(Edit: words and formatting)\n\n\n\n\n\n", "score": 3, "send_replies": true, "subreddit": "Judaism", "date_year_month": "2018-12", "created_utc_converted": "2018-12-21 04:06:46", "score_overall": 21, "words": "jewish jewish jew jewish jew jew jew jewish jewish jewish jewish jewish jewish jewish jewish jewish jewish jewish conspiracy holocaust holocaust", "shared_words": "jewish jew conspiracy holocaust", "socre_distint": 4}
{"archived": false, "author": "melechshelyat", "body": "Some [background](https://www.newyorker.com/news/letter-from-the-uk/jeremy-corbyns-anti-semitism-crisis).\n\nSome [additional information](https://en.wikipedia.org/wiki/Antisemitism_in_the_UK_Labour_Party).\n\nA shortlist of examples:\n\n* Called Hamas and Hezbollah friends in a speech in Parliament.\n\n* Spoke at rallies for Stop the War, where many antisemitic banners were flown, though he claims he saw none (we can question this one, fine).\n\n* Attended events for \"Deir Yassin Remembered\", a group founded by a Holocaust denier. Claimed he \"didn't know\" that the guy was a Holocaust denier at the time. The group was riddled with Holocaust deniers, he was part of it for 10 years, and Corbyn went to an event in 2013 despite the head of the group making clear his Holocaust denial since 2005.\n\n* Stephen Sizer was a vicar who linked to an antisemitic and Holocaust denial website. Corbyn said that those criticizing him were taking advantage of a \"technical oversight\" because they didn't like Sizer's politics. Sizer proceeded in the next few years to attend 9/11 truther conferences in Iran blaming 9/11 on Israel, and espousing further Holocaust denial.\n\n* Raed Salah is head of a banned movement in Israel. He claimed Jews steal Christian children's blood for matzoh in 2007 (an old antisemitic myth). He was convicted of inciting violence and racism for that speech in Israel. He blamed 9/11 on Jews in October 2011. In April 2012, a British court found that he had used the antisemitic blood libel, but that it wasn't enough for criminal charges. They also found that he had encouraged violence. In June 2012, Corbyn invited Salah to Parliament, invited him to \"tea on the terrace\", and called him an \"honored citizen\".\n\n* Corbyn, his office staff, and some MPs were found to be members of a private Facebook group where many antisemitic posts were made. He claimed he had no knowledge of what was said in the group. He left after becoming leader of Labour. He made a few posts in the group during the &amp;lt;1 year he was in it. He was also part of 2 other groups that also contained antisemitic posts, though they were less common. He claimed he had no idea he was added either.\n\n* In 2012, a painter put up a street mural that depicted antisemitic themes involving a Rothschild, Rockefeller, etc. cabal running the world. The painter denied it was antisemitic because he included whites, not just Jews, running the world. The mural was deemed antisemitic and slated for destruction. Corbyn said it should be left up and then he claimed afterwards that he \"didn't realize\" it was accused of being antisemitic.\n\n* He attended a Passover celebration with a radical Jewish group called \"Jewdas\", which claims that any attempt to accuse Corbyn of antisemitism is just a political ploy and claims Israel should be destroyed.\n\n* A Palestinian Authority spokesperson at an event in 2013 made some vaguely antisemitic statements about Jews wanting to build a messianic vision of Israel and how they think they're the only children of God. Some pro-Israel activists then got up and argued with him at the event. A few days later, Corbyn claimed that those \"Zionists\" don't \"want to study history, and secondly, having lived in this country for a very long time, probably all their lives, they don't understand English irony either\". Many pointed out that accusing Jews of not understanding English culture despite living there all their lives is the type of antisemitic canard Jews have heard for centuries, including prominent Holocaust scholars. He claims it was all out of context and he only has a problem with \"Zionists\", not all Jews. More than 90% of Jews worldwide are Zionists. Other speakers at the conference where he made this comment included Sizer (the 9/11 truther I mentioned before). The conference was promoted by the military wing of Hamas.\n\n* He held an event where a controversial Holocaust denier compared Israel to the Nazis on Holocaust Memorial Day, in Parliament in 2010.\n\n* He received up to $27,000 to appear on Iran's state TV in the past, which obviously hosts a ton of antisemitism. He refused to say if he regrets going on it. He claims BBC has a \"bias\" towards saying Israel \"has a right to exist\", and that it's all because Israel is pressuring the BBC. Sounds a lot like \"Jews are influencing our media\" to many listeners.\n\n* Also on Iranian TV, he implied Israel was responsible for an jihadist attack on an Egyptian army base in 2012 because \"in whose interests\" other than Israel's would it be to cause the violence, he claimed. This is a conspiracy theory with no merit. He proceeded to say, \"I suspect the hand of Israel in this whole process of destabilization\".\n\n* In the midst of the latest flareup revealing a lot of this information, which has dripped out over the past three years, he wrote an op-ed for *The Guardian* about how he opposed antisemitism. He asked two leading Jewish groups if it would be disrespectful to release it on the evening of the Sabbath, when religiously observant Jews would be unable to read/respond to it until over a day later. They told him it would be an act of \"tremendous bad faith\". He ignored them and published it at 5:30 on Friday anyways, right around when Sabbath starts.\n\nI haven't even spoken about the debate over antisemitism, or about the institutional antisemitism that has flourished in the party under his leadership. I've only spoken to the people he directly associates with, and what he's said/done. This is the tip of the iceberg.\n\nAs Bret Stephens put it (and Stephens has plenty of issues of his own), [the excuses Corbyn gives](https://www.nytimes.com/2018/03/29/opinion/jeremy-corbyn-anti-semite.html) are that somehow he just manages to stumble into every antisemitic controversy and meet every antisemite, but it's never intentional. It stretches the imagination.\n\nDownvote away, antisemites. The fact that everyone is responding to Corbyn’s defense of Holocaust deniers and people echoing the medieval blood libel about Jews with “BUT ISRAEL” is only proving my point. Praising blood libelers is not criticizing Israel. You can criticize Israel without being antisemitic. Corbyn just regularly defends Holocaust deniers and people who openly claim Jews kidnap Christian kids for their blood.\n\nDownvote away!", "score": -4, "send_replies": true, "subreddit": "worldnews", "date_year_month": "2018-12", "created_utc_converted": "2018-12-21 07:28:08", "score_overall": 16, "words": "holocaust holocaust holocaust holocaust holocaust holocaust libel jewish holocaust holocaust holocaust conspiracy jewish holocaust libel holocaust", "shared_words": "holocaust libel jewish conspiracy", "socre_distint": 4}
{"archived": false, "author": "HysniKapo", "body": "Yeah my post wasn't meant to say \"masses of people suddenly became anti-Semites a few years ago,\" it was exactly like you put it: \"these people were less willing to share their thoughts.\"\n\nLike I recall occasional references in private messages on forums or instant messages on AIM about \"I'm worried about becoming a Jew\" (in terms of a financial transaction), or getting \"Jewed,\" etc., but as a non-Jew who has been on the Internet since 2001 I can't recall seeing blatant \"Jews run the world,\" \"Jews want to promote immigration so they can take over America,\" and Holocaust denial unless I specifically looked for it.\n\nGranted I didn't need to look _far_ to find it, but it was seemingly contained in spaces like Stormfront or specific YT videos that were titled something like \"THE TRUTH ABOUT KHAZARS 9/11 IRAQ COMMUNISM NWO ILLUMINATI\" and had 500 views.\n\nNowadays I could watch any ol' moderately popular YT channel on stuff like gaming, old PCs, medieval history, or whatever, and multiple comments are far-rightists with \"funny\" usernames like Shlomo Shbergbenstein being like \"oy vey you mentioned a white person, we can't have this\" in response to like... videos discussing the year 1066 AD in England or the history of Apple. Or just ranting about how the Jews ruined EA or something.", "score": 3, "send_replies": true, "subreddit": "TopMindsOfReddit", "date_year_month": "2018-12", "created_utc_converted": "2018-12-21 14:11:26", "score_overall": 5, "words": "jew jew holocaust khazars illuminati", "shared_words": "jew holocaust khazars illuminati", "socre_distint": 4}
{"archived": false, "author": "AntonioOfVenice", "body": "&gt; Likewise, it's refreshing to not be called a faggot over and over. Always appreciate what you put into this sub\n\nThank you.\n\n&gt; Well Haim Saban owns lots of media and he's said before he's a single issue voter and that issue is Israel. Considering he's a top dem donor I'd say the democrat party makes sure this is the case, as many democrats support anti-speech measures concerning BDS and Israel. \n\nIs he doing a terrific job of it? It seems to me that he is losing the Democratic Party. From Keith Ellison being the vice-chair of the DNC, to the increased stridency of their anti-Israel nonsense. He's pretty dumb to support the Democrats, if his concern truly is Israel. And I can't see many mainstream media outlets that he owns, mostly entertainment, not?\n\n&gt; And even the media types critical of Israel would never question their right to exist and the need for a Jewish homeland. Remember even mainstream left sources backed Iraq along with most (all) Jewish congressmen of both parties. The leftist Jews who are ostensibly anti Israel will still go on birthright.\n\nIronically, Ariel Sharon warned Bush against going into Iraq. Not sure how the myth of 'war for Israel' spread. And I'm pretty sure that Bernie Sanders is a Jew - he opposed the war. \n\n&gt; Hollywood as an industry was founded and built by Jewish immigrants. It's one of the crowning achievements of American Jews. If there's any industry there can be no doubt about Jewish domination, it's film. It's interesting you bring up the idea of white male domination. First off, would it be disproportionate to their population, and second would Jews be thrown in the white category? I think it was WaPo that showed how various industries are dominated by whites, not realizing that of the 19/20 whites named as leaders of hollywood, 15 were Jewish.\n\nI take issue with the whole thing of 'ethnic domination'. White men make up, what is it, 30% of the population? Yet they 'control' or 'dominate' certain positions in a way that is disproportionate to the 30% of the population. I would argue that this doesn't matter, as they do not act with group interests in mind. That applies to white men and the Jews in Hollywood. There are many criticisms to be made of Hollywood, but \"supporting Jewish group interests\" is not one of them.\n\n&gt; I'd bet it is. There's a rumor that he was a holocaust revisionist too, drunkenly revealed at a dinner party.\n\nI doubt it, he was very strongly anti-anti-Semitic. When he was at a restaurant where he had been told that Jews were not welcome, he asked if he could be served kosher. But of course, he wouldn't stand for nonsense coming from anyone.\n\n&gt; The point about Clopper wasn't over the merits of circumcision, it was the consequences of even speaking about it and making the Jewish connection considering the ritual first appeared with Judaism.\n\nActually, the Jews got it from the Egyptians. Really something to be proud of. \n\n&gt; If you want more evidence of the academic stranglehold that suppresses open discourse I would suggest looking into Norman Finkelstein. He wrote his thesis debunking some ludicrous book claiming Palestinian Arabs aren't native to Palestine and he's been dogged with slander and blacklisting ever since. Though I will note that it was Noam Chomsky who championed Finkelsteins critique and notified British literary reviewers of the inaccurate aspects of the book\n\nI am familiar with Norman Finkelstein. He's a bit of a nutter, going even further than a lot of anti-Israel Jews. However, I don't agree with shaming him because he is a Jew who happens to have that position. \n\nBut we need to decide if this is about Israel or not. Earlier, you said that being anti-Israel is not necessarily anti-Semitism. I agree. However, if Jewish influence is felt because of Finkelstein being attacked for criticizing a bit of an out there book, how is it that these Jews do nothing about mainstream media defending Hamas assaulting Israel's border, or labeling Ivanka Trump \"daddy's little ghoul\"? Or the other double standards that are held against Israel? \n\nJournalists may or may not be Jews. That seems to be a non-factor, since nothing they write is based on that. It's all based on them uniformly being SJWs.\n\n&gt; Just being allowed to make basic observations without having your life ruined or blackmailed into submission would be a great start. If we talk about the intersection of industry and social justice it's worth mentioning a common denominator.\n\nI really see no point to it. It's the truth, so no one should have his life ruined over it. I would also say that no one should have his life ruined for saying \"Jews are evil because many Jews are SJWs\". But that *would* be a wrong thing to say, and I see no productive avenue beyond this observation. \n\nIt's also counterproductive politically. Whether you like it or not, trying to make it about \"Jews\" will make you appear to be biased against Jews, and it will overshadow your point against SJWs, hurting the good fight. It also will alienate Jewish allies, who I think are ripe for the picking given SJWs' hatred for Israel which is now extending to Jews.", "score": 1, "send_replies": true, "subreddit": "KotakuInAction", "date_year_month": "2018-12", "created_utc_converted": "2018-12-21 16:34:06", "score_overall": 13, "words": "jewish jewish jew jewish jewish jewish jewish holocaust kosher jewish jew jewish jewish", "shared_words": "jewish jew holocaust kosher", "socre_distint": 4}
{"archived": false, "author": "melechshelyat", "body": "Let me summarize this rather crazy response.\n\n&gt;Many people are saying any criticism of Israel is anti-Semitic. Just look at how many Jewish groups and others will make hysterical statements on TV when Israel is criticised.\n\n“Look how hysterical Jews are, they clearly don’t dislike Corbyn”\n\n&gt;The points you listed are held by ignorant extremists. To pretend that Corbyn is part of that is a terrible slur to a man who has dedicated his political life to helping minority groups.\n\nCorbyn defended a 9/11 truther and Holocaust denier. That isn’t criticizing Israel.\n\nCorbyn praised a different Holocaust denier as an “honorable citizen”, despite that person claiming Jews kidnap Christian children for their blood for rituals, a fact found in British Court just one month before.\n\nCorbyn went to events for a group led by a prominent Holocaust denier (a third one). He claimed he didn’t know the man’s views because they weren’t public when he went. The man’s views were revealed in 2005. He attended events in 2013.\n\nCorbyn blamed Israel on Iranian State TV for a jihadist attack on the Egyptian Army.\n\nCorbyn laid a wreath at the graves for the plotters of the murder of 12 Israeli Olympians. He claimed the wreath wasn’t for them. Photos showed it was, and that he was with the head of the PFLP, a recognized terrorist group in the U.K. rife with antisemitism. He claimed it was false and that he’d complain to get the story taken down. Then he withdrew the complaint, a tacit admission it was accurate.\n\nCorbyn said an antisemitic mural shouldn’t be taken down. Then when people pointed out its antisemitism, which was why it was being taken down as everyone had been saying, he claimed he didn’t know it was antisemitic at all.\n\n&gt; Why no similar outrage about the Conservative Party who has/had openly racist members and has recently gone into a coalition with an extreme right wing party? Why not every time the Tories are mentioned people don’t add racist to the end of it as they do with Corbyn and anti-Semitism?\n\n“Why won’t they focus on the other guys!”\n\nStop trying to deflect. It’s transparent.\n\n&gt;The reason is of course it’s just a shameful hatchet job on Corbyn where the Conservatives, who are prob about the worst government we have ever had, have conducted a very successful campaign to discredit him. This nonsense has spread around the world and is being repeated everywhere. \n\n“Look its all a conspiracy!”\n\nMultiple Jewish lawmakers in Corbyn’s party, Labour through and through, have left Labour, citing his antisemitism and tolerance for him.\n\nBlaming accusations of antisemitism on a conspiracy isn’t a good look.\n\n31% of Labour voters say antisemitism is a problem in the party, even if they plan to vote Labour because they have other priorities.\n\nThis isn’t some campaign to discredit him. No Conservative forced him to call a blood libel spreader an honorable citizen. No Conservative forced him to lay a wreath for the murderers of Israeli Olympians. No Conservative forced him to attend events run by Holocaust deniers. No Conservative forced him to defend Holocaust deniers. No Conservative forced him to say he wanted to leave up an antisemitic mural.\n\nThat’s all Corbyn.", "score": 11, "send_replies": true, "subreddit": "worldnews", "date_year_month": "2018-12", "created_utc_converted": "2018-12-21 20:34:35", "score_overall": 10, "words": "jewish holocaust holocaust holocaust conspiracy jewish conspiracy libel holocaust holocaust", "shared_words": "jewish holocaust conspiracy libel", "socre_distint": 4}
{"archived": false, "author": "Yeager_xxxiv", "body": "&gt; Meanwhile the idea that communism is “classist” is both wrong and right. No form of communism seeks to exterminate the Bourgeois wish to assimilate into proletarian labor and forgo their private capital giving to the workers, then there is no need for violence against them. It is when the capitulate class refuses to submit their capital to the proletariat and utilize violence to prevent their capital from being claimed by the working the working class that violence against them becomes justified.\n\nRobber: “I don’t want to kills ya but if ya don’t give me ya shit then ima kills ya!”\n\nThink before you vomit up what your sociology teacher told you in class ok m8.\n\n&gt; Except it’s not the “same basic sentiment” for instance view did not view the Jews as evil because they had control over German capital, they didn’t anyways. Rather he thought Judaism had prevented German victory in WW1 and in fact he saw communism as an inherently Jewish ideology, doing Judeo-Bolshevism. Hitler did not hate Jews because they were in control of German capital, he anti-semitism was not motivated by that.\n\nLook back to the time, a ton of hatred came from the fact that Jewish people were so well of on average compared to the average German non-Jew. Even today antisemites spout the “Globalist Jew banker” shit because of how well off Jewish people with European ancestry are perceived to be. Also i’m just gonna end out on this quote from Marx.\n\n&gt; What is the worldly religion of the Jew? Huckstering. What is his worldly God? Money.…. Money is the jealous god of Israel, in face of which no other god may exist. Money degrades all the gods of man – and turns them into commodities…. The bill of exchange is the real god of the Jew. His god is only an illusory bill of exchange…. The chimerical nationality of the Jew is the nationality of the merchant, of the man of money in general.", "score": 5, "send_replies": true, "subreddit": "HistoryMemes", "date_year_month": "2018-12", "created_utc_converted": "2018-12-21 23:57:34", "score_overall": 10, "words": "jewish jewish jew globalist jew jewish jew jew jew merchant", "shared_words": "jewish jew globalist merchant", "socre_distint": 4}
{"archived": false, "author": "MarquisDePaid", "body": "Yes, you can according to Jewish law, and [Atheism is not incompatible with \"being a Jew\" because the identity is based off of nationality](https://www.chabad.org/library/article_cdo/aid/3002/jewish/Why-Is-Conversion-to-Judaism-So-Hard.htm): \n\n&gt;Why Is Conversion to Judaism So Hard?\n\n&gt;Is Judaism a religion? Is that the right word?\n\n&gt;Religions generally start when one teacher spreads his teachings to many disciples. The people who accept these teachings are considered coreligionists. Their common beliefs hold them together as a community.\n\n&gt;The Jewish people, then, are best described as the “People of the Covenant”—meaning that they are a people because of a covenant. What is special about this covenant is that it is not a covenant between two individuals, or even between an individual and G‑d (as Abraham had made), but a covenant between an entire nation and G‑d.\n\n&gt;The covenant, as I wrote, is what defines us as a nation—not geographic vicinity, language, government or culture. Even if we live in different countries, speak different languages, establish different leaders and eat different foods, that covenant still bonds us.\n\n&gt;Most significantly: even if we stop keeping our obligations under that covenant or decide not to believe in it, the covenant endures. A covenant, you see, is a two-way deal. It takes two to make it and two to break it. Just because the people have let go, doesn’t mean G‑d has. That’s why it’s called an “eternal covenant”—because even if the people may be fickle, G‑d doesn’t change His mind.\n\n&gt;So there’s the difference: In a religion, you belong because you believe. In a brit (in this case, Judaism), you believe because you belong.\n\n\nThe \"Jewish identity\" is mostly based in remembering hardships [like the Holocaust](http://www.pewresearch.org/fact-tank/2016/03/16/a-closer-look-at-jewish-identity-in-israel-and-the-u-s/), which significantly outranks everything else in surveys: \n\n&gt;Both surveys asked Jews about a list of eight possible behaviors and attributes that could potentially be “essential” or “important” to their personal Jewish identity. In both countries, majorities say remembering the Holocaust is essential to their Jewish identities (73% in U.S., 65% in Israel).\n\n\nThe best example I can think of this is this [\"secular Jew\"](http://www.timesofisrael.com/in-haunted-salem-a-jewish-church-founder-preaches-the-art-of-satanic-social-change/):\n\n&gt;In haunted Salem, a Jewish church founder preaches the art of ‘Satanic’ social change\nAt a former funeral home in a town inextricably linked to witchcraft, secular Jew Malcolm Jarry opens a new heaquarters for his Satanic Temple, a controversial movement with up to 50,000 members worldwide\n\nYou will not find a Muslim (or a Christian for that matter) arguing this: \n\n&gt;For the 49-year-old Jarry, there is not much conflict between being Jewish and a Satanist. As a matter of fact, the two identities have come to inform each other, he said.\n\n&gt;“I see it like Buddhism,” said Jarry. “Satanism is something that can co-exist with being a Jew,” he said.\n\n&gt;In addition to Jarry’s belief that Judaism and Satanism can co-exist, there are parallels with how Judaism and Satanism have been branded by their detractors, he said.\n\n&gt;“The false accusations that have been thrown at Jews historically are similar to what some people say about Satanism,” said Jarry, mentioning accusations of blood libel and — more recently — fabricated allegations that Israel perpetrates genocide against Palestinian children.\n\n&gt;“I do not accept when people delegitimize Israel or use lies to marginalize Israel,” said Jarry. “I am an unwavering supporter of Israel, so long as it remains democratic, pluralistic, and protects human rights.”", "score": 2, "send_replies": true, "subreddit": "islam", "date_year_month": "2018-12", "created_utc_converted": "2018-12-22 17:06:54", "score_overall": 17, "words": "jewish jew jewish jewish jewish holocaust jewish jewish holocaust jewish jew jewish jewish jew jewish jew libel", "shared_words": "jewish jew holocaust libel", "socre_distint": 4}
{"archived": false, "author": "MasterTeleporter", "body": "&gt;\"globalist Jew conspiracy theories\"  \n&gt;  \n&gt;by sliding in some dicks into movies?\n\nIf you've ever noticed it's all the Jew comedy movies that contain dick and shit humor like the ones from the Judd Apatow/Seth Rogen crew.  Go watch the movie Funny People with Adam Sandler and Seth Rogen, two and a half hours of dick jokes.  Sausage Party?  Seth Rogen.\n\nWill Ferrell never really makes dick jokes in his movies but then again he's not Jewish and neither is his director Adam McKay.", "score": -7, "send_replies": true, "subreddit": "JoeRogan", "date_year_month": "2018-12", "created_utc_converted": "2018-12-22 22:58:06", "score_overall": 5, "words": "globalist jew conspiracy jew jewish", "shared_words": "globalist jew conspiracy jewish", "socre_distint": 4}
{"archived": false, "author": "[deleted]", "body": "I would argue that most religions came about by honest means, whether drug-or-trance-induced hallucinations, or the transmogrification of a real individual into godhood by the gradual accretion of myth and a concurrent increase in the estimation of a particular community. Which is to say, I don’t think that Christianity, Judaism, Buddhism, Islam or any other major, mainstream religion was invented out of greed or power lust.\n\nI could see someone creating a religion in order to unify a population through a shared mythos, but if there were a conspiracy to invent a religion the perpetrators would leave more obvious evidence, such as early church fathers mentioning in letters or diaries activities related to said conspiracy. \n\nIt’s always possible, and in many cases probable that texts were tampered with. However, none of the ancient writers that mention Jesus ever assume he was a hoax, symbol or metaphor. He is always treated as a real individual. You would think that we would have some concrete evidence that Jesus were invented if it were the case, but there isn’t any. And why would a Christian invent a derogatory comment to insert into Josephus?\n\nIn Jesus’ time, there was a raging controversy over what it meant to be Jewish. There were conservatives who argued that a literal interpretation of the Torah and rigorous adherence to the laws it contained made someone a Jew. Progressives argued that a new interpretation of the Torah was needed, based on both a literal and metaphorical interpretation, and that part of being Jewish was understanding the mind of God and emulating his compassion. I’m not sure that anyone from a population that came to define itself by its descent from Abraham and it’s covenant with Yahweh would up and create a new religion based on an imaginary crucified criminal. They would be ostracized, at best.\n\nThe “family of the Lord” thing may be invented on my part, or half-remembered from a book about Paul. Maybe In Search Of Paul by John Dominic Crossan. ", "score": 2, "send_replies": true, "subreddit": "atheism", "date_year_month": "2018-12", "created_utc_converted": "2018-12-22 23:04:48", "score_overall": 6, "words": "greed conspiracy conspiracy jewish jew jewish", "shared_words": "greed conspiracy jewish jew", "socre_distint": 4}
{"archived": false, "author": "WOWSuchUsernameAmaze", "body": "Just want to point out that not everyone hates Jews for the same reason. \n\nIn the old school days, they were hated for having their own culture and not conforming:\n1. The name “Hebrews” comes from the Hebrew word “Ivri” which means “from the other side.” (It is referring to the fact that Abraham originated from “the other side of the Jordan river”, but basically used as a way to say they were different.)\n2. The story of Passover begins with a foreign nation (Jews) being too different and gaining too much power in Egypt\n3. The story of Hanukah is about Jews not wanting to take on Greek culture \n4. The story of Purim begins with Jews not wanting to bow down to a Persian ruler, and the queen keeping her heritage secret \n5. Crusades and the inquisition had people killing Jews because they wouldn’t convert\n6. Nazis uses Jews as a scapegoat because they were different \n\nYou know what’s not part of this history? Arab/Muslim and Jew/Israeli conflict. Jews and Muslims lived side by side peacefully for many years. The hatred between the two now comes down to disputes about Israel/Palestinians. \n\nThis also fuels some hate in the west today, just in time for diversity to become popular and the distaste of someone having their own culture falling away. \n\nOn top of all this, like others said, Jews were limited in the jobs they could provide, being forced to work jobs that both made them successful but also made them hated. A small, different, successful group with monetary power is not going to be liked. \n\nAnd one more thing - part of the reason Jews are successful today even with no job restrictions is because of a heavy cultural emphasis on education and achievement. Jews have been literate for much longer than the rest of the world, and have a deeply engrained emphasis on education. \n\nThis success leads to people making up conspiracy theories about Jews controlling everything. That’s obviously false, but there’s some truth to the success. Jewish doctors, accountants, lawyers, and Hollywood stars are stereotypes for a reason. Also for such a small group, there’s an abnormally large number of Nobel prizes, medical inventions, technology startups, etc. Not all Jews are successful obviously, but they do make a lot of waves for being such a small number of people. ", "score": 1, "send_replies": true, "subreddit": "Ask_Politics", "date_year_month": "2018-12", "created_utc_converted": "2018-12-23 14:55:15", "score_overall": 4, "words": "scapegoat jew conspiracy jewish", "shared_words": "scapegoat jew conspiracy jewish", "socre_distint": 4}
{"archived": false, "author": "kusuriurikun", "body": "&gt; *Maybe  during commercial break, show the video of the 24 year old Scandinavian  girl getting her head sawed off while calling out for her mother.*  \n&gt;  \n&gt;This has nothing remotely to do with the QAnon movement.\n\nSome of the New Apostolic Reformation followers among the Qultists actually tend to fold in the few sections of NAR Grand Unified Conspiracy Theory not yet formally incorporated into QAnon Grand Conspiracy Theory, including some virulently anti-LGBTQA and Islamophobic narratives that explicitly include Islam as part of the Grand Satanic Conspiracy that is ultimately controlled by a Satanist (and often very, very gay) cabal at the top.\n\n(Probably one of the more notable promoters of THIS particular branch of dominionist Grand Unified Conspiracy Theory is [Scott Lively, who promotes a frankly Holocaust-denialist narrative to the effect that a) the Illuminati exists and is a Satanic organisation, b) is secretly run by The Gays, and c) The Gay Illuminati has been responsible for the downfall of literally every major civilisation since Rome if not since the Bronze Age Collapse and actually invented both the Nazi Party AND Islam as part of their Nefariously Fabulous Plans For World Satanic Domination](https://rationalwiki.org/wiki/Scott_Lively).  He's written multiple books which could easily be mistakable for actual antisemitic agitprop (we're talking on the level of David Irving's outright claims the Holocaust never happened or was Greatly Exaggerated, or the *Protocols of the Learned Elders of Zion*) with the terms \"Jew\" and \"Race Traitor\" replaced with \"Homosexual\" and \"Homosexualist\" respectively, has taken direct credit for[both Uganda's attempts at gay genocide bills (which he essentially ghost-wrote)](http://www.upworthy.com/america-wouldnt-accept-his-views-so-he-exported-them-im-still-ashamed?c=hpstream) and Russia's virulently anti-LGBTQA repression (and [has actively worked with a Russian group](https://www.dailykos.com/story/2007/10/18/399689/--Joel-s-Army-in-Eastern-Europe-hatecrimes-and-their-American-supporters) that [has launched progroms against LGBTQA people](https://www.dailykos.com/story/2007/10/17/399218/--Joel-s-Army-in-Eastern-Europe-and-a-wave-of-anti-LGBT-hatecrimes)), occasionally dabbles in more traditional anti-Semitism (essentially claiming that anyone who is culturally but not religiously Jewish, is from a more mainline denomination of Judaism that is not virulently anti-LGBTQA, and/or is not \"Messanic Jewish\" (aka neopentecostalism that keeps kosher and celebrates High Holidays) is a \"Fake Jew\".)\n\nAnd outside of NAR Grand Unified Conspiracy Theory, you do see a fair amount of similar stuff from racist groups that are related (theologically or ideologically), particularly \"Christian Identity\" and even the KKK to the effect that Islam was created explicitly by the ringleaders of a mass Satanic Conspiracy (though usually in THOSE cases, rather than blaming The Gays, they blame Teh J00s).  Voat...well...*does* have quite a lot of Those Types on it (in fact, before QAnon stuff moved largely there the sort that believe the *Protocols of the Learned Elders of Zion* is actually real were the majority of the userbase on Voat), so probably some of THAT sort of racist Grand Unified Conspiracy Theory is bleeding over there.", "score": 7, "send_replies": true, "subreddit": "Qult_Headquarters", "date_year_month": "2018-12", "created_utc_converted": "2018-12-23 17:56:27", "score_overall": 16, "words": "conspiracy conspiracy conspiracy conspiracy holocaust illuminati illuminati holocaust jew jewish jewish kosher jew conspiracy conspiracy conspiracy", "shared_words": "conspiracy holocaust illuminati jew jewish kosher", "socre_distint": 6}
{"archived": false, "author": "erythro", "body": "&gt;It's in align with what Paul wrote. \n\nPaul wrote to judge the sin and evil within the Church but leave the sin outside to God.  How is that possibly consistent with what Luther wrote?\n\n&gt;The German government was Claiming to be Christian was it not?  \n\nSo why was it judging non-Christians?\n\n&gt;Why shouldn't it follow Paul's advice?  \n\nPaul \"advises\" Christians do not judge those outside the church, and for those in the church the most severe punishment is excommunication.  If only the medieval Christians obeyed him.\n\n&gt;Or maybe that's why Luther writes this way. To point out the government can't be both. \n\nSo what Luther is writing was so obviously wrong that that was his point?  Why not take him at his word?\n\n&gt;He Legitimately wanted them kicked out of the country, the corrupt ones  slain\n\nSo you do believe him now?  Why suggest he was joking, then?  Since we are finally on the same page about what Luther was saying: Luther has no right to call for this.  Only God can proclaim a national judgement like that.  Luther's job is to proclaim the gospel to those who will listen, and tend to his flock.  Calling for violent judgement on others is sin on his part - judgement is God's business, not Luther's.\n\n&gt;and their cultural footmark cut out like a cancer\n\nLet the mask slip there, eh?\n\nAgain to say, the church is not in the business of stamping out culture.  Indeed, that's why we can eat pork and not circumcise our sons while still being holy and pleasing to God - you don't have to assimilate into Jewish culture, and no way could you get it backwards enough to think that *the Jews* have to assimilate into a *gentile* culture.\n\n&gt;All these are his exact words.... And the words of the prophets from which he gets the writing style from. \n\nLuther wasn't a prophet, he was a Church Leader.  Paul is clear that if someone is outside the Church, they are to be left to judgement of God.\n\n&gt; Im saying that if he were alive today, instead of Jew he'd say Globalist.  \n\nI don't care what sort of thinly-veiled anti-semitic nonsense he'd say today if he was around.  I'm talking about the unveiled anti-semitic nonsense he wrote then, and the dangerous effect it has had on the world.\n\n&gt; I'm saying I agree with him. \n\nWell since we are talking about what *you* believe rather than just Luther, and since you were willing to let the mask slip earlier, let's ask a couple questions about what you think:\n\nHow do you feel about Hitler's genocide of the Jews and Bolsheviks during WW2?  If you are capable of saying you think it was wrong, could you explain in detail exactly what it was that you think Hitler got wrong in his thinking?\n\n&gt;Remove the cancer of arrogance and pride, greed and wrath from your culture. \n\nHa, I am.  I'm mostly embedded within a middle class conservative evangelical culture, and have little contact with other Jews.  If you are a mere man it is arrogant, proud, and sinfully wrathful to stand in judgement over an entire nationality, you should stop.", "score": 3, "send_replies": true, "subreddit": "Christianity", "date_year_month": "2018-12", "created_utc_converted": "2018-12-23 19:28:35", "score_overall": 4, "words": "jewish jew globalist greed", "shared_words": "jewish jew globalist greed", "socre_distint": 4}
{"archived": false, "author": "ChairmanBen", "body": "I have to believe that the dude was trolling, or at least I’d like to believe that. But he does seem remarkably “proficient” (as in knowing Nazi talking points and figures) in Nazism, considering  he knew who Richard Spencer was. I just blocked after a while of getting nowhere.\n\nBased on his thing about the media (which, I checked, many people on that graphic aren’t practicing Jews) he seems to have a hatred of the rich elite that he wrongly generalised towards an entire race of people. It’s a fact that the **wealthy** hold far too much power in the United States, and some of those wealthy—perhaps disproportionately (I doubt it)—happen to be Jewish. That doesn’t mean that Jews are inferior to others (hell, somebody on the other side could use that fact—stupidly, but more logically—to say that Jews are superior), it doesn’t mean that if Aryans were in their place they would be any more sympathetic towards the common man, and it doesn’t mean that every Jew is part of some vast global conspiracy to eradicate Aryans and suppress anti-Zionist information (indeed, many Jews **are** anti-Zionist, including myself—a supporter of Palestinian freedom). The rich having too much control is a problem, whether some happen to be Jews is irrelevant to me.\n\nThe ideology is disgusting, however. It does not follow that because some Jews hold power, a fascist dictatorship is the best form of government. Especially when dictatorships, like those in Germany and Italy, are known to crush the poor, to gas dissenters, and to be jingoistic and violent towards states that did not attack them. Not to mention the worst genocide in human history, the Holocaust, which still leaves scars to this day. \n\nThis fucker neads to read Elie Wiesel’s ***Night*** before trying to dismiss Nazi crimes against humanity. Also needs to pick up a history book and find that Nazi Germany was the one who declared war on countries surrounding it, illegally built up military force, illegally annexed a country and part of another country, and declared war on the United States, all while perpetrating genocide against their fellow brothers and sisters.\n\nI have encountered a fair share of Nazism IRL (being a DSA member and coming from the state where the Charlottesville murderer came from) and having a fascination with these type of people has led me to one conclusion: these people are just sad. Most of the time, they have zero life achievements and instead choose to take pride in the colour of their skin or their ancestry, something that they couldn’t choose and something that is totally superficial. They have a very simple view of the world: Jews control everything, every Jew is an enemy, I am a defender of Western civilisation (even though I stand against the principles our civilisation was founded upon). People like Nathan Domingo (the founder of Identity Evropa, a Neo Nazi pro Segregation group) became Nazis because they were without direction in life and needed community, in addition Domingo was completely ripped apart mentally by the Iraq War. Their views, while overly simplistic and idiotic, have deadly consequences. Once one dehumanises the Jewish people, the inevitable result is what happened in Charlottesville (where an Ohioan, James Fields, drove his car into a crowd of anti fascists and killed Heather Heyer) or Pittsburgh (where a Nazi killed 11 people, some of whom were old enough to have lived through the Holocaust, who were at a temple). \n\nTL; DR: Fascists misdirect their hatred of the ruling class towards an entire race of people, are lazy thinkers, and the ideology is just sad. A Jew is a man, a Nazi is a man, I am a man (I know that comes from a Holocaust denier, I’m just using it to point out that we all share a common humanity and none are superior to the other by birthright. We are all humans and our actions determine how good we are)\n\nIn conclusion: The only way fascism will come to the US is over my dead body\n", "score": 1, "send_replies": true, "subreddit": "teenagers", "date_year_month": "2018-12", "created_utc_converted": "2018-12-24 06:41:54", "score_overall": 9, "words": "jewish jew conspiracy holocaust jew jewish holocaust jew holocaust", "shared_words": "jewish jew conspiracy holocaust", "socre_distint": 4}
{"archived": false, "author": "[deleted]", "body": "My point is about the comparison of offensive stereotypes. \n\nStereotypes lead to hate crimes, racism, bullying, and have deep histories applied to them. Would it be great if offensive stereotypes were just abolished and forgotten? Absolutely. We'd eventually create new ones because humans are emotional beings with associative learning but it's be cool nonetheless.\n\nRegardless. I isolated the stereotype in context to its place among all other offensive stereotypes, which are altogether unfortunate, but exist. \n\nAnd when stereotypes unfortunately exist and are applied to all, the one that doesn't accuse the holder of being prone to steal, of being physically weak, of having a violent tendency, of having a disposition towards incestuous relationships, of having alcoholic tendencies, but rather having deep pockets, I think might not be the worst thing in the world.\n\nAlso in what what am I deny the \"greedy Jew\" stereotypes? Hebrews are historically industrious people and have generated a great wealth and prosperity obscured from any sort of \"greed\". My statement has to do with the stereo-typically offensive things that might be associated to a modern day Jew in terms of being RICH and POWERFUL.\n\nThe more offensive type of \"greed\" associated with Jewish people stems primarily from Adolf Hitler's campaign of Nationalising Germany in which he regularly pinned the countries woes on the \"greed\" of the Jewish \"rat\". He used them as a scapegoat and tool to gain power and most definitely was prejudiced against them.\n\nActual, genuine endorsement of Jewish people being greedy is no longer a stereotype. You would be supporting a Nazi ideology and moving beyond stereotype.\n\nMe pointing out that the stereotype of being \"rich and powerful\" compared to other OFFENSIVE STEREOTYPES is not a bad deal has jack shit to do with any of this. This is history.\n\nGet this through your thick fucking skull.\n\n", "score": 1, "send_replies": true, "subreddit": "nba", "date_year_month": "2018-12", "created_utc_converted": "2018-12-24 07:42:45", "score_overall": 9, "words": "jew greed jew greed jewish greed jewish scapegoat jewish", "shared_words": "jew greed jewish scapegoat", "socre_distint": 4}
{"archived": false, "author": "StrixTechnica", "body": "2/3\n\n&gt; Capitalism exploits everyone!\n\nCapitalism is intrinsically exploitative, but no more than any other system of rules, governance or trade.\n\n&gt; I used women and African people as merely a measuring example of how and who Capitalism exploits.\n\nFine, but it comes across the wrong way — as if you were distinguishing them as particularly more oppressed than everyone else solely and exclusively by virtue of their demographic.\n\n&gt; It’s not causal inversion, it’s fact that the winners of Capitalism then and now are white men.\n\nIf that's true, then why are there poor white men?  Clearly, being white and male is not a guaranteed meal ticket.  There is an essential additional element other than demography.  That's why it's causal inversion: it does not go from \"rich → white male\" to \"white male → rich\".\n\nFor that matter, how do you explain rich black men and women in the West?  Or rich oligarchs and dictators elsewhere in the world, most of whom are indigenous?\n\nPower and opportunity (especially nepotistic opportunity) are better explanations.  It's how power has always maintained power: by bestowing a taste of power on those who are the keys to maintaining that power.  CGP Grey does a brilliant job explaining this phenomenon in his animated/cartoon [Rules for rulers](https://www.youtube.com/watch?v=rStL7niR7gs).\n\n&gt; Immoral economic, social and political system called Mercantilism.\n\nWe've established that capitalism and trade is amoral and filled with actors that play the game according to the established (amoral) rules, some of which gives rise to immoral results.  The key is intent and by whom.\n\nAlso, [Mercantilism](https://www.investopedia.com/terms/m/mercantilism.asp) is not what you seem to think it is; it's a flawed theory of trade that posits that the amount of wealth in the world is fixed.  It has long since been abandoned.  In fact, mercantilism and modern international trade are predicated on mutually exclusive presuppositions.\n\n&gt; Clearly European society got it severely wrong in thinking their property rights were inclusive of Africans\n\nSure, by contemporary moral standards, it sure did.  But, again, Europeans were not the only slavers and conquerors who would acquire resources by force.  They were just spectacularly more successful at it because of the technological advantages which arose from the Enlightenment.\n\n&gt; (gold, rubber, bauxite, copper aluminium &amp; everything the west takes for granted in the form of most technological products) then conveniently abolishing slavery once all wealth had been maximised\n\nOn the contrary, countries with such natural resources do very, very well.  Just look to the oil producers of the Middle East.  Ever heard of tantalum?  It's an element used in a certain type of electronic capacitor [that has acquired the status of a conflict mineral](https://en.wikipedia.org/wiki/Tantalum#Status_as_a_conflict_resource) in the Congo. Some of my colleagues won't design circuits that use tantalum capacitors for that reason.\n\nAlmost by definition, these resources can't be found in sufficient quantities the developed world.  In a backhanded way, by having established dependence on them in those dark days, we've handed those countries a key to exploiting the developed West.  Unfortunately, corruption and greed work the same in developing countries, and most ordinary people never get to benefit from the riches of their natural resources.\n\n&gt; after it accumulated most of its asset/ property from slavery and global oppression\n\nNonsense.  Almost all land acquired under imperial exploits has been returned and, other than mined resources, the product of those lands (eg cotton, coffee and tea) are no longer the property of western powers.\n\nInstitutions such as the OECD, WTO and EU go out of their way to grant one-way exceptions in favour of developing economies to allow them to exploit their resources without being out-competed by more developed economies.\n\n&gt; setting up its structure for the newer Globalisation system\n\nAgain, nonsense; globalisation is a pretty recent phenomenon that started in the mid 20th C. and didn't really take off until the '80s.  Prior to that, protectionist trade policy was the rule, and even the EU is stiffly protectionist, especially on agrigoods.\n\n&gt; enabling it to be the largest empire in history reaching its peak between 1890 - 1922\n\nThat's pretty specific.  Who controlled this empire, and who benefited from it?  Was it exclusive imperial power and, if not, why single it out?\n\n&gt; a mere 53 years after it abolished slavery.\n\nEmpire had been around since the days of Henri VIII, and especially after Harrison (a Yorkshire carpenter!) invented his marine chronometer, and that's just Western empires.\n\nImperial exploits have been around a lot longer than that.  The Ottomans date from the early 14th C. and the Silk Road dates from 2nd C. BCE or before.\n\n&gt; But we’re not talking about the Arab world.\n\nWhy not?  What exempts Jewish and Arab slavers from moral condemnation?\n\n&gt; It’s not anti Semitic to state a fact is it?\n\nOf course it's not.  It doesn't attribute being slavers with anything intrinsically semitic.  That sense of antisemitism is exploitative political opportunism.\n\n&gt; Just like virtually every European country has at one time or another persecuted Jewish people.\n\nSo why single out the West for special moral scrutiny when all have engaged in exploitative practices?  The West just turned out to be better at it, and only because of its technology.  Maori history when the British first showed up demonstrates that any group will settle old scores, given a technological edge and the opportunity (c.f. the demise of the Moriori).\n\n&gt; But no country or people did it with the level of genius and sadism as done under the capitalist system during the transatlantic slave trade and the industrial revolution era of European western society.\n\nThat's revisionist.  A lot of conquering powers were far more sadistic than Europeans ever were (c.f. Japanese treatment of PoWs).  The only reason nobody cares is because they lost out to European technology.\n\n&gt; transatlantic slavery was a major contributor to to today’s western wealth\n\nContributor, yes, but we've had several rather recent and profound demonstrations of how wealth can be destroyed.  What wealth was plundered from elsewhere has long since diffused and faded.\n\n&gt; we as a Globalist society believe in ownership of Asset/ Property\n\nA lot of ordinary western citizens are none too fond of globalism precisely because globalism has benefited the poorest 50% and the richest 1% far out of proportion to the percentiles in between (which represent western working and middle classes).\n\n&gt; social cowardice prevents many privileged people\n\nBy global standards you, too, are *wildly* privileged.  You have access to technology and education most of the world can barely but dream of.\n\n&gt; Globalisation was born out of Capitalism\n\nYes, although it's far from certain that something a bit like globalisation would not have developed anyway, depending on what prevailed instead of capitalism.\n\n&gt; [capitalism] was born from a rotten core.\n\nBold claim.  Care to elaborate?\n\n&gt; That rotten core was Mercantilism.\n\nCapitalism, globalism and mercantilism are three quite different things even if they are tangentially related to one another.\n\nActually, I'd say that the problem goes far deeper than capitalism or globalism alone (mercantilism is a thing of the past): it has to do with the role of commercial banks in creating money supply by way of lending.\n\nIn brief: a person who takes out a mortgage issues a promissory note, no different in principle to a gilt, cheque or bank note other than that it's \"non-negotiable\", which the bank buys by crediting the borrower's *electronic* account with *electronic* money.  This money is transferred, electronically, to the seller's account who usually uses it to buy another house (perhaps with a top-up mortgage) and around it goes.  (It was no different when accounts were kept in paper ledgers, either, it's just a lot easier than ever before with electronic ledgers.)\n\nHence, the act of writing a mortgage literally creates money.  It's a trick of accounting that involves setting up a mutual liability to one another which, superficially, creates zero net change.  The \"capital\" deposited in the borrower's account is a fiction netted against time.  It was never real: at the moment the new money was credited to the borrower's account, more or less the equivalent of a set of post-dated balancing entries are entered to show zero net change in money at the maturity of the mortgage (assuming it isn't defaulted on, which is the Achilles' heel in the idea).\n\nBut that maturity is a long, long way away; meanwhile, the books don't really balance because anybody will accept that as real money (notably the seller's bank) because everyone agrees it is real money and can be used as such.\n\nAbout 97% of money in circulation is created this way.  If this sounds fanciful, read the [BoE's article describing the process](https://www.bankofengland.co.uk/-/media/boe/files/quarterly-bulletin/2014/money-creation-in-the-modern-economy), although they aren't quite as explicit as the description I just gave.  This is not even any secret, people do talk about it but, for reasons that you can imagine, it's not a popular topic of conversation.\n\nEveryone knows that printing money, which is exactly what this is, generates inflation.  And to the extent that new money is created faster than value is created, that's precisely what happens.  The problem is that while trade output can grow, fixed-quantity assets (like houses) don't, so you see way higher inflation in asset prices than you do in the productive economy.\n\nThis isn't even capitalism, it's modern banking which is capitalist in theory, but not in practice.\n", "score": 1, "send_replies": true, "subreddit": "ukpolitics", "date_year_month": "2018-12", "created_utc_converted": "2018-12-24 14:54:29", "score_overall": 5, "words": "greed jewish jewish globalist cowardice", "shared_words": "greed jewish globalist cowardice", "socre_distint": 4}
{"archived": false, "author": "TanookiDooki", "body": "**\"Chosen\" doesn't mean what people think it means.**\n\nJudaism establishes a series of laws known as the noahide laws. These laws are a standard of rule, law, and ethics that the whole of humanity is held to. \n\nJews are \"chosen\" in the sense we have been given a higher standard of responsibility to uphold. You'll typically hear that Jews have 613 commandments we follow. A non-Jew isn't required to observe laws a Jew is required to follow.\n\n- We can't eat pork\n- We can't eat unclean food\n- We can't break Shabbat\n- We can't do many of the things a non-Jew is allowed to do\n\nThat being said, you're not having our rules held against you if you break them. Only Jews are. \n\nSo that alone doesn't make sense from the perspective of \"Choosiness\" being something Jews use to look down on others. If we thought less of other people, we'd argue that God judges you more harshly than he does us, the opposite is true. \n\nWe actually have a tradition which states humanity as a whole was offered the Torah but only the Jews accepted. While it isn't explicitly stated in the Torah, it is part of the supplementary works which make up the full body of Jewish commentary.\n\n- The reason the Torah was given in the desert and not in the promised land was the desert belonged to no one. It was a place no one had claim to so everyone was welcome to accept the covenant regardless of nation status. \n\n- When the words were spoken, they were heard in every language. The revelation at Sinai wasn't in the tongue the Israelites spoke, it was in the tongue of every nation so that any ear that heard it could accept the gift. It wasn't an isolated covenant. \n\n- Genesis states that when God created mankind, he did so in his own image. That isn't specific to Jews, that's specific to the whole of humanity. Why would God put such an essence into beings that he didn't consider worthy of such a gift? Our tradition says that we are ALL images of God. Some are Jewish and some aren't but we're all children of the same creator.\n\n- The Jewish people convert. We still have people to this day who convert into the nation long after Sinai had occurred. The very fact that we allow converts in the first place is evidence that we don't look down on non-Jews. If we did, why would we ever consider someone we consider lower than us to be worthy of the covenant? Because we don't think people are lower than us, they have a different set of responsibilities from our tradition, that's it. \n\n&gt;It seems to be that this attribute of jewish doctrine conceptually underpins Zionism by validating the perspective that these chosen peoples homeland is more needed then the homeland of others.\n\nThe reason why the Jewish people need a homeland is the world validated that they couldn't be trusted to protect us. \n\nThe Jewish people didn't enter the outside world willingly. We had our country invaded and we were forced into exile by the Babylonians and Romans.  \n\n**I'm going to list off a series of countries.** All of these countries have persecuted or exiled the Jewish people at some point in history.\n\n- England\n- Spain\n- Portugal\n- Italy\n- Germany\n- France\n- Russia\n- Ukraine\n- Finland\n- Poland\n- Hungary\n- Belgium\n- Netherlands\n- The list goes on.\n\nIf you asked any one of these countries why they went after us, you'd get a thousand different answers. \n\n- The Nazis argued we were aligned with the Communists\n\n- The Soviets argued we were aligned with the Capitalists\n\n- The Protestants and the Catholics argued we killed Jesus and were aligned with the devil. [(The Protestant leader, Martin Luther, actually wrote a document called \"On The Jews and Their Lies\")](https://en.wikipedia.org/wiki/On_the_Jews_and_Their_Lies) which outlined specifically how the Jews should be subjugated.\n\n- [The Catholic church kidnapped our children during the Holocaust and forcibly converted them to Catholicism while they were being kept \"safe\" in Catholic institutions.](https://www.nytimes.com/2005/01/09/world/saving-jewish-children-but-at-what-cost.html) They saved their lives but killed their identities. \n\n- The Far-Right argues we're aligned with Muslims because we're semites and not really white people.\n\n- The Far-Left argues we're Europeans masquerading and middle eastern people and responsible for the crimes of the 1%.\n\n- [Europe argued we were responsible for the black plague because fewer of us died.](https://en.wikipedia.org/wiki/Black_Death_Jewish_persecutions) The reason fewer of us died was because we lived in ghettos (separate from them), we ate different food (kosher), and Jewish tradition requires we bury the dead immediately. Not leave them out to contaminate. \n\n- And everybody rolls their eyes at the mention of the Holocaust because \"That was like 70 years ago, get over it.\"\n\n**If everyone had a singular reason for hating the Jewish people, just one unified reason, you could argue that our persecution had a cause. No one can agree on why they hated us but they all simply agreed on the hate. Not the cause for the hate.**\n\nThat is evidence of insanity on their part, not mistakes on our part. \n\n\nWhy does Israel need to exist and why did Zionism come into existence? Zionism is a side-effect of a Jew-hating world. The only reason Jews go back to Israel is they fear for their lives everywhere else. Even in Israel, surrounded by states that want our destruction, we live with the peace of mind that we are handling ourselves from now on. \n\nEurope was given thousands of chances to protect us and they failed each and every time. Even today 40,000 Jews have fled France. \n\nThere would be no modern Zionism if the world didn't actively prove a need for modern Zionism. We would have merged with the societies we fled to if they had protected us. They failed.", "score": 10, "send_replies": true, "subreddit": "Judaism", "date_year_month": "2018-12", "created_utc_converted": "2018-12-24 15:46:48", "score_overall": 17, "words": "jew jew jew jewish jewish jewish jewish jewish jewish jewish holocaust jewish kosher jewish holocaust jewish jew", "shared_words": "jew jewish holocaust kosher", "socre_distint": 4}
{"archived": false, "author": "beaverteeth92", "body": "&gt;  these nitwits are gonna have to decide whether white jews are part of the white supremacy or marginalized people\n\nThis is the main issue I have with young leftists.  I'm Jewish, was raised Jewish, and went to day school for 11 years.  I haven't practiced in years but still generally support Israel as a Jewish state, even though I despise Netanyahu and think that Likud is currently the biggest thread to Israel's existence.  Why do I support them despite Netanyahu being a heinous person?  Because sooner or later, even after centuries of relative safety, a country *will* turn on its Jews.  It's only going to get worse in the next few decades at the last remaining Holocaust survivors - the people who understand the evils of anti-Semitism the most - die out.  Thousands of Jews have been fleeing France as anti-Semitic attacks have increased in frequency.  Their destination is Israel because it's the only government in the world that is guaranteed to protect Jews no matter what happens.  In the 60s and 70s, thousands of Jews fled Arab countries and Ethiopia to establish a better life in Israel.  Sure, if Israel didn't exist, they might have successfully immigrated somewhere else.  But would another country have sent a 747 to Ethopia to smuggle out as many Jews as possible?  I sincerely doubt it.  They fled to Israel because Israel is the only on earth that will unconditionally protect Jews.\n\nA lot of leftists don't understand just how much the need to be defensive is bashed into the heads of every Jew since childhood.  Sure, I never go to shul, but do you think Hitler would have cared about that?  If you had as much as a Jewish grandparent the Nazis considered you Jewish.  So of *course* we're going to support the existence of an explicitly Jewish state.  After virtually every country rejected refugee Jews during World War II, resulting in the ship going back to Europe and their deaths, why should we trust that anyone other than an explicitly Jewish state will protect us?\n\nAnd yet, we're the only people on earth whom a sizable number of leftists think do not have the right to self-determination.  There are plenty of countries founded on barbarism and because of colonialism, and many who have done heinous things, but no one questions said countries' right to exist.  In the 80s, there were lots of protests around apartheid in South Africa, but no one was claiming that South Africa shouldn't exist because of it.  There are no conversations about how Burma shouldn't exist because of its genocide of the Rohingya, no discussions about Belgium being broken up because of King Leopold's treatment of the Congolese, but it's pretty common to talk about Israel not being allowed to exist.  And yet the same people would probably not complain if land from Kurdistan was taken from sovereign nations to give the Kurds their own state.\n\nIt's disappointing how few leftists even try to understand the Jewish need to feel security.  I'd hope Tamika Mallory, who's black and has presumably had the \"you have to be defensive when it comes to interactions with the police\" discussion, would understand why Jews are similarly defensive.  But nope.  She goes to watch Farrakhan talk, even though he's just as anti-Semitic in 2018 as he was fifty years ago.  I suspect that if a Jewish leader of the women's march went to see a Hassidic rabbi who gave a speech on black people being descendants of Ham who are inherently evil, Tamika Mallory would call for her head.  Similarly, if I lectured a black person how they're required to feel about police shootings and being followed by security in a department store, I'd be rightfully attacked for it.  Meanwhile, if I say that I support Israel's right to exist and that anti-Semitism is a real problem (*especially* if it's about anti-Semitism in leftist spaces; e.g. Corbyn-bots), a bunch of obnoxious, useless goyim will gang up on me and tell me exactly how I should feel and lecture me in an equally condescending way.\n\nI think a lot of it is that Jews are a difficult minority to understand from a social justice standpoint.  If you believe racism is \"power + privilege\", Jews don't face widespread societal discrimination in most countries, and many Jews hold positions of power.  So if that's your understanding of racism, how can there possibly be societal discrimination against Jews?  I'd ask people whose tombstones have been graffitied with swastikas, the victims of the Tree of Life shooting, and the Holocaust survivor who was stabbed and whose apartment was subsequently set on fire, but unfortunately I won't be able to ask them.", "score": 11, "send_replies": true, "subreddit": "Enough_Sanders_Spam", "date_year_month": "2018-12", "created_utc_converted": "2018-12-25 00:40:11", "score_overall": 13, "words": "jewish jewish jewish holocaust jew jewish jewish jewish jewish jewish jewish goyim holocaust", "shared_words": "jewish holocaust jew goyim", "socre_distint": 4}
{"archived": false, "author": "LegitimateRain", "body": "Both are terrible things to be. The fact that Corbyn has flirted heavily with both makes him a disgusting excuse for a human being.\n\nIf anything the libel laws of this country encourage the defamed to sue. It would be on Clare Perry to prove she told the truth. Maybe Corbyn just doesn't want his past associations dragged through a courtroom and the press? And if you were an anti-Semite who had supported and given succour to those who engage in disgusting conspiracy theories such as blood libel and holocaust denial, if you had supported racist murals yourself, and honoured and memorialised Jew hating terrorists, if you had said some pretty questionable things in the past, would you really want to go through a trial?\n\nI see the shit that decent women get on social media. Rachel Riley, JK Rowling, Tracey Ann Oberman for calling out hate and bigotry. It's got to the point where Labour MPs have called the party institutionally racist. Where so many Labour MPs have stood down that the Labour Party now has fewer MPs than it did in 2010. Corbyn is at the centre of this. Your man's a racist, a fascist and a bully, and if I'm partisan against him, it's because I hate fascists, and fascists deserve to be punched. ", "score": 0, "send_replies": true, "subreddit": "ukpolitics", "date_year_month": "2018-12", "created_utc_converted": "2018-12-25 16:41:16", "score_overall": 5, "words": "libel conspiracy libel holocaust jew", "shared_words": "libel conspiracy holocaust jew", "socre_distint": 4}
{"archived": false, "author": "bountyX", "body": "Sorry you don't like me on this sub, but I'm not leaving, as I have as much of a right to be here as you do. Also, I don't appreciate you belittling me with your language and referring to it as \"stupid\" and \"filled with hate\" and other such condemnations. I did not personally attack you, and I would appreciate if you at least showed me the same respect.\n\nI've seen enough of E;R to know that he is a reprehensible human being. The specific video in question (his [\"THE LAST DEATH NOTE;R (PART 1)\"](https://www.youtube.com/watch?v=njmCtiO_Xj8) video) is full of fascist sentiment and other hateful propaganda. For example, approximately 37 minutes into the video, he makes references to the aforementioned Heather Heyer. To quote him verbatim: \"So, for example, say you write the name of a woman and that she will die of being struck by a car. However, there’s too much shit in the way for a car to hit her. Because the situation is impossible, and thus the cause of death as well, the woman would die of a heart attack.” As I mentioned before, that lie was invented by American white supremacists to mislead and distract the public from the fact that Heyer was murdered. If she had really died of a heart attack, I doubt that [James Fields Jr. would be going to jail for life for murder.](https://www.washingtonpost.com/local/public-safety/james-a-fields-jr-sentenced-to-life-in-prison-in-charlottesville-car-attack/2018/12/11/8b205a90-fcc8-11e8-ad40-cdfd0e0dd65a_story.html?noredirect=on&amp;utm_term=.6fb389bcb0dd) In addition to the varying degrees of visible white supremacy, Nazism, and other far-right dogwhistling, evidence of E;R's hate can be found in the description of the same video, wherein he says \"The truth about why this took so long is because I thought it was so funny to call Black L “N*glet” throughout all my recordings,\" (censored because I know automod doesn't like people throwing racial slurs around, but it's not censored in the slightest in the description), a blatant racial slur, as well as referring to his Patreon as a \"Shameless Shekel Shakedown,\" another anti-semitic dogwhistle. This goes and-in-hand with the majority of E;R's content, none of which is supposed to be satirical, though he may claim it is, because, as the copypasta goes, \"satire requires a clarity of purpose and target lest it be mistaken for and contribute to that which it intends to criticize.\"\n\nFor a man who you claim to be not racist, Stefan Molyneux sure has an obsession with race and IQ, particularly how much more superior the \"white race\" is in general. He's made claims that [organ donation between \"races\" is impossible due to the alleged inherent differences between them](https://twitter.com/StefanMolyneux/status/1071825748707631106), that [non-white people (specifically black and Latinx people) are inherently inferior to whites](https://www.splcenter.org/fighting-hate/extremist-files/individual/stefan-molyneux), not to mention all the other hateful rhetoric about women and Jewish people, and, just recently, he [took a trip to Poland which apparently sold him on white supremacy](http://www.rightwingwatch.org/post/stefan-molyneux-says-his-trip-to-poland-sold-him-on-white-nationalism/). On his visit, he stated: “I’ve always been skeptical of the ideas of white nationalism, of identitarianism and white identity. However, I am an empiricist and I could not help but notice that I could have peaceful, free, easy, civilized and safe discussions in what is essentially an all-white country.” Molyneux is apparently so skeptical of white supremacy that it only took a few incorrect hot takes about a country to sell him on the idea.\n\nWhile Paul Joseph Watson may not be an outright white supremacist, he's still very alt-right, and that's still a problem (which is why I classified him under a wide umbrella of hateful right-wing types, because not all right-wing hate groups are the same and not inherently directly connected to each other). Watson is very much akin to Alex Jones, who needs no introduction as an unhinged lunatic, and, despite many of his videos being named \"The Truth About X,\" he sure does a lot of lying and misleading to \"prove\" his point, whatever it may be. His entire persona is built on misleading people into believing lies and other misconceptions. One of his favorites is attacking feminism, as he claims that that [people who believe in equal rights for women are physically unattractive](https://www.youtube.com/watch?v=PwYN7l--3oY) [time](https://twitter.com/PrisonPlanet/status/822104534692536320) and [time](https://twitter.com/PrisonPlanet/status/707537693811609600), because, y'know, personal beliefs and physical attractiveness are always completely interchangeable. So, white supremacist? No, but he's a hatemonger all the same, and the fact that Pewdiepie associates with him at all is a telling sign that perhaps Felix is being led along the path of blind conservative malice.\n\nDave Rubin is an American centrist in the same way that Boogie2988 is an American centrist, as he claims to be in the political center, yet goes out of his way to exclusively criticize the left-wing, such as with Boogie's [\"some good came out of the Holocaust\" statements](https://twitter.com/RantingF/status/1047877190614806528) and other, similar musings. Rubin is alt-right in the sense that he goes out of his way to invite more \"outspoken\" alt-righters onto his show (such as the aforementioned Molyneux, far-right conspiracy theorist and \"[guy who does not believe that rape is an actual thing](http://archive.is/S0Sra)\" Mike Cernovich, and Glenn Beck, who needs no introduction as an intolerant fool) and does very little (if not nothing at all) to oppose those views, going out of his way to give them a platform. The few people from the left that Rubin *does* invite onto his show are met with skepticism and judgement that the right-wing interviewees do not face. Thus, Rubin is a centrist in his mind only. I do not appreciate you putting words in my mouth about Rubin being a racist, as I included him under the wide umbrella of right-wing hatemongers because, like Watson, being part of the alt-right sphere of thought does not necessarily immediately make you an avowed racist.\n\nBefore I go into discussing Ben Shapiro, I would ask you to please rethink referring to a Jewish person as \"a Jew.\" I am not accusing you of intolerance, but please know that referring to Jewish people in that way is very historically loaded and many people may take exception to that. Again, not accusing you of anything, but please be mindful of this in the future.\n\nWith that out of the way, you first claim that Ben Shapiro is not a conservative, then you refer to him as a conservative for the rest of your argument. Perhaps I'm missing the sarcasm. Regardless, Shapiro is alt-right and he is racist. For example, [this tweet](https://twitter.com/benshapiro/status/116002989570920448?lang=en) lays very bare how willing he is to go around directly saying that black \"thugs\" will never amount to anything in life, which is racist. In addition, he has made racially-biased, sweeping - and, frankly, absurd - [claims about people from the Middle East](https://twitter.com/benshapiro/status/25712847277) that are very obviously steeped in bigotry. In addition, Shapiro is an [avowed transphobe](https://twitter.com/benshapiro/status/932504794328993797). Though you claim that he uses rationality over emotion (I believe he calls it \"facts don't care about your feelings\"), I would say that this is incorrect, as he is the purveyor of several outlandish conspiracy theories, including, but not limited to, believing that [*Sesame Street* is liberal propaganda](http://www.youtube.com/watch?v=8W1NURCkQHM) and [climate change denial](http://cinemaunrest.com/wp-content/uploads/2015/05/Addams-Family-Values-1993-06.jpg), as well as the aforementioned racist and transphobic comments. As for his Jewish beliefs and heritage, I do not appreciate you talking down to me in saying that I'm \"disconnected from reality.\" Just because he is Jewish does not mean that he cannot be [racist or conservative at all](https://jewishjournal.com/opinion/175787/).\n\nThe whole reason I'm having this conversation right now is not because I have some hateful agenda against conservatives or want \"civil war\" but because the beliefs of the people that I mentioned are beliefs of hate, and they are being espoused by the most subscribed-to YouTuber on the site (over [66 million](https://www.digitaltrends.com/social-media/biggest-youtube-channels/2/)), further spreading hateful rhetoric among literal millions of people. This is not about spreading opinions I personally dislike so much as it is about spreading downright falsifications and further encouraging the people who perpetrate them.\n\nIf you felt personally attacked by anything I have said, I sincerely apologize. My goal is to spread tolerance and understanding to minority groups in America and other historically underrepresented and disenfranchised individuals, not direct blind rage towards anybody that I deem \"deplorable.\"\n\nHave a happy Boxing Day.\n\nEDIT: a word was missing a \"t\".\n\nEDIT 2: as if this wasn't long-winded enough, I forgot to include a link to Sir Karl Popper's [\"The Open Society and its Enemies\"](https://monoskop.org/images/4/42/Popper_Karl_The_Open_Society_and_its_Enemies_The_Spell_of_Plato_Vol_1_1st_ed.pdf), but if you don't have time to read that (understandable, as it's pretty long), this [infographic about the Paradox of Intolerance](http://wy3mg1xgify37n21x223cw7xl1.wpengine.netdna-cdn.com/wp-content/uploads/2017/08/HcuZIT5w8xJLMXoISDexG1GNz5Dj7xHO_QGeueMtdPU.jpg) should further explain why I believe in the imminent danger that the alt-right and their constituents pose to wider society.", "score": 1, "send_replies": true, "subreddit": "Gamingcirclejerk", "date_year_month": "2018-12", "created_utc_converted": "2018-12-27 02:11:47", "score_overall": 9, "words": "jewish holocaust conspiracy jewish jew jewish conspiracy jewish jewish", "shared_words": "jewish holocaust conspiracy jew", "socre_distint": 4}
{"archived": false, "author": "newwavefeminist", "body": "The Jews were slaughtered for being Jewish, not for being non-white. The Nazis were perfectly happy to buddy up with the Arabs and Japanese. The feeling was Jews controlled too much of the worlds wealth/there was a conspiracy etc that caused Germany's woes, and they were used as a scapegoat. Plus some good old historical Jew hatred based on religion.", "score": 12, "send_replies": true, "subreddit": "GenderCritical", "date_year_month": "2018-12", "created_utc_converted": "2018-12-27 12:47:58", "score_overall": 4, "words": "jewish conspiracy scapegoat jew", "shared_words": "jewish conspiracy scapegoat jew", "socre_distint": 4}
{"archived": false, "author": "viva_allende_", "body": "We seemed slow to deal with the issue, I think the better reason is just because there was so much bad blood and such a history of unfair criticism toward the leadership that this just seemed part of a flood. It was poorly handled but I can understand the bunker mentality.\n\nHe has dealt with it to the extent that disciplinary issues are his responsibility  though. We took on many new staff to process claims, we took on the ridiculously unfit for purpose full IHRA guidelines on antisemitism, disowned by the bloke that wrote them, and that have already been used in London boroughs to quell pro Palestinian activism and to hell with free speech.\n\nI'm happy for us to adopt any guidelines that punish the use of anti Jewish tropes, but it's also painfully obvious how much of an agenda the likes of Jewish Chronicle editor has, and especially so how deathly silent the right wing jewish-interest press has been on the antisemitic comments made by Trump, especially by his supporters and by our governments support of Orban...while throwing everything they can at Corbyn. In that context it's always going to seem like were being singled out. And we are- there's plenty of evidence that Tory members are more likely to agree with anti Semitic tropes, but Tories don't have a history of activism in support of Palestine.\n\nIt's also obvious that some anti Jewish tropes and anti Israel arguments are easy to conflate if its in your interest is to do so. \n\nIsrael has a huge lobby in the UK that has been involved in targeting MPs- but to point that out is to risk accusation of the shadowy jew new world order trope, while pointing out that Israeli forces have killed innumerable Palestinians civilians over the years of conflict is to risk accusations of invoking blood libel tropes.\n\nAlong with clarifying how we can keep reminding the world how awful the Israeli regime is without being associated with racists, one good thing the guidelines will achieve is to stop idiots making Nazi and holocaust comparisons. I mean Israel is an ethnostate that legally discriminates between citizens in a way not seen in a 'western' ally since South Africa, and that runs a giant prison camp....but it should be enough to just state these facts rather than reference such an unspeakable atrocity, trying to goad non Israeli jews into facing up to 'their' states actions.\n\nI guess the frustration amongst those of us who care about human rights is that we've had years of pointing out that Israel is an ethnostate, runs a giant prison camp, commits regular atrocities against civilians.....but nothing ever gets done.", "score": 12, "send_replies": true, "subreddit": "LabourUK", "date_year_month": "2018-12", "created_utc_converted": "2018-12-27 22:44:17", "score_overall": 7, "words": "jewish jewish jewish jewish jew libel holocaust", "shared_words": "jewish jew libel holocaust", "socre_distint": 4}
{"archived": false, "author": "MarquisDePaid", "body": "[Summary](http://www.unz.com/runz/american-pravda-the-jfk-assassination-part-ii-who-did-it/):\n\n\n&gt;...For decades following the 1963 assassination, virtually no suspicions had ever been directed towards Israel, and as a consequence none of the hundreds or thousands of assassination conspiracy books that appeared during the 1960s, 1970s, and 1980s had hinted at any role for the Mossad, though nearly every other possible culprit, ranging from the Vatican to the Illuminati, came under scrutiny. Kennedy had received over 80% of the Jewish vote in his 1960 election, American Jews featured very prominently in his White House, and he was greatly lionized by Jewish media figures, celebrities, and intellectuals ranging from New York City to Hollywood to the Ivy League. \n\n&gt;Moreover, individuals with a Jewish background such as Mark Lane and Edward Epstein had been among the leading early proponents of an assassination conspiracy, with their controversial theories championed by influential Jewish cultural celebrities such as Mort Sahl and Norman Mailer. Given that the Kennedy Administration was widely perceived as pro-Israel, there seemed no possible motive for any Mossad involvement, and bizarre, totally unsubstantiated accusations of such a monumental nature directed against the Jewish state were hardly likely to gain much traction in an overwhelmingly pro-Israel publishing industry.\n\n&gt;**However, in the early 1990s highly-regarded journalists and researchers began exposing the circumstances surrounding the development of Israel’s nuclear weapons arsenal. Seymour Hersh’s 1991 book The Samson Option: Israel’s Nuclear Arsenal and American Foreign Policy described the extreme efforts of the Kennedy Administration to force Israel to allow international inspections of its allegedly non-military nuclear reactor at Dimona, and thereby prevent its use in producing nuclear weapons.** Dangerous Liaisons: The Inside Story of the U.S.-Israeli Covert Relationship by Andrew and Leslie Cockburn appeared in the same year, and covered similar ground.\n\n&gt;Although entirely hidden from public awareness at the time, the early 1960s political conflict between the American and Israeli governments over nuclear weapons development had represented a top foreign policy priority of the Kennedy Administration, which had made nuclear non-proliferation one of its central international initiatives. It is notable that John McCone, Kennedy’s choice as CIA Director, had previously served on the Atomic Energy Commission under Eisenhower, being the individual who leaked the fact that Israel was building a nuclear reactor to produce plutonium.\n\n&gt;The pressure and financial aid threats secretly applied to Israel by the Kennedy Administration eventually became so severe that they led to the resignation of Israel’s founding Prime Minister David Ben-Gurion in June 1963. But all these efforts were almost entirely halted or reversed once Kennedy was replaced by Johnson in November of that same year. \n\n&gt;Piper notes that Stephen Green’s 1984 book Taking Sides: America’s Secret Relations With a Militant Israel had previously documented that U.S. Middle East Policy completely reversed itself following Kennedy’s assassination, but this important finding had attracted little attention at the time.\n\n\n\n&gt;Skeptics of a plausible institutional basis for a JFK assassination conspiracy have often noted the extreme continuity in both foreign and domestic policies between the Kennedy and Johnson Administrations, arguing that this casts severe doubt on any such possible motive. **Although this analysis seems largely correct, America’s behavior towards Israel and its nuclear weapons program stands as a very notable exception to this pattern.**\n\n&gt;**An additional major area of concern for Israeli officials may have involved the efforts of the Kennedy Administration to sharply restrict the activities of pro-Israel political lobbies.** During his 1960 presidential campaign, Kennedy had met in New York City with a group of wealthy Israel advocates, led by financier Abraham Feinberg, and they had offered enormous financial support in exchange for a controlling influence in Middle Eastern policy. \n\n&gt;Kennedy managed to fob them off with vague assurances, but he considered the incident so troubling that the next morning he sought out journalist Charles Bartlett, one of his closest friends, and expressed his outrage that American foreign policy might fall under the control of partisans of a foreign power, promising that if he became president, he would rectify that situation. \n\n&gt;And indeed, once he had installed his brother Robert as Attorney General, the latter initiated a major legal effort to force pro-Israel groups to register themselves as foreign agents, which would have drastically reduced their power and influence. But after JFK’s death, this project was quickly abandoned, and as part of the settlement, the leading pro-Israel lobby merely agreed to reconstitute itself as AIPAC.\n\n\n[Jack Ruby](https://web.archive.org/web/20180710041833/https://forward.com/news/187793/lee-harvey-oswalds-killer-jack-ruby-came-from-stro/):\n\n&gt;Lee Harvey Oswald's Killer 'Jack Ruby' Came From Strong Jewish Background\n\n&gt;(JTA) — We were sharing a pastrami sandwich and pickles at the Los Angeles landmark Canter’s Deli. I was 24. She was nearly 50 years older, with a piercing voice as loud as her flaming red wig.\n\n&gt;**Her name was Eva Rubenstein Grant, and she was a little-known nightclub manager the morning of Nov. 24, 1963, when her brother left the apartment they shared in Dallas and blasted his way into infamy by fatally shooting Lee Harvey Oswald. It was history’s first live televised murder.**\n\n&gt;...Despite their dysfunctional world, the Rubensteins kept a kosher home, observed the holidays, sent their boys to Hebrew school and attended synagogue.\n\n&gt;Ruby idolized Chicago Jewish boxing champion Barney Ross, who later described him as a “well-behaved” youth. But others recall Ruby’s hair-trigger temper and street brawls, especially when taunted by the non-Jews in his mixed Jewish-Italian neighborhood. Ruby’s biographer, Seth Kantor, relates that as an Air Force private, Ruby once beat up a sergeant who called him “a Jew bastard.”\n\n\n&gt;...**According to evidence uncovered by the U.S. House of Representatives Assassinations Committee in the 1970s, Ruby was later linked to mobsters Carlos Marcello and Santos Traficante, who the panel considered prime suspects in a possible mob conspiracy to assassinate Kennedy.**\n\n&gt;Whatever he was doing behind the scenes, Ruby became known as a nightclub owner and at some point began attending services at Congregation Shearith Israel. Rabbi Hillel Silverman, who was the Dallas synagogue’s spiritual leader from 1954 to 1964, says Ruby came to say Kaddish for his father.\n\n&gt;“He came to minyan one day with a cast on his arm,” Silverman recalled. “I said, ‘Jack, what happened?’ He said, ‘In my club, somebody was very raucous, and I was the bouncer.’ ”\n\n&gt;Silverman, now 89 and still leading High Holy Days services every year, remembers Ruby well. Once Ruby showed up at the rabbi’s house with a litter of puppies and insisted the rabbi take one. When the family went to Israel one summer, Ruby looked after the dog.\n\n&gt;“**The day of the assassination, we had our regular Friday night service, which became a memorial service for the president,” Silverman said. “Jack was there. People were either irate or in tears, and Jack was neither. He came over and said, ‘Good Shabbos, rabbi. Thank you for visiting my sister Eva in the hospital last week.’ I thought that was rather peculiar.**”\n\n&gt;Two days later, Silverman spoke to his Sunday morning confirmation class, expressing relief to the students that Lee Harvey Oswald was not Jewish or there might have been a “pogrom” in Dallas. He then switched on the radio and heard that a “Jack Rubenstein” had killed the assassin.\n\n\n\n", "score": 7, "send_replies": true, "subreddit": "conspiracyundone", "date_year_month": "2018-12", "created_utc_converted": "2018-12-28 07:44:12", "score_overall": 16, "words": "conspiracy illuminati jewish jewish jewish conspiracy jewish jewish conspiracy jewish kosher jewish jewish jew conspiracy jewish", "shared_words": "conspiracy illuminati jewish kosher jew", "socre_distint": 5}
{"archived": false, "author": "chayyim_ben_david", "body": "&gt;Israel grants citizenship (through an accelerated process) to any Jewish person who comes from anywhere in the world while it denies the same to everybody else. \n\nSort of, there are limiting factors that can prevent a Jew from immigrating. Also several other nations have this right. Sweden for instance will allow those with Swedish blood to immigrate; Germany and Austria offer the same program and so do several other nations. Why you're only focusing on Israel for a very common practice in immigration is beyond me?\n\n&gt;This right is given as is, no questions asked, no strings attached. \n\nAgain that is not true there are strings attached. For instance the person making the Aliyah cannot have any felonies or be under investigation. My great cousin Meyer Lansky was turned away because he was under investigation. Despite the charges being dropped later on they still wouldn't let him in. Of course Israel has accepted all the women in my family, but we men have had a harder time of it.\n\nAlso you have to get an Apostille which means the native country of the migrant also has the recognize the Law of Return and sign off on all their documents. If they don't then the migrant won't be able to easily enact the Law of Return. Possibly the Jewish Agency would smuggle them out and to Israel, but that would be an extreme and special case.\n\n&gt;This is in contrast with migration laws in other countries.\n\nAgain its not in contrast as Austria offered me a Birthright because I come from a Austrian Jewish family that they killed off the majority of during the Holocaust. They also offered me blood money, but I accepted neither.\n\n&gt;For example, Scandinavian countries grant asylum/residency based on humanitarian conditions to Syrians, Kurds and Palestinians.\n\nWell, no but also yes. I was a refugee in Sweden so I've seen this system at work. They don't really give a damn about the \"humanitarian conditions\" so much as they do the money they can get from the EU and UN for temporarily accepting refugees. For everyone that begins the process the host nation gets paid to care for, then the host is welcome to deny them and ship them back. Sweden and Denmark got in a huge row over this very practice in 2015 because in 2014 Denmark got a bunch of refugee money, then denied everyone and sent them to Sweden. Sweden in return did the same exact thing and sent them to Denmark just after enacting boarder patrols to prevent refugees from filing a second time in Sweden. Denmark got pissed. Sweden got pissed. Its been one of the major talking points in elections since. \n\nI can understand why the point on Scandinavia was missed. Unless you speak one of the languages then you're not going to get this information. The debates/serious talks are all in their native tongues and the media is state controlled for the most part. On the bright side since it is state controlled there is less meta-data sale from their websites. For instance www.svt.se doesn't cache things locally where as the BBC does. \n\n&gt;I understand that such a law is based on the past history of antisemitism and pogroms, yet I fail to see why this right is still automatic to this day. \n\nActually the Law of Return is based on historical legal and religious president. It is one of the oldest laws in Israel. There is more to the Jewish people and the nation of Israel than the Holocaust. Why you're considering anything involving Israel as being directly related to the Holocaust is beyond me?\n\n&gt;My interest in this is that obviously it feels that with every unneeded Jew coming to Israel (esp. from North America), the rights and resources of an indigenous person (who was born there - Jewish or non-Jewish) are diminished. \n\nIt would seem to make sense that except for the economic figures of it. The economic model of Israel is centered around immigration. Its known as a Start-Up nation specifically because of migrants who had absolutely nothing showing up and someone locally in Israel investing in them.  Besides the Jews of North America are heavily oppressed and need access to this right to escape the antisemitism that exists within Canada and the United States of America. For instance both countries force Jews to pay tribute to Christians through additional taxation to fund the Christian sabbath. Our customs are nearly completely criminalized and there is literally a War on Jews that President Nixon started because Bob and him thought we smoked too much pot. North America is much worse than you think, but you've chosen to blind yourself to the plight of the Jewish people there so you don't see or understand it.\n\n&gt;When we look at the worst settlers in the West Bank, they are mostly foreign-born who moved to Israel mostly due to their failures back home and not because they were under any threat, economic, political or physical whatsoever.\n\nTo be honest it was the same exact case for most of the Palestinians that flooded the West Bank from the previous generation. None the less most move because they were being taxed additionally for being Jewish and risked being put in prison for keeping Kosher like Agriprocessors was. Then currently on the right we get heat from the white supremacist antisemities whereas on the left we get heat because Jared Kushner is a Jewish person who Pres. Trump is related to. Again there is also the mandatory tribute to cover the Christian pay premium on their sabbath and the enforced recognition of Christian holidays like Christmas. Not to mention the Christian indoctrination that goes on in the \"secular\" public education that complete ignores Semitic history instead focusing on Christian and Greco-Roman history.\n\n&gt;They moved to the settlements and their main contribution to Israel or humanity is killing or harassing the Palestinians.\n\nExcept when they are pulling in major business. For example Oracle just moved to Israel because of a Jewish-American immigrant. 3DSignals, Nsof Networds, Bonono.ai, Toonimo, and Zoomin are also all Jewish-American led start-ups in Israel. There are whole web searches with pages of companies started by Jewish-American Olim. Just search it and you'll quickly see the contribution. However I understand murder is upsetting which is why Israel put the Israelis responsible in prison. Unlike the Palestinians who rewarded the murders of:\n\n* Eyal Yifrach\n* Gilad Shaar\n* Naftali Fraenkel\n\nIf apologies are needed then they are truly needed on both sides. As for the video... So you found some wanker with an opinion. Do you really want me to post one of the several IS recruitment videos on YouTube from the Palestinian side?\n\n&gt;Oh and the xenophobic American researcher works for the Simon Wisenthal centre. Yes, the same centre that has just added Airbnb and UNRWA to the list of antisemites of 2018\n\nI mean it was pretty antisemitic to straight up refuse to do business with only Jews in a specific region. It is a form of discrimination and discrimination against Jews is antisemitism. \n\n&gt;I think Israel needs to tighten its migration laws. A French or American Jew who lives in an environment where the Jews are more protected than anybody else in the whole world shouldn't be automatically admitted to Israel just because. Needless to say that they form a burden on the economy since they are not needed per se and their dominant trait of extremism actually make it difficult for everybody else to live together. \n\nAs far as anyone being xenophobic it is clearly you who are the xenophobe. Every Zionist did the most un-xenophobic thing by packing up their things and literally moving to a \"xeno\" region. Whereas you heap insults and accusations at them, tell them never to come, and advocate for keeping all the foreigners out. Quit being so arrogant. People have shit happening in their lives that you are not aware of and you're acting like a xenophobe.", "score": 3, "send_replies": true, "subreddit": "Israel_Palestine", "date_year_month": "2018-12", "created_utc_converted": "2018-12-28 17:59:36", "score_overall": 19, "words": "jewish jew jewish jewish holocaust jewish holocaust holocaust jew jewish jewish jewish jewish kosher jewish jewish jewish jewish jew", "shared_words": "jewish jew holocaust kosher", "socre_distint": 4}
{"archived": false, "author": "ShoegazeJezza", "body": "I always used to assume most of /pol/ was ironic when they posted conspiracy theories about Jews and shit, but it turned out most posters were 100% serious. I think a lot of posters were actually joking before though, like even around 2014/2015, but now it’s 100% unironic. \n\nI’m pretty sure the racist Jew drawing meme (happy merchant) was shared a lot at first because antisemitism is such an absurd prejudice (Jews control everything, they eat babies etc.) that people found it funny and weren’t being 100% serious about actually believing things like the holocaust never happened, Jews control the media etc. but over time 4chan has become more and more like StormFront.", "score": 69, "send_replies": true, "subreddit": "enoughpetersonspam", "date_year_month": "2018-12", "created_utc_converted": "2018-12-29 19:36:11", "score_overall": 4, "words": "conspiracy jew merchant holocaust", "shared_words": "conspiracy jew merchant holocaust", "socre_distint": 4}
{"archived": false, "author": "mizrahim", "body": "&gt; You're missing the point that they DID live there\n\nWhat is your point? My argument is that a Jew being \"Polish\" or \"Iraqi\" isn't something intrinsic but rather something decided by Europeans splitting up lands.  \n\n&gt; Israel is more like the USA in that they genocided people to then colonize the empty space.\n\nThis is wrong for multiple reasons. Firstly, The Palestinian population has quadrupled in the last century. That's not genocide. If you look at the entire conflict the death toll of Jews isn't much lower then the death toll of Arabs. The second, and more important point is that the only people living in lands which used to be Palestinian villages are certain kibbutzniks and the Jews in Lod/Ramle. Petah Tikva, Netanya, Holon, Ramat Gan, Rehovot, Bat Yam, Bnei Brak, Herzilya, Rishon LeZion, Hawera, Ra'anana. None of those cities existed before Zionism, and they weren't built on land taken from Arabs or anyone for that matter.\n\n&gt; Wow really? I guess Rosa Luxemburg was a real geographical oddity then!\n\n\nShe was. Most Jews did not speak any other language than Yiddish, the ones that did were middle/upper-class assimilated Jews. This is why it was so easy to identify them during the Holocaust, meanwhile an assimilated Jew without the accent could pass.\n\n&gt; Well, why would all the Jews then be able to coexist? They don't share anything except their religion, but their ethnicities are different, since both are an identity.\n\nI'm glad you asked this. Firstly, we share a lot more than just religion. We have languages, calendar, foods, music, everything that makes up a people we have. \n\n&gt; So why would a Jewish state be able to be without ethnic conflict if it has various ethnicities in it? \n\nBecause we recognize that we are a multi-ethnic group due to diaspora. \nAlso something like 40% of Israeli children are mixed. \n\n&gt; And in fact, isn't this literally what Israel is? I seem to remember them chemically castrating black jews and kidnapping arabic jews for the benefit of the Ashkenazi Jews IIRC.\n\nThe vast majority of Jews in Israel get along with each other great regardless of race or ethnicity. Nobody ever got castrated. An Israeli doctor gave about a dozen Beta Israel women birth control without fully explaining to them it's duration (it lasted 3 months). They were able to have children after, and they weren't forced to take it. The controversy was over the fact that the type of birth control they offered them wasn't the typical kind they gave to recent immigrants. That doctor lady was clearly racist as hell, but to take that and say the Israeli government is \"castrating\" their black population makes no sense. As far as \"kidnapping Mizrahim for the benefit of Ashkenazim,\" the same thing that happened to Yemenite children happened to some Ashkenazi children as well, most notably a Holocaust survivor couple. Personally I think it was sheer incompetence rather than a conspiracy to take children away from their parents and give them to \"more deserving\" parents. ", "score": 3, "send_replies": true, "subreddit": "stupidpol", "date_year_month": "2018-12", "created_utc_converted": "2018-12-30 12:58:59", "score_overall": 6, "words": "jew holocaust jew jewish holocaust conspiracy", "shared_words": "jew holocaust jewish conspiracy", "socre_distint": 4}
{"archived": false, "author": "ARealLibertarian", "body": "&gt; I mean, they already say anyone who points out George Soros having his fingers involved in stuff is a dogwhistle for the \"Jewish Conspiracy\"\n\nDon't you know he's a Holocaust survivor! Sure he might have spent that time going around confiscating all the other Jew's property for Hitler, but he's still a Jew who was around the Holocaust and survived! I mean by that standard [Erhard Milch](https://en.wikipedia.org/wiki/Erhard_Milch) was a Holocaust survivor too but let's ignore the contradictions here!\n\nAlso he's spent decades crashing third-world economies so he loot the wreckage but that's OK as long as you support the right political positions (like how the CIA is now totes OK with Democrats now that they're trying to undermine Drumpf's dangerous peace-mongering).", "score": 18, "send_replies": true, "subreddit": "KotakuInAction", "date_year_month": "2018-12", "created_utc_converted": "2018-12-31 03:51:29", "score_overall": 7, "words": "jewish conspiracy holocaust jew jew holocaust holocaust", "shared_words": "jewish conspiracy holocaust jew", "socre_distint": 4}
{"archived": false, "author": "MDEWorldPeace6969696", "body": "\"Some religion\" or \"joking about religion\" are obfuscating.\n\nSay it like you mean it: just like Feminists and other degenerates you love bashing ALL sects of CHRISTIANITY.\n\nWhether it be Catholic Pedos, \"weird\" Amish/Hutterite/Mennonite/Mormon/Jehovah's Witness/Born Again/Baptist, or whatever offshoot, you LOVE it --- you get off on it!\n\n\"I'm just criticizing the one mainline religion that won't lead to being blacklisted by Jews or terrorized by Muslims!! Damn that Patriarchal, Heteronormative FUCKING WHITE MALE religion of Christianity! Those stupid Africans and Asians who follow it should be part of the religion of PEACE: Islam!\"\n\n\"What has Christianity done anyways?!?! I mean, Obama was right: the Crusades were just bloodthirsty White males re-conquering territory that was rightfully Muslims!!! \n\nThen you have the \"edgy Atheists\" who are so blackpilled that they'll say people are \"meming\" or \"LARPing\" as Christian then they'll suck Kosher Jew balls, believe the Holocaust happened even though Jewish leaders are \"swell people;\" meanwhile they were pimping German women and children and promoting degenerate art like some Dystopian 1984 shit; and then you have Islam where we're damn lucky the Spanish conquered South America after 100's of years of Crusades otherwise it would be a bunch of Muslims on the US Southern Border instead.\n\nIt's just so tiresome knowing the reality that with all its \"cult like\" sects, Christianity is leagues better than an insular rootless international clique tribe that complains about \"under-representation\" of minorities precisely to \"dethrone\" Whites from their \"privileged\" position (even though Whites often worked their way up rather than nepotistically being handed shit; or in the case of degenerate art: Millions of $$$ for some \"post-modernist\" period blood painting); then you have Muslim countries killing you if you disrespect their pedophile warlord prophet.\n\nThe West is now absolutely degenerate. The religion of White Western countries was historically Protestantism: belief in Christ as the saviour; based on faith alone and without the sanctity of the Roman Catholic Church which is believed to be \"tainted\" (and who can blame this thinking? The pope is some Leftist Commie freak who's hinted at there being no hell, gays being a-okay, Communism being the way, etc). \n\nIt's also sad that people will say \"mainline religion\" or \"'The Church' is corrupt\" as if Mosques and Synagogues aren't, but I guess ingrates only would see the corruption, and not the larger amount of charitable money and volunteering as opposed to \"non profits\" which donate like 5% of the Revenues to kids in Africa instead of local issues.\n\nI liken it to Judaism being the insular \"chosen people,\" Christianity as being a 3rd path of sorts as opposed to all Paganism and Judaism, and then Islam just a straight up death cult that \"isn't a problem\" until the r-selected fuckers elect one of their own as Mayor of London (Sadiq Khan), start demanding lyrics about \"blonde haired blue eyed maidens\" be changed in Denmark, and then ofc people being so ignorant to ignore the death of Christianity in places like Lebanon, or the fact Islam becomes 99.9% of a country's religious population by anything but \"peaceful\" means.\n\nThe \"West\" is going to hell on an express lane highway. Whether you believe in \"religion\" (belief in the supernatural) or not, the mark of the beast will come soon enough: you'll be microchipped to buy and sell shit, and eventually just to live. The Plebs will gleefully accept their fate and believe lifespans are increasing and everything's great when really that's just old people propping up the life expectancy age, and we're dying younger of more and more fucked up shit, and that, my friend, is just the icing on the cake...", "score": 1, "send_replies": true, "subreddit": "MGTOW", "date_year_month": "2018-12", "created_utc_converted": "2018-12-31 21:16:22", "score_overall": 4, "words": "kosher jew holocaust jewish", "shared_words": "kosher jew holocaust jewish", "socre_distint": 4}
{"archived": false, "author": "WannaWaffle", "body": "But you are hearing the dog whistles.  Reread your post.  Your points are saying essentially \"just because its true doesn't make it hateful\".  But it isn't true.  Generalizations like these are the very definition of bigotry - they define the group by characteristics you want to see in them; characteristics for which you can find a few examples  (examples can always be found) but which do not define the group.  The \"no true scotsman\" fallacy that Conservative and Reform Jews \"aren't real Jews\" is just a way of saying \"they don't match my wish for what the definition of 'Jew' is so my point is still valid.\"  I'd remind you that non-literal interpretation of the Bible and recognition that performing rituals does not define Judaism goes back to at least the 12th century in Jewish thought and that you don't get to decide how people of other faiths may view the content or value of their scriptures. \n\nThe idea that the organizers of part of the Women's Movement represent entire population that holds equality to be important is an indictment of the idea of equality or those who support it is based on a few cherry-picked participants that are in no way representative of those who hold the ideas.  \n\n\"Fake Nazis\"?  Is Heather Heyer \"fake dead\"?  The fact is that real people in Germany, Poland, Ukraine, Lithuania and elsewhere - regular normal, average people consumed by ideology - committed the crimes of the Nazis.  They weren't some sort of special monsters.  The people at Charlottesville are also regular people consumed with ideology and the result was also death, and they, like the \"real?\" Nazis had no remorse or concern.\n\nThe presumption, or even the suggestion that sexual predators is an attack against Jews assumes that one can agree with the statement that all Jews identify with sexual predation.  The Soros reference is just a Fox News standard that is, again, a definition of a group by using an individual as a model.  And the term \"globalist\" has a long history in accusation of a worldwide Jewish conspiracy from the some of the Leninists to more modern philosophers and businessmen.  But even there, it was cherry picking to make generalizations.\n\nIt is clear that you don't hear the dog whistles because that noise is indistinguishable from everything else you are hearing. ", "score": 1, "send_replies": true, "subreddit": "AskReddit", "date_year_month": "2018-12", "created_utc_converted": "2018-12-31 21:49:16", "score_overall": 5, "words": "jew jewish globalist jewish conspiracy", "shared_words": "jew jewish globalist conspiracy", "socre_distint": 4}
{"archived": false, "author": "DHhdhdhdh377411112", "body": "He’s lying. He’s an anti-Semite triggered by seeing something relating to Jews on Reddit. Goyim is Hebrew for “the nations” and basically means gentile or non Jew. Neo nazis love to use the word sarcastically online. Go to any YouTube video about the holocaust and you’ll probably see neo nazi propaganda using it in the comments exactly the way he did. They often say “bad goy” or “the goyim know, shut it down!!”  These people also usually deny that the holocaust happened or that it happened the way it did. \n\nAnd if you need more evidence he’s an anti-Semite:\n\nhttps://www.reddit.com/r/wallstreetbets/comments/a7tb5w/comment/ec6sjdy\n\nThe triple parenthesis he uses there is a neo nazi thing to deragatorily denote a Jew or something they think is Jewish. He thinks Jews control the Federal Bank and do evil things.", "score": 5, "send_replies": true, "subreddit": "trashy", "date_year_month": "2018-12", "created_utc_converted": "2018-12-31 22:53:40", "score_overall": 7, "words": "goyim jew holocaust goyim holocaust jew jewish", "shared_words": "goyim jew holocaust jewish", "socre_distint": 4}
